{
  "cluster_id": 22,
  "size": 51,
  "vectors": [
    {
      "id": "1067",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on Blu-ray[]\n\nVader's Arrival and Reaching Out to Luke — After Darth Vader tells Moff Jerjerrod that the Emperor is coming, Vader goes back to his private chamber and begins to reach out to Luke. Later on Tatooine, as Vader is reaching to him through the force, Luke finishes building his brand new Lightsaber and ignites it for the first time. He then inserts it in a secret compartment in R2-D2's dome. R2 heads out of the cave, then he and C-3PO go to Jabba's Palace.\nRebel Raid on the Bunker — An additional battle in the shield bunker, where Han and Rebel soldiers encounter a squad of stormtroopers outside the control room. Han also reacts to being called \"Rebel scum.\" (This scene was later used as gameplay in the \"Triumph of the Rebellion\" mission in Star Wars: Rogue Squadron III: Rebel Strike.)\n\n",
        "section": "Completed scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 203.0
      }
    },
    {
      "id": "1084",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Season Two[]\n\n\"Holocron Heist\"\nTodo Decoding Jedi Temple Shield — Extended scene in which Todo 360 turns off the Temple shield.\nJedi Temple on High Alert — Jocasta Nu warns Ahsoka of the Temple alert status.\nBane Giving Todo Orders — Cad Bane works on cutting through to the communication center while Cato Parasitti talks to him as Jocasta Nu over the comm.\n\"Cargo of Doom\" (Incomplete scenes)\nDeleted Vulture Droid Attack — Early layout\nCad Bane Opens Holocron — Alternate ending\n\"The Zillo Beast Strikes Back\"\nStrategy in the Jedi War Room — Yoda instructs Mace Windu to retrieve the stun tanks.\nTrapped in Palpatine's Shuttle — The Zillo Beast holds the shuttle while Anakin decides what to do and C-3PO despairs.\n\"Senate Spy\"\nPadmé Glances Over Shoulder — After walking away from Rush Clovis, Padmé looks back while walking up a staircase.\nAlternate Ending Outside Palace — Early layout (Incomplete)\n\"Weapons Factory\" (Incomplete scenes)\nAlternate Episode Introduction — Early layout\nBarriss/Ahsoka Extended Dialogue — Early layout\nExtended Anakin/Luminara Discussion — Early layout\n\"Brain Invaders\" (Incomplete scenes)\nWormontage — Compilation of shots of brain-invading worms going into clones.\nAlternate Episode Introduction — Early layout\nMedical Frigate Hallway Conversation\nExtended Barriss/Ahsoka Battle\nAlternate Obi-Wan/Ahsoka Scene — Early layout\n\"The Deserter\"\nCommando Droid Snipers — Extended scene of clones on speeders being sniped at by commando droids.\nAlternate Edit to Opening Montage — Early layout (Incomplete)\n\"The Mandalore Plot\"\nSatine Saves Obi-Wan — Extended scene in which Obi-Wan beats up some Mandalorians and uses the Force to pull some crates over them.\nPre Vizsla Conspires with Count Dooku — Dooku warns Pre Vizsla via hologram not to allow the Duchess' political actions. (Incomplete)\n\"Voyage of Temptation\"\nObi-Wan Destroys Assassin Droid — Extended scene in which Obi-Wan finishes destroying the assassin droid and tells Orn Free Taa to sheath his weapon, actually some meat he was eating.\nAlternate Scene of Tal Merrik and Dooku — Early layout (Incomplete)\n\"Duchess of Mandalore\"\nAnakin Speaks with Mas Amedda — Anakin discusses the Mandalore mission with Mas Amedda.\nPadmé Challenges Mas Amedda — Padmé questions why Satine has been declared an enemy of the Republic, and Amedda announces Anakin will be going early on his mission.\nRepublic Fleet Ordered to Stand Down — Rex tells Anakin the Senate has voted against occupation, so the troops are ordered to stand down.\n\"Senate Murders\"\nAlternate Ending in Senate Hallway — Early layout (Incomplete)\n\"Cat and Mouse\"\nAlternate Episode Ending — Early layout (Incomplete)\n\"Bounty Hunters\"\nAlternate Embo Death Scene — Early layout (Incomplete)\n\"R2 Come Home\" (Incomplete scenes)\nDeleted Scene of R2 and Jocasta Nu — Early layout\nDeleted Scene of Space Gunship Rescue — Early layout\n\"Lethal Trackdown\"\nAlternate Boba/Mace Ending — Early layout (Incomplete)\n\n",
        "section": "Season Two[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 704.0
      }
    },
    {
      "id": "1093",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Cut scenes[source?][]\n\nAn opening title crawl.\nA shot of the Death troopers torching the Erso farm.\nJyn Erso saying, \"This is a rebellion isn't it?... I rebel,\" to Mon Mothma. The scene was in one of the trailers.\nGeneral Draven asking Jyn to \"state your name for the record\", as well as \"can you be trusted without your shackles?\" with Jyn replying \"Yes sir\".\nJyn addressing Mon Mothma and Cassian saying \"Let's get this over with shall we?\".\nMon Mothma stating \"We've intercepted a coded Imperial transmission, it indicates that a major weapons test is imminent.\"\nAn overhead shot of Jedi statue ruins on Jedha.\nJyn sitting in the pilot seat of the U-wing on Jedha with her and Cassian both stating \"Good\".\nCaptured Rebel pilots on Jedha (altered in a later trailer to remove blood from the face of a soldier).\nK-2SO stating to Jyn \"The Captain says you are a friend, I will not kill you\" with Jyn replying \"Thanks\".\nSaw Gerrera without hair on Jedha.\nSaw Gerrera stating \"The world is coming undone\".\nBaze Malbus stating \"They destroyed our home\" and \"I fight the Empire now\".\nOrson Krennic in the Death Star control room.\nOrson Krennic telling Darth Vader: \"The power that we are dealing with here is immeasurable.\"\nDarth Vader in the Death Star control room.\nJan Dodonna surrounded by Rebel soldiers and pilots in the Yavin hangar.\nA shot of Rebel soldiers taking cover over a hill on the Scarif beach.\nK-2SO stating \"That is a bad idea\" instead of \"I have a bad feeling...\".\nJyn looking towards the camera inside the tunnel to the data vault while it is lighting up.\nJyn with a blaster facing off against a TIE Fighter at the top of the communications tower.\nJyn, Cassian, and K-2SO running through the citadel with the Death Star plans.\nJyn and Cassian Andor run across the beach with a data-tape. This was due to the citadel and the communications tower being two separate buildings originally, forcing the heroes to run across the beach to the other building in order to transmit the plans.\nOrson Krennic walking through the shore on the Scarif beach.\nMoroff present during the battle on Scarif.\nCassian Andor and K-2SO originally were filmed dying next to each other on Scarif lying near a doorway.\nAlan Tudyk has stated that K-2SO was originally supposed to meet his end at the hands of Orson Krennic.\n\n",
        "section": "Cut scenes[source?][]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 576.0
      }
    },
    {
      "id": "1078",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Incomplete scenes released on Blu-ray[]\n\nExtended Speeder Chase — Anakin and Obi-Wan share a speeder while pursing Zam Wesell. Obi-Wan has to remove a flag that gets stuck in the engine.\nThe Lost Twenty — Obi-Wan and Jocasta Nu discuss Count Dooku and the Lost Twenty.\nAnakin's Nightmare — En route to Naboo, Anakin begins having nightmares about his mother.\nAnakin and Ruwee — Anakin walks with Ruwee in their garden.\nRaid on the Droid Control Ship and Extended Arena Fight\nRaid on the Droid Control Ship — Obi-Wan and Mace fight in the arena while Ki-Adi-Mundi, Plo Koon, and a few other Jedi raid one of the landed Droid Control Ships.\nThe Ground and Air Battles Continue — After Mace beheads Jango, Ki-Adi-Mundi leads the raid of the Control Ship. Many other scenes of arena fighting are seen.\nDroids Are Shut Down But Come Back On — Anakin, Padmé, and Mace discuss why the droids haven't been deactivated. Ki-Adi-Mundi overpowers the Neimoidians running the Control Ship and turns them off, providing respite in the arena. They then reactivate and continue battling. (Since Episode I, they have had an independent backup system.) All the Jedi who accompanied Mundi and Koon perish, leaving only the two Masters. The outcome of this scene can be partially spotted in the final film, with Mundi and Koon being lead back by battle droids to the remaining group of Jedi during Dooku's offer of surrender.\n\n",
        "section": "Incomplete scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 358.0
      }
    },
    {
      "id": "1070",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nA slightly extended version of Darth Vader's arrival in the second Death Star's hangar to speak with Jerjerrod shows more of Vader actually walking down the ramp. This shot was later utilized in the Special Edition of The Empire Strikes Back.\nAn alternate shot of Greeata Jendowanian and Rystáll Sant reacting in horror to Oola execution.\nLuke using a force jump to escape the rancor and hanging from the ceiling grate until two Jawas bang their rifles on his hands, forcing him to let go. The scene appears in the Return of the Jedi novelization and in Return of the Jedi: The Storybook Based on the Movie. A promotional photo of the scene appeared on a Topps trading card.\nPeter Diamond wearing some kind of lightbulb suit in Jabba's Palace, as part of the design of an alien supposed to be added later in post-production.\nDrunk guests having a party aboard the sail barge.\nBarge fight between Ree-Yees and Saelt-Marae with C-3PO translating.\nLuke fighting with a blue lightsaber. The blade was later colored green to make it easier to see in front of the blue sky.\nAfter killing Jabba, Leia struggling to reach a nearby blaster pistol (which can be seen in front of her before the original scene cuts), but can't as she is still chained to Jabba's body. R2-D2 then comes to cut her chain, just as in the original film. A still promotional photo and a continuity photo of the scene exist, and it remains in the novelization and the Marvel Comics adaptation of the film.\nLeia getting a vibro staff and attacking a human sail barge gunner, before she goes up to the cannon to point it at the deck. A fraction of that footage can be seen in the final film where Leia moves to pick up the staff before Luke tells her to point the cannon at the deck. A far off view of that full scene being filmed can be found in some behind the scenes footage. Glimpses of the scene can be found as promotional photos, one of which was adapted for a panel of the Marvel adaptation of the film. The scene was also adapted in the second issue of the Star Wars Manga: Return of the Jedi comic series.\nVader and several other Imperials walk down a hallway to the hangar where the Emperor will be arriving on the Death Star. Frames of this scene can be found on T-bone's Star Wars Universe website, and a promotional photo featuring the scene appears on a Topps trading card.\nExtra scenes of the Emperor walking through the Death Star with Vader, Jerjerrod, and his advisors.\nThe Return of the Jedi Edit Droid Laserdisc featured a silent 59 seconds of R2-D2 repairing Luke's X-Wing on Dagobah and about 29 minutes of Frank Oz being fed lines as Yoda. Among the scenes included the filming of a scene that revealed that Yoda had forbade Obi-Wan from telling Luke about Vader being Luke's father.\nBen's monologue.\nExtended Rebel briefing and departure for Endor, including Luke and Leia saying goodbye to Lando before he and Han see each other off.\nVader and Piett peering over the scanning officer's shoulder.\nExtra shot of Leia on Endor.\nJerjerrod getting stunned by a Force pike.\nExtra shots of the Rebel strike team taking defensive positions outside of the Endor shield generator bunker.\nDarth Vader lands in the Death Star docking bay with Luke, taking him to the Emperor.\nLuke refusing to fight Vader and throwing him his lightsaber. Vader can be seen holding it along with his own in the final film as he searches for Luke in the throne room.\nIt was rumored that the B-Wing fighters would be given more to do during the battle in the Special Edition[source?], however this proved to be untrue. A promotional photo of B-Wings flying away from an exploding Star Destroyer during the Battle of Endor does however exist.\nExtra shots of Lando Calrissian, Wedge Antilles, and several other Rebel pilots, including some of the cut ones, talking during the battle, notably when the Death Star begins to turn to face Endor and while they are flying through the superstructure during their assault on the reactor.[source?]\nA teaser trailer for the film (still using the \"Revenge of the Jedi\" title) and the 1982 theatrical trailer both feature a shot of Wedge Antilles in profile, inside his X-wing cockpit as it flies through the Death Star interior.\nExtended Rebel and Ewok celebration including Lando hugging Leia along with Han and Luke shaking hands with Wedge. The shot of Wedge and Luke was later re-added into the special edition.\n\n",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 986.0
      }
    },
    {
      "id": "1071",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on DVD[]\n\nThe Waterfall Sequence — Qui-Gon Jinn, Obi-Wan Kenobi, and Jar Jar Binks escape their bongo before it goes over a waterfall.\nDawn Before the Race — Padmé waking Anakin the morning of the podrace.\nComplete Podrace Grid Sequence — Introduction to the racers before the podrace, beyond that seen in the film, including an appearance of Ratts Tyerell's family.\nExtended Podrace Lap 2 — An extension of the scene, which was partially reincorporated into film.\nAnakin's Scuffle with Greedo — Anakin has a fight with Greedo, who accuses him of cheating, and Qui-Gon stops them.\nFarewell to Jira — After saying farewell to Jira and giving her credits, Qui-Gon destroys one of Darth Maul's probe droids following them. Qui-Gon and Anakin break into a run, explaining why they are running to the ship in the film.\nThe Air Taxi Sequence — About ten seconds of additional footage on Coruscant.\n\n",
        "section": "Completed scenes released on DVD[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 230.0
      }
    },
    {
      "id": "1077",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on DVD[]\n\nPadmé Addresses the Senate — Padmé speaks before the Senate and objects to plans to create an army to fight against the Separatist movement.\nJedi Temple Analysis Room — Obi-Wan has the Kamino saberdart analyzed in the Analysis Rooms in the Jedi Temple.\nObi-Wan and Mace - Jedi Landing Platform — Obi-Wan and Mace Windu discuss the mystery of the missing data on Kamino and Anakin's ability to protect Padmé while Obi-Wan boards his Jedi starfighter. (This is replaced in the film with a discussion between Obi-Wan, Mace, and Yoda discussing it all together.)\nExtended Arrival on Naboo — Anakin and Padmé walk with R2-D2 and discuss her time as Queen on Naboo.\nPadmé's Parents' House — Padmé introduces Anakin to her family at her Naboo villa. Anakin can be seen walking with Ruwee through the window.\nPadmé's Bedroom — Padmé shows Anakin her bedroom, which has holographic images of her humanitarian work.\nDooku Interrogates Padmé — Anakin and Padmé are brought before Count Dooku, Jango Fett, and Poggle the Lesser and request Obi-Wan's release. Dooku says he cannot do so unless Naboo joins the Separatist movement, giving reasons for why he is forming the new government.\nAnakin and Padmé on Trial — The couple is put on trial by Poggle the Lesser, who finds them guilty. (After the scene where they go before Dooku was cut, this scene was made unnecessary.)\n\n",
        "section": "Completed scenes released on DVD[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 362.0
      }
    },
    {
      "id": "1080",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on DVD[]\n\nGrievous Slaughters a Jedi: Escape from the General — Anakin and Obi-Wan round a corner and find General Shaak Ti being held hostage by General Grievous. Anakin and Obi-Wan are quickly surrounded by Battle droids and Grievous kills Ti with a shiak strike to the chest. Anakin and Obi-Wan have a brief sign language argument over what method they should use to escape, then draw their lightsabers and slice a hole in the floor. They fall down into a the Invisible Hand's fuel tank and the surrounding battle droids proceed to take aim, but the experienced Separatist commander orders his troops not to fire in order to prevent the fuel from igniting. As the two Jedi climb out of the fuel tank, B2 super battle droid attempt to follow them but are cut off when Anakin seals the exit shut. The fuel rises to an overload discharge spark gap, and the section of the ship explodes. (This scene was included in LEGO Star Wars: The Video Game, but Shaak Ti is not present and the generator room is not flooded. Due to Shaak Ti's appearance later in the film, this scene is non-canon.)\nRebel Alliance subplot\nA Stirring in the Senate (Bail's Office) — Senators including Bail Organa and Mon Mothma present the movement against the Chancellor to Padmé, sowing the seeds of the Rebel Alliance.\nSeeds of Rebellion (Padmé's Apartment) — Padmé suggests bringing the plan to the one Jedi she trusts, but the group agrees to appeal to the Senate first.\nConfronting the Chancellor (Palpatine's Office) — The senators, now including Jar Jar, present the petition to Palpatine and Anakin, who is acting as his personal bodyguard.\nA Plot to Destroy the Jedi? — Obi-Wan, Mace, and Yoda meet in the Temple to discuss the darkness surrounding Chancellor Palpatine.\nYoda Exiled to Dagobah — Yoda arrives on Dagobah in the final montage. (This scene is mentioned in the novelization.)\n\n",
        "section": "Completed scenes released on DVD[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 457.0
      }
    },
    {
      "id": "1081",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Incomplete scenes released on Blu-ray[]\n\nElevator Antics — Anakin and Obi-Wan banter while waiting for the elevator on the Invisible Hand. Additional cut lines include Obi-Wan commenting how elevators never come when you need them, as they block blaster bolts from the oncoming Droidekas; and the Jedi pair mockingly saying \"Roger roger\" after they defeat the battle droids in the elevator.\nChanges to Constitution — Palpatine presents legal changes meant to end the war to Anakin.\nUtapau Chase Animatics — The chase between Obi-Wan and General Grievous was supposed to be much longer. The pair raced along a road between the full battle of Utapau. Grievous was supposed to drive his bike through a speeding train. The scene also involved grievous driving in place to fling broken clone trooper at Kenobi and Boga. The pair drive out onto one of the massive turbines overlooking the sinkhole. Grievous drives on the spinning mechanism to make the turbine spin, creating a dividing line between the two adversaries. Grievous speaks into a comlink that he will meet with his fleet in moments. Obi-Wan then uses his lightsaber to sever the blades. However, one of the blades cuts into another turbine, which spins loose breaking the nub of their turbine off. The pair hang off another turbine below. Grievous manages to pull away, but in the process, the turbine breaks off and swings under, cutting the boom in half. Kenobi is hanging onto Grievous' bike. Grievous knocks him loose with his electrostaff, but the Jedi grabs onto a cable dragging from the vehicle. Kenobi loops it around a rock, causing the bike to break apart. The wreckage comes to rest on the landing platform where the General's starfighter is located. Grievous retrieves his blaster but he is trapped under the wreckage. Obi-Wan emerges from the darkness and spots the electrostaff sparking by the wreckage. He tries to grab it but Grievous bursts out of the wreckage and starts shooting at Kenobi. Kenobi grabs the electrostaff but Grievous flings him around and begins punching him in the face with his metal fists. However, Obi-Wan breaks free and rips out Grievous gutsack and then blasts it with the blaster. As grievous falls dead, Obi-Wan gives the body a kick and the general falls in to the pit below. This scenes was cut as it was considered too \"gory\" for a PG-13 film. Steven Spielberg oversaw the creation of the scene.\nAnakin Kills Shaak Ti — Anakin enters the meditation chamber in which Shaak Ti is concentrating and stabs her in the back, (This is the canonical version of her death and later seen in a vision to Yoda in The Clone Wars episode \"Voices\") before leaving the chamber and walking through the Jedi Temple as it is being attacked (The shot of Anakin walking was featured in the trailer, but with the background replaced with the Invisible Hand's walls).\nJedi Imposters at the Temple — When Obi-Wan and Yoda arrive at the Jedi Temple they find a group of clone troopers disguised as Jedi waiting outside. The two Jedi aren't fooled and kill them all. (This scene appears in LEGO Star Wars: The Video Game. The movie includes the second half of this scene, removing the dialogue and using CG to remove the clones' robes and give them 501st helmets.)\nYoda Communes with Qui-Gon — Qui-Gon Jinn speaks to Yoda, who names himself Qui-Gon's apprentice. (This scene appears in the novelization.)\n\n",
        "section": "Incomplete scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 774.0
      }
    },
    {
      "id": "1066",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nThe wampa is shown in full form dragging Luke back to its lair (the scene proved difficult to film, due to the costume's effect on actor Des Webb).\n2-1B evaluates a dead tauntaun (seen in background of the final film when Han asks where Luke has gone).\nLuke wears a Bacta mask to heal his facial scars.\nThe Probe Droid shoots down a \"snow squirrel\" once it emerges from its landing pod (an unfinished effects shot). This was changed to a Wampa in the original Empire Strikes Back novelization.\nAdditional scenes of the Rebels during the Battle of Hoth.\nSeveral extra snowtrooper scenes, including a shot of one manning an E-Web heavy repeating blaster.\nLuke returning to Echo Base amidst the wreckage of the battle.\nExtended confrontation with the swamp monster on Dagobah.\nExtra shots of the bounty hunters on the Executor's bridge, extended scenes of Vader talking to them, and a removed subplot of the bounty hunters chasing the Millennium Falcon.\nAdditional shot of Vader looming over Lorth Needa's body.\nExtended greeting between Han and Lando.\nA scene of Leia speaking with Ugnaughts.\nExtra dialogue and an alternate scene between Han and Leia on Bespin in which they kiss. (\"You should wear girls' clothes all the time.\")\nIn the first draft of the script, a scene was included that featured Han, Leia, Chewbacca, and Lando sitting at the dinner table with Vader. Both Han and Leia were to drink wine while Lando feasts himself and Chewbacca sits in silence. Han and Leia would argue with Lando and Vader, the former of whom loses his appetite. The scene was ultimately cut when Lucas rewrote the movie's script.\nExtended torture scene that includes alternate angles and Vader standing at the doorway.\nOriginally scripted scenes of Lobot were changed after it was decided the character would not speak.\nExtended Cloud City escape, with a longer scene of Lando attempting to open a door but finding it locked. In this shot, Lando, Leia, and Chewbacca run in from down the hallway, rather than the turbolift across from the door as seen in the movie. Additionally, the sequence of Lando rescuing Luke was to be longer.\n\n",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 473.0
      }
    },
    {
      "id": "1091",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nRey starting up her speeder.\nScenes featuring Zuvio, the constable of Niima Outpost. Ultimately, his appearance in the movie was cut to only about seven frames, in total.\nA shot featuring the Skywalker lightsaber being handed down to Leia Organa Solo by Maz Kanata in the Resistance Base, as well as the accompanying voicelines from Mark Hamill.\nRobert Boulter shot a cameo as Luke Skywalker in Rey's vision sequence for a recreation of the Duel on Cloud City that was also going to feature Darth Vader. The vision was also supposed to include a young Ben Solo meeting Snoke.\nAn appearance of Anakin Skywalker's Force Ghost.\nThe Resistance beginning their attack on Takodanna.\nMore scenes of Kylo Ren without his mask.\nAdditional footage of Leia. When Carrie Fisher died in 2016, this footage was used in The Rise of Skywalker.\nSeveral lines of dialogue from the trailer were cut, including Kylo Ren saying \"Nothing will stand in our way. I will finish what you started\", Finn saying \"I was raised to do one thing, but I've got nothing to fight for\", and Maz Kanata saying \"Hope is not lost today. It is found. Who are you?\", along with Rey's response, \"I'm no one\".\nAn alternate start to the lightsaber duel.\n\n",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 287.0
      }
    },
    {
      "id": "1058",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on Blu-ray[]\n\nLuke in the Desert/Tosche Station  — Luke Skywalker is in the Tatooine desert repairing a Moisture vaporator, assisted by a WED Treadwell repair droid, when he notices shining objects in the sky. Luke looks with his Macrobinoculars at two ships engaged in combat beyond the atmosphere. He jumps into his Landspeeder. The malfunctioning Treadwell blows a fuse and is unable to follow. Luke speeds off into the desert to find his friends. (This could have cut to the first film appearance of Darth Vader, although the scene is connected via circular wipe to the arrival at Tosche Station in the Blu-ray deleted scene. The next segment would follow R2-D2 and C-3PO ejecting from the Tantive IV in an escape pod.) Luke rushes into Tosche Station excitedly telling his friends about the battle above their planet. He is overjoyed to be reunited with his friend Biggs Darklighter who is on planet leave from the Academy. Camie, Fixer, and Biggs all follow Luke outside to see the battle with Luke's macrobinoculars. The battle appears to have ended and Luke's friends ridicule him for making it all up. (This scene was to come before Princess Leia being led captive before Darth Vader.) The footage has been degraded by poor film storage conditions, but was restored somewhat in the Blu-ray edition.\nReasons it was cut: The scenes were shot to humanize Luke Skywalker much earlier than in the final cut. It was removed along with subsequent scenes of Luke and his friends in Anchorhead, as it slowed the pace down. George Lucas had originally written the scenes and shot them at the suggestion of his industry friends who thought that audiences wouldn't understand the story being told from a droid's point of view. After Lucas's first screening of the rough cut of Star Wars in 1977, a fellow filmmaker jokingly accused him of producing \"American Graffiti in space.\" Upon realizing that the story was being told through the droids' perspective and it was them leading things to Luke, Lucas took the footage out.[source?]\n\n\n\nLuke and Biggs — This scene is a conversation between Luke and his oldest friend, Biggs Darklighter. Biggs has left Tatooine and is on planet leave from the Imperial Academy, where he is training to be a space pilot. Luke's envy of Biggs's success conflicts with his duty to his uncle and his reasons for remaining on Tatooine. Biggs quietly tells Luke that he has decided to join the Rebellion against the Empire. In an emotional exchange, the two young men say their farewells. (This scene was to come between the scene where C-3PO spots a distant Jawa sandcrawler in the desert and the capture of R2-D2 by Jawas in the canyon.)\nReasons it was cut: The Luke and Biggs sequence was part of the Anchorhead backstory on Tatooine and was cut along with the other early scenes on Tatooine for the same reasons.\n\n\nThe Search for Artoo — R2-D2 has absconded from his new master, Luke Skywalker. Early in the morning, Luke and Threepio rush off in the landspeeder to search for Artoo, with Threepio driving the landspeeder. They talk about Artoo, Ben Kenobi and how angry Uncle Owen is going to be. (The scene belongs at the start of the sequence where Luke and Threepio search for Artoo, before the attack of the Tusken Raiders. The moment was scored with a light version of Luke's theme; the music can be heard at the beginning of the cue \"Land of the Sand People\" on the original LP and CD configurations, or \"Landspeeder Search\" in the Special Edition album.)\nReasons it was cut: The landspeeder cockpit sequence had to be filmed against a rear-projection screen and was dropped due to poor quality.\n\n",
        "section": "Completed scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 828.0
      }
    },
    {
      "id": "1087",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Season Five[]\n\n\"A War on Two Fronts\": Droid Popper Training — A clone instructs the team how to use specialized explosives. Anakin, Ahsoka, and Obi-Wan share their plan. (Incomplete)\n\"The Soft War\": Rebels Talk Strategy — Lux returns to the others and is congratulated. (Incomplete)\n\"Tipping Points\": (Incomplete scenes)\nBattle for Onderon — Extended scene\nSteela's Fate — Alternate ending\n\"The Gathering\" (Incomplete scenes)\nPushing Beyond Fear\nArrival on Ilum — Extended scene\n\"A Test of Strength\" (Incomplete scenes)\nPetro's Skills\nHuyang's Lecture — Extended scene\nPirate Invasion — Extended scene\n\"Bound for Rescue\" (Incomplete scenes)\nRepairing the Crucible — The younglings repair the starship Crucible.\nHuyang Reactivated\n\"A Necessary Bond\" (Incomplete scenes)\nGorge Chase — Extended scene\nAhsoka vs Grievous — Extended scene\n\"Secret Weapons\": Meeting Dr. Gubacher — Extended scene (Incomplete)\n\"Missing in Action\": Gascon's Gameplan — Alternate scene (Incomplete)\n\"Point of No Return\": Cruiser Engine Room (Incomplete)\n\"Revival\" (Incomplete scenes)\nMaul's Master Plan — Maul and Savage plan to form an army of people that the Jedi have forgotten.\nAnakin's Frustration — Anakin expresses his frustration that he isn't going on the mission with Obi-Wan and Adi Gallia at the Chancellor's wishes. He sees Palpatine who tells Anakin he wants him to act as his bodyguard.\n\"Shades of Reason\" (Incomplete scenes)\nPeace Park Rescue — Extended scene. Bo-Katan and several of Death Watch soldiers rescue children from several Black Sun and Pyke mercenaries.\nMaul vs. Pre Vizsla — Extended scene\n\"The Lawless\" (Incomplete scenes)\nAnakin Loans the Twilight\nPalpatine Advises Anakin\nSith Duel — Extended scene of Palpatine fighting Darth Maul and Savage Opress.\n\"The Jedi Who Knew Too Much\" (Incomplete scenes)\nAnakin and Padmé — Anakin expresses his anger that Ahsoka has been put on trial for murder.\nAnakin Confronts the Council — Via hologram, Anakin asks if the Council if they really believe Ahsoka is guilty. Yoda speaks with him alone and encourages him to save his Padawan.\n\"To Catch a Jedi\": Anakin and Plo Refocus (Incomplete)\n\"The Wrong Jedi\" (Incomplete scenes)\nTarkin's Accusations\nChamber of Judgement — Alternate scene\nMarching Ahsoka Out\nAnakin Confronts Ventress — Extended scene\nTrial Arguments — Padmé defends Ahsoka, as Tarkin tries her and Palpatine judges.\nAnakin vs. Barriss — Extended scene\nAhsoka's Decision — Alternate scene\n\n",
        "section": "Season Five[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 607.0
      }
    },
    {
      "id": "1083",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Feature film[]\n\nThrough the Tanks — Anakin and Ahsoka make their way past tanks using the crate, briefly losing it.\nRancor Pit — Anakin and Ahsoka (carrying Rotta) are confronted by Ventress and her battle droids. As she approaches them, R2 activates a trap door through which everyone drops into a pit. Anakin duels Ventress while Ahsoka cuts the droids down. Ahsoka then finds a way out, but unleashes a jungle rancor. Skywalker and Ventress fight on top of the beast until Ahsoka stabs it between the eyes, resulting in the rancor falling on Ventress. R2 then takes out the last battle droid, and they leave. Ventress stings the jungle rancor, making it jump up.\nPlatform Droid Fight — Anakin calls for a gunship. However, as it lands, it is shot down, and a vulture droid attacks. Ahsoka and Anakin fight the vulture droid until Anakin cuts off its head.\nCargo Bay — As Anakin, Ahsoka, and Rotta escape aboard the Twilight, Anakin orders Ahsoka to empty the cargo bay. Ahsoka goes back there, where she begins to fall out but is able to hold on to a cable. The cargo then destroys several vulture droids, and Ahsoka uses her lightsaber to make the debris spread out to hit them. As Ahsoka returns to the cockpit, Anakin tells her that the bay doors were in front of her.\n\n",
        "section": "Feature film[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 337.0
      }
    },
    {
      "id": "1060",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nAdditional shot of the Rebel soldiers getting into position.\nVader oversees captured Rebel soldiers aboard the Tantive IV.\nAlternate dialogue between Vader and Captain Antilles.\nThere are many short alternate takes throughout Star Wars where Luke appears in his poncho which can be seen in stills and trading cards: Luke in the desert, in the Tusken Raiders' canyon, finding the destroyed homestead and in the hangar on Yavin 4. The only poncho scenes that made the final cut were in Docking Bay 94, on the Millennium Falcon flight from the Death Star, and the arrival on Yavin 4.\n\nAlternate establishing shot of Kenobi's hut and landspeeder parked outside, part of the Lost Cut.\nLuke decides not to replace C-3PO's restraining bolt in Kenobi's hut, from the Lost Cut. The scene appears in the film novelization.\n\nExtended dialogue between Luke and Ben inside Kenobi's hut.\nExtended conference room scene, with Cassio Tagge expressing his distrust for Darth Vader, referring to him as a \"Sith Lord\". This scene was later shown at Celebration 2017.\nObi-Wan proclaiming \"Well, there we are\" before describing Mos Eisley to Luke.\nOne long shot of the landspeeder traveling from the trooper checkpoint to the cantina, part of the Lost Cut.\nPonda Baba was originally supposed to be decapitated instead of losing his arm. Footage of his head bobbing around on the floor was shown at the Cantina Archaeology panel at Star Wars Celebration 2019. This was most likely cut due to a decapitation being more violent than a dismemberment.\nA patron of the cantina (Garouf Lafoe) leaves and reports the altercation between Obi Wan, Luke, Ponda Baba, and Dr Evazan to the stormtroopers. The camera follows him out of the cantina. In the final version in the film, he can briefly be seen just before an optical wipe and then immediately outside talking to the stormtroopers as C-3PO says, \"I don't like the look of this.\" This footage can be found on the \"Cantina Rough-Cut\" scene featured on the Blu-Ray.\nLuke is seen haggling over the price he gets for his land-speeder with Wioslea for a little longer than is shown in the film.\nJabba the Hutt confronts Han Solo at the Millennium Falcon. The original scene featured Declan Mulholland as a stand-in actor for Jabba, who was to be later replaced with an alien creature, but the technology at the time was not up to the task of creating it. In 1997, the scene was re-added in the Special Edition with Mulholland replaced by a CGI Jabba, which was enhanced upon in a later release. Additionally, Boba Fett was added in the background.\n\nExtra shots of stormtroopers searching Mos Eisley.\nA shot of a hidden gun on the Millennium Falcon shooting at stormtroopers was cut. This shot was later used in The Empire Strikes Back in the scene where Han, Leia, Chewbacca, and C-3PO reach the Millennium Falcon on Hoth.\nExtended Alderaan destruction, including additional dialogue and extra shots of the Death Star Overbridge after Alderaan's destruction, featuring Leia being led away by Darth Vader.",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 707.0
      }
    },
    {
      "id": "1061",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nAdditional dialogue aboard the Millennium Falcon as it approaches the Death Star. Mark Hamill disliked the lines so much that he begged George Lucas to remove them, which he eventually did.\nExtra dialogue during Han and Luke's argument on whether to rescue Princess Leia or not.\nExtra shots of stormtroopers heading to their stations.\nMore footage of Kenobi sneaking around the Death Star in search of the tractor beam.\nObi-Wan's line \"You can't win Darth. If you strike me down, I will become more powerful than you can possibly imagine.\" during his duel with Darth Vader was originally longer with the full line being \"You can't win Darth. If my blade should find its mark, you will cease to exist. But I warn you, if you strike me down I shall become more powerful than you can possibly imagine.\" Most of this longer line is used in the film's novelization and in the Marvel Comics adaptation.\nA brief gag aboard the Death Star where after several Stormtroopers run through a corridor, a GNK power droid finds itself alone and scurries off.\nA scene in which Han, Luke, Chewbacca and Leia swiftly make their way past several Imperials without their disguises before reaching the window overlooking the Millennium Falcon. The last few seconds of this scene remain in the film before Leia mentions \"You came in that thing? You're braver than I thought\". This can be found on J.W. Rinzler's The Making of Star Wars Enhanced Edition ebook.\nLuke and Han congratulate each other after the TIE attack on the Millennium Falcon.\nSeveral cut lines of Red Leader Garven Dreis and Gold Leader Jon \"Dutch\" Vander that were later used in Rogue One: A Star Wars Story.\nShots of TIE Fighter pilots running to their ships.\nThere was additional footage and dialogue of the Rebel pilot John D. He would have been shown having one TIE fighter kill before eventually being shot down. His death still exists on film, with the single line \"I'm hit!\"\nDialogue of Luke instructing the Millennium Falcon to flee from the Death Star after firing the proton torpedoes. Versions of this dialogue are used in the film's novelization and in the Marvel Comics adaptation.",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 466.0
      }
    },
    {
      "id": "1079",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nMace Windu and Yoda talk after a Senate meeting.\nAdditional shots of Anakin standing guard outside Padmé's bedroom.\nExtended dialogue between Obi-Wan and Anakin while outside the Outlander Club on Coruscant.\nExtended scenes of Anakin and Padmé's travel to Naboo.\nAdditional scenes of Anakin and Padmé playing in the field.\nA scene of Obi-Wan going back to Jango's apartment and finding it empty.\nOn Tatooine, while Anakin is searching for his mother, Padmé finds a box of C-3PO's coverings, and at the droid's request, puts them on him. (Lucas decided this took too much away from the main plot and re-shot earlier scenes involving C-3PO with him covered from the start. Apparently this scene was taken out relatively late, as Hasbro released a C-3PO action figure that included a box of parts to complete him. Ultimately, C-3PO would not get gold plates in the Legends continuity until the day Anakin was knighted.)\nAfter Anakin returns to Lars homestead with his mother's body, Beru helps Padmé prepare a meal for him using blue milk. Beru asks Padmé about Naboo; she remarks that she prefers the desert landscape of Tatooine, and that she does not like to travel.\nAdditional dialogue in the Lars homestead of Anakin apologizing to Padmé and her comforting him after he reveals he killed the Tusken Raiders.\nAdditional dialogue when Anakin and Padmé land on Geonosis, with Anakin grabbing her arm to stop her from leaving the ship and her telling him to let go.\nA close-up of Luminara Unduli and Barriss Offee in Chancellor Palpatine's office.\nA shot of Bail Organa speaking the line \"We must stop them before they're ready.\"\nExtended Jango Fett death, including Fett blocking Mace Windu's lightsaber with his armor.\nExtended Battle of Geonosis and the arena battle. Models of NR-N99 Persuader-class droid enforcers had been made for a scene featuring them running over clones.\nShots of Dooku wielding Obi-Wan's lightsaber alongside his own.\n\n",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 482.0
      }
    },
    {
      "id": "1089",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Rebels Season Three[]\n\n\"Twin Suns\" — Alternate scene where Maul sees Force vision of Satine Kryze and Savage Opress.\n\n",
        "section": "Rebels Season Three[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 38.0
      }
    },
    {
      "id": "1059",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Incomplete scenes released on Blu-ray[]\n\nOld Woman on Tatooine — As Luke's landspeeder races into the town of Anchorhead, he nearly runs over an old woman (an unfinished effects shot).\n\nAunt Beru's Blue Milk — A shot of Beru dispensing the blue milk before she joins Owen and Luke at dinner.\nCantina Rough-Cut — Rough-cut footage of the Elstree Studios location cantina scene taken from the Lost Cut. The footage features some creatures that didn't make the final cut, Jenny sits next to Han and makes out with him, multiple alternate takes and cut lines, the full Paul Blake Greedo confrontation, etc.\n\nDarth Vader Widens the Search — In this short scene, Darth Vader and Chief Bast walk along a corridor on the Death Star. Bast reports that the search for the missing droids has extended to Mos Eisley spaceport. Vader observes that Princess Leia is resisting interrogation and Bast boldly criticizes Tarkin's plan to break her as \"foolish.\" (The scene would have appeared between the scene where Han Solo encounters Jabba the Hutt and the scene where Luke and Obi-Wan find the Millennium Falcon in Docking Bay 94.)\nStormtrooper Search — Stormtroopers search the alleys of Mos Eisley for the missing droids.\n\nAlternate Biggs and Luke Reunion — The scene between Biggs and Luke in the Rebel hangar bay lasts longer, involving Garven Dreis speaking of knowing Luke's father when he was just a boy.\n\n",
        "section": "Incomplete scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 322.0
      }
    },
    {
      "id": "1076",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nWhen Qui-Gon and Obi-Wan are led into the Trade Federation conference room, some exotic bird-like creatures are singing in a cage near the door. When the Jedi notice the room is filling with deadly gas, the creatures drop dead in their cage as a cue that danger is literally in the air. (Included in the novelization).\nObi-Wan arriving on Naboo.\nQui-Gon lecturing Obi-Wan about allowing a lightsaber to die out.\nQui-Gon changing into his farmer disguise onboard the royal starship.\nJar Jar becoming disoriented, being flung onto the walls and tumbling numerous times in the skiff's lower level.\nJar Jar juggling equipment in Watto's shop.\nExtended scenes from Watto's Junkyard.\nFode and Beed (the pod race announcer) was originally portrayed by two human heads on a cgi body, however test footage of this version of the character was unworkable and was scrapped for a completely CGI version. This decision was made rather late into production however as the original action figure of the character was the scrapped version.\nAn extra shot of Qui-Gon lifting Anakin out of his podracer.\nR2-D2 was to fall off the landing platform on Coruscant and then fly back up showing that he has booster rockets. (These would later be shown digitally in Episodes II and III.) The scenes featuring the booster rockets were cut due to the practical effects being unworkable. The rocket feature made it onto the action figure however.\nChancellor Valorum confronting Palpatine about the vote of no confidence.\nScenes showcasing Anakin's precognitive powers.\nPromotional footage featured a line by Darth Maul saying \"Fear. Fear attracts the fearful, the strong, the weak, the innocent, the corrupt. Fear. Fear is my ally.\" Portions of this were included in a talking Darth Maul mask made by Hasbro.\nA promotional image showed Darth Maul fighting Obi-Wan on Tatooine.\nTendau Bendon speaking in the Galactic Senate.\nA close-up of Adi Gallia sitting in her council chair.\nA shot of Yaddle speaking, with the other Jedi Council members turned to face her.\nNute Gunray and two other neimoidians escort Darth Maul on Naboo.\nExtended Battle of Naboo, including the lightsaber duel in the Theed power generator. (Many of these can be briefly seen during some of the DVD documentaries and original TV spots for the film.)\nDarth Maul uses the force to throw objects at Obi-Wan.\nA second angle of Darth Maul kicking Obi-wan during their duel on Naboo.\nSome versions of the film initially released had Darth Maul falling in one piece in order to satisfy the ratings board.\nDaultay Dofine's line, \"Impossible! Nothing can get through our shields.\" was originally supposed to happen directly before the ship exploded.\n\n",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 603.0
      }
    },
    {
      "id": "1073",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Incomplete scenes released on Blu-ray[]\n\nTrash Talking Droids — On board the Trade Federation starship, two droids discuss the arrival of the Republic cruiser.\nExtended Podrace Wager — Qui-Gon tries more diligently to expand the wager to include Shmi.\nBattle on the Boarding Ramp — Extended fight with Darth Maul on Tatooine, including Darth Maul jumping onto the ship's platform with Qui-Gon before falling off.\nBail Organa of Alderaan — Bail Organa votes for No Confidence in Chancellor Valorum. (Organa would be recast as Jimmy Smits for Episode II, resulting in the renaming of the character played by Adrian Dunbar to Bail Antilles.)\nThe Battle Is Over — A Naboo soldier shows Padmé via viewscreen that the battle droids have been deactivated.\nAnakin's Return — Anakin flies his Naboo starfighter back into the hangar.\n\n",
        "section": "Incomplete scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 195.0
      }
    },
    {
      "id": "1063",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on Blu-ray[]\n\nHan and Leia: Extended Echo Base Argument — Han and Leia continue their argument beyond \"You could use a good kiss!\"\nDeleted Wampa Scenes (These scenes were removed due to the poor-looking wampa costume effects.)\nAlternate version of Han and Leia's argument in the hallway where a wampa hand is shown breaking through the ice in the wall.\nWhile fleeing Imperial troops, Han suggests they take a shortcut through a room that has a sign on it. Leia tells him \"that's where they keep those creatures\" (the Wampas). They run off and C-3PO tears away the warning sign, hoping the troops will mistake it for another room. Sure enough, they do, and one of the snowtroopers is pulled in by a wampa. The other troopers quickly shut the door and stare in disbelief as Darth Vader walks up to them, seemingly just as confused or silently reprimanding them for stopping. (The part in which C-3PO tears off the warning sign appears in the original trailer.)\nRebel troopers attempt to fend off several wampas that have escaped their containment unit during the Battle of Hoth.\nR2-D2 wanders down a corridor and narrowly escapes a wampa.\nLuke and Leia: Medical Center — After leaving the bacta tank, Luke and Leia almost kiss but are interrupted by C-3PO. Luke tells Leia that he has to go to the Dagobah system. Leia gets angry, explaining that Han was about to leave to pay off unpaid debts for Jabba the Hutt. Leia then says that she would get more loyalty if she went down the hall and recruited some of the wampas.\n\n",
        "section": "Completed scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 356.0
      }
    },
    {
      "id": "1090",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on Blu-ray[]\n\nFinn and the Villager — Following the death of FN-2003 during the attack on Tuanul, FN-2187 spares the life of a villager.\nJakku Message — At the D'Qar's Resistance base, Major Taslin Brance informs General Leia Organa that Tuanul was wiped out and there was no sign of the map. Brance also told her that Poe Dameron and his droid were missing. Organa orders them to find BB-8 instead of contacting the New Republic.\nUnkar's Arm — Unkar Plutt confronts Rey at Takodana Castle and warns her of the trouble she's in. Rey attempts to defend herself but is disarmed by Unkar. Chewbacca steps in to help Rey as Unkar makes fun of him. Angered by Unkar, Chewbacca then steps on Unkar's foot and rips his arm out of its socket which lands on a table in front of Wollivan.\nTunnel Standoff — While escaping Maz's palace, Han Solo, Finn, Chewbacca, and Maz Kanata are cut off by a group of stormtroopers, who wished to arrest them in the name of Supreme Leader Snoke. Solo attempts to talk them out of it, asking \"Do you know a Smoke?\" and \"What makes him Supreme?\" He then asks, \"Is this something [Finn] did? Is this about the stormtrooper boots?\" to which Finn replies \"That's how you knew.\" (This implies that Han realized that Finn was a deserted stormtrooper because of the boots he was wearing.)\nLeia and the Resistance — Leia tells her emissary Korr Sella to warn the New Republic to take action against the First Order.\nX-Wings Prepare for Lightspeed — Resistance base personnel give Dameron and his pilots the all clear after the Falcon lands on Starkiller Base.\nKylo Searches the Falcon — A squad of snowtroopers and Kylo Ren search the Millennium Falcon. Kylo goes up to the cockpit and then realizes that Han Solo is here. Ren then sees Dameron's X-wings moving in to attack when he walks out.\nSnow Speeder Chase — Finn and Rey take a snowspeeder but are pursued by another until Finn shoots the gunner and causes it to crash.\nFinn Will Be Fine — After Rey returns to D'Qar with Finn, Dr. Harter Kalonia assures her that Finn will be fine.\n\n",
        "section": "Completed scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 521.0
      }
    },
    {
      "id": "1085",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Season Three[]\n\n\"Evil Plans\":\nC-3PO Reunited with Shiny R2-D2 — C-3PO is upset when he finds out R2 has had a recent oil bath.\n\"Hunt for Ziro\":\nZiro Loses the Bracelet — A subplot in which Sy Snootles gives Ziro a bracelet commemorating their love, which he immediately loses.\nQuinlan Finding Snooty's Bracelet — Quinlan Vos finds the bracelet from the earlier deleted scene.\n\"Ghosts of Mortis\": Son Confers with Ancient Sith Lords — The Son talks to Sith Lords Darth Revan and Darth Bane. (Incomplete)\n\"Padawan Lost\": (Incomplete scenes)\nAhsoka Strategizing with Younglings\nSochek's The Big Lebowski Homage — Sochek says he can procure a dismembered toe.\nHunters Discuss the Younglings\nBounty Hunters Hunted\nAhsoka Watched By Trandoshan\nRendered Chameleon Trandoshans — The Trandoshan bounty hunters appear invisible as they blend in with their environments.\n\n",
        "section": "Season Three[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 240.0
      }
    },
    {
      "id": "1068",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Incomplete scenes released on Blu-ray[]\n\nTatooine Sandstorm — Right after Jabba's Sail Barge blows up, Luke, Han, Leia, Lando, Chewbacca, and the droids go back to the Millennium Falcon and Luke's X-wing (both of which are in the middle of a sandstorm). Han thanks Luke for saving him and Luke explains to his friends that he has to go back to Dagobah. (No dialogue is clearly audible.)\nJerjerrod's Conflict:\nDarth Vader Force chokes Moff Tiaan Jerjerrod in front of two Royal Guards to get into the Emperor's throne room. (Vader's lines are spoken by Prowse inside the costume.) A second shot of this scene from an alternate angle exists.\nPalpatine orders for Jerjerrod to fire the Death Star's superlaser at Endor in the event that the rebels manage to capture or otherwise deactivate the shield generator. Afterwards, upon learning of the shield's deactivation, Jerjerrod reluctantly carries out his command and gives orders to scramble fighters and open power discharge gates to flood certain sectors of the superstructure in order to prevent Red and Gold Squadrons from accessing the reactor core. These scenes were cut due to timing constraints.\nBattle of Endor: The Lost Rebels:\nB-roll footage of Rebel pilots being fed lines, with three never appearing in the film. These include a Human female pilot, a Sullustan, and a Mon Calamari pilot. The Mon Calamari eventually received an action figure, and was later made canon as Ika Sulko. Another female pilot made it into the film, but was dubbed over with a male's voice. That pilot was nonetheless later revealed to be a female named Sila Kott.\nGeneral Crix Madine sitting in the Admiral's chair aboard Home One during the final battle. These scenes were filmed in case the Admiral Ackbar puppet effects did not work properly. Actor Dermot Crowley claims to have spent a few extra days filming in a moving chair shouting things such as \"Fire!\"\nThere are cut shots of Rebel troopers rushing around aboard the Millennium Falcon making repairs, including humans and a Sullustan. Among them are Airen Cracken and Blount, who are then seen manning the Falcon's laser cannons. The Sullustan was portrayed by Richard Bonehill, who also played Nien Nunb.\n\n",
        "section": "Incomplete scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 500.0
      }
    },
    {
      "id": "1086",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Season Four[]\n\n\"Water War\": The Crowning of Prince Lee-Char (Incomplete)\n\"Prisoners\": Kit Fisto at One with the Force (Incomplete)\n\"Shadow Warrior\": Padmé Talking to Grievous — Gungans surround Grievous on Naboo and trap him with energy binds. (Incomplete)\n\"Mercy Mission\": R2-D2 and C-3PO on Aleen — Extended scene (Incomplete)\n\"Nomad Droids\": (Incomplete scenes)\nC-3PO Explains Democracy — Extended scene (Incomplete)\nMayhem On The Pirate Ship (Incomplete)\n\n\"The General\": Umbaran Banshee Attack (Incomplete)\n\"Slaves of the Republic\": Attack on the Queen (Incomplete)\n\"Escape from Kadavo\":\nThe Queen and Dooku\nBringing The Togrutans Home — Alternate scene (Incomplete)\n\"A Friend in Need\": Ahsoka Fighting Pre Vizsla — Extended scene (Incomplete)\n\"Friends and Enemies\": The Fugitives Have Escaped (Incomplete)\n\"The Box\": (Incomplete scenes)\nCad Bane's Hat — Extended scene\nAnakin's Frustration\n\"Crisis on Naboo\": (Incomplete scenes)\nCapturing Moralo Eval — Alternate scene\nObi-Wan Was Set Up\n\"Massacre\": (Incomplete scenes)\nVentress Battles Grievous — Extended scene\nZombie Attack — Extended scene\nBombing The Lair — Extended scene\n\"Brothers\": Savage In The Diner — Savage Opress gets angry with a waitress as he looks at a map of the galaxy.\n\"Revenge\": (Incomplete scenes)\nMaul's Reunion With Obi-Wan — Alternate scene where Savage comes out with a captive civilian to make Obi-Wan give up his lightsaber, after which Savage activates his lightsaber right through the civilian's head regardless, thus leading to a defenseless Kenobi getting knocked out by Maul.\nVentress And Obi-Wan Vs Maul And Savage Deleted Exchange — Alternate scene\nObi-Wan Agrees To Not Turn Ventress In\n\n",
        "section": "Season Four[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 432.0
      }
    },
    {
      "id": "1088",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Season Seven[]\n\n\"A Distant Echo\": The scene where Anakin objects to risqué nose art of Padmè on the Marauder was removed in the final version and replaced with a scene where Anakin contacts her via hologram.\n\"On the Wings of Keeradaks\": Wat Tambor uses the organic decimator on a Poletec captive.\n\"Unfinished Business\": The scene where the Bad Batch, Echo and Rex are commemorated for their service in saving Anaxes and given medals and cheers was removed in the final version and replaced with a scene of the Bad Batch leaving, Rex encouraging Echo to join them if he feels more at home and thus Echo being accepted as part of their Squad.\n\"Old Friends Not Forgotten\": As seen in the trailer, Anakin and Obi-Wan were originally supposed to be called up to the Venator by Rex, rather than Yularen. Additionally, in the final cut, Anakin's dialogue delivery is slightly different and a blue glow from the hologram they are standing in front of was added.\n\n",
        "section": "Season Seven[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 223.0
      }
    },
    {
      "id": "1082",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Other cut scenes[]\n\nThe Coruscant space battle and opening was going to be longer.\nAnakin and Obi-Wan encounter a pair of Magnaguards on their way to rescue Palpatine.[source?]\nExtended duel with Count Dooku.\nAfter Obi-Wan remarks \"You won't get away this time, Dooku,\" Dooku responds by igniting his lightsaber and saying, \"Just because there are two of you, do not assume you have the advantage.\" The short scene with this line is in the Episode III video game.\nAnakin punching and briefly driving his lightsaber into Dooku's face.[source?]\nAn alternate shot of Palpatine grimacing as Anakin frees his arms.\nAnakin carrying Obi-Wan on his back and pressing a button to call a turbolift.\nAnakin, Obi-wan, and Palpatine unsuccessfully attempt to find a ship to escape with in the Invisible Hand's hangar bay, as the artificial gravity shifts again. (The artificial gravity changing for a second time was included in LEGO Star Wars: The Videogame.)\nPalpatine's \"reception committee\" (consisting of Mas Amedda and four Red Guards) on Coruscant after being saved by Anakin.\nAn extended conversation between Anakin and Obi-Wan when the latter asks the former to spy on Chancellor Palpatine.\nObi-Wan visits with Padmé to discuss his concerns for Anakin. The scene was not completed as Anthony Daniels had fallen over while filming.\nExtended conversation between Padmé and Anakin.\nWhen Obi-Wan departs for Utapau, Anakin calls out \"Master\" instead of \"Obi-Wan\".[source?]\nWookiee ambush.[source?]\nAnakin talks with Palpatine about Obi-Wan's mission to Utapau.[source?]\nPalpatine thanking Jar Jar for helping put him in power.\nExtended fight with Grievous.\nAn alternate fight sequence that includes many major changes from the final cut.\nWhen Grievous escapes on his wheel bike and Obi-Wan whistles for Boga, the Varactyl destroys a crab droid with his tail before jumping down, after which Obi-Wan destroys several Super Battle Droids before mounting the creature.\nAn extended chase, in which Grievous and Kenobi travel down a highway and hit oncoming vehicles, fly past active battlefronts, and continue through a train tunnel, which forces Grievous to at one point drive through an entire moving train, crashing into passengers.\nGrievous using his bike to spin rocks and body parts of dead clones at Obi-Wan and Boga, and later, spin a giant wind turbine to block Obi-Wan from reaching him.\nObi-Wan hanging onto a cord trailing from the wheel bike and being dragged along with it, before managing to get it caught on a rock, which breaks the wheel bike apart and sends its pieces flying into the Soulless One.\nGrievous landing several successful punches on Obi-Wan's face.\nObi-Wan tearing out the General's insides, including his heart, which he proceeds to shoot, killing Grievous, after which he kicks the body off of the landing platform.\nObi-Wan enters an Utapau Dragon Pen and selects Boga from several other Varactyls (This scene appears in the novel), and his ride to Grievous' hangar is extended.[source?]\nGrievous was originally going to try to escape in his shuttle, but Obi-Wan and Boga destroy it (This scene appears in the novel).\nAnakin and Padme have dialogue when looking out their windows.\nThe fight between Palpatine and Windu underwent many changes during production.\nPalpatine's aide Dar Wac and a pair of Senate Guards try to stop Windu and the Jedi, but are pushed with the Force out of the way before entering the Chancellor's office.\nPalpatine was originally meant to be played by a stunt double, however, George Lucas insisted that Ian McDiarmid continue to play him in order to not need to CGI his face. As McDiarmid was an older man and not as dexterous as the stunt double, the fight was slower overall.[source?]\nAnakin originally stood next to Palpatine when confronted by the Jedi. Additionally, in bonus footage on the DVD, Anakin can be seen following closely behind Windu and Palpatine as they duel down the hallway, watching them.\nAnother version of the duel consisted of Windu arriving alone, with Kit Fisto and Saesee Tiin instead dying during Order 66, and Windu dropping dead when being hit with Force lightning, rather than being launched out of the window.\nAn second angle exists of Palpatine landing in front of the Jedi Masters after jumping over his desk.\nAn alternate duel between Windu and Palpatine was shot, and for reasons unknown never released to the media, which shows Palpatine dueling using Anakin's lightsaber. A few seconds of the alternate takes were used in the final film as the hilt can be seen for the briefest moment at least once, though the blade was edited to be red. The scene is considered to be a piece of lost media, though it briefly appeared in the Revenge of The Sith deleted scene commentary through an amateur camera shot of the scene being filmed as Lucas explains it.\nWindu attempting to defend himself with his remaining hand.\nExtended Order 66 and Temple Purge.\nA completely alternate sequence features the deaths of Barriss Offee, who, while fighting on Felucia, is shot by an All Terrain Tactical Enforcer from behind, which proceeds to step on her body; Luminara Unduli, who is quickly surrounded by her troops and gunned down; and Quinlan Vos, who is riding in a convoy of HAVw A6 Juggernauts when the one in front of him suddenly stops and opens fire on his. Other differences from the final sequence include the Separatist attack on Kachirho beginning after Palpatine executes Order 66, with wookiees jumping inside the oncoming tank droids and killing their droid drivers; Ki-Adi Mundi being killed on Kamino instead of Mygeeto; Aayla Secura and Bly having dialogue; Plo Koon and his clone wingmen speaking prior to them shooting at Koon, who ejects from his starfighter but gets shot in mid air; Stass Allie noticing the clones riding with her pull back, before being fired upon; and Gree attempting to kill Yoda being replaced with Yoda witnessing Unduli's death, which is what causes him to drop his cane. Additionally, various shots of Yoda sensing the Jedi dying, along with Palaptine also sensing them, but smiling, are interlaced between the various Jedi deaths.\nUnduli and Offee's deaths were made official in the Legends comics Republic 82 and Star Wars: Episode III — Revenge of the Sith 3 respectively. The latter also includes the dialogue between Secura and Bly. In Canon, Offee's fate is still unknown, while Unduli was captured and executed later, rather than being killed immediately, as revealed by Dave Filoni in an interview with IGN.\nVos' inclusion was due to the character catching George Lucas' eye in a comic. Though his appearance was ultimately cut from the movie, Lucas went on to allow Vos to survive when his fate in Legends was left up to Lucas' decision. Vos is confirmed to have also survived, in Canon, in the Obi-Wan Kenobi television series.\nAnakin enters a chamber in which Shaak Ti is meditating, only to stab her in the back with a shiak strike. Leaving the chamber, he proceeds to calmly walk through the carnage taking place in the Temple.\nTi's death was later shown in a vision to Yoda in Episode 12 of Star Wars: The Clone Wars Season 6, Destiny, confirming this to be her Canon death. In Legends, however, she managed to escape and run from the Empire for many years, only to be killed by Galen Marek on Felucia in The Force Unleashed.\nExtended footage for the deaths of Whie Malreaux, Bene, and Cin Drallig, featuring more shots of Anakin dueling with the latter.\nAfter being shot down by his troops, Obi-Wan evades a Nos monster in the depths of Utapau. The Nos Monster attacks several Republic seeker droids, while Obi-Wan sneaks past some baby Nos Monsters. (\"The Nos Monster\") This scene appears in the novelization only.\nExtended footage of a pair of clones on AT-RTs examining a crashed Wookiee fighter. Yoda emerges from the wreckage as a silly creature and the two dead wookiees, revealed to be Chewbacca and Tarfful ambush the clones. Yoda was also supposed to ride on a \"Can-Cell\" to his escape pod.\nBail Organa hands his identification to a Red Guard before boarding his cruiser.[source?]\nAfter the Jedi Temple massacre, there would be a small scene of Padme with Ellê, Moteê, and C-3PO, just before Anakin meets her.[source?]\nObi-Wan, Yoda, Bail, and his deputy enter the Senate. The senate guard asks them for permits, but says it is a Jedi detention order. Kenobi tricks him with the Force and says he can stay with the senator, however, later Obi-Wan and Yoda go to the Temple (This scene appears in the novelization).\nPalpatine's speech would have been longer.[source?]\nBail tries to object to the Emperor's speech but Padme stops him and assures him that there will be a time (This scene appears in the novelization).[source?]\nExtended Obi-Wan's visit with Padmé after learning of Anakin's fall to the Dark Side (This scene appears in the novelization).\nMore scenes with Captain Typho.\nExtended Separatist Slaughter, including the Separatist Council entering the war room, Nute Gunray ducking under the conference room table, and the Neimoidian Guards along with Wat Tambor being killed by Anakin Skywalker.\nAdditionally, Rune Haako was supposed to be killed in the conference room, as seen by his body during the duel between Skywalker and Kenobi.\nAn alternate duel between Yoda and Palpatine, which was set to occur immediately after the the latter and Anakin's hologram call. During the fight, Cam droids start recording and broadcast it to large holoscreens in the ceiling of the Senate Chamber. Additionally, Palpatine uses Force lightning to blow open the roof and escape on a Senate pod, right before arriving clone troopers shoot at Yoda.\nVader levitating Padmé in the air while choking her.\nR2-D2 and C-3PO help Padme onto her ship.\nAn extended duel between Obi-Wan and Anakin.\nAn alternate sequence with many differences from the final cut.\nAnakin wields a red lightsaber.\nExtended fighting on the piece of machinery floating down the lava river, which Anakin and Obi-Wan, at the end, jump off of at the same time.\nA \"cat and mouse\" chase using the two platforms they land on, which are shown to be pilotable by leaning in a certain direction.\nAnakin's maiming being a result of him jumping on Obi-Wan's platform, dueling, and going in for an overhead strike. Obi-Wan notices his legs are undefended and quickly slices them off, causing him to fall to the bank of the lava river below.\nAt one point, the pair were to fight along the edge of a cliff.\nObi-Wan using Anakin's lightsaber, along with his own.\nThe duo team up and fight a being known as the Mustafar Monster, which can be seen in concept art.\nThe two throw lava at each other with the Force.\nWhile lying on the bank of the lava river, Anakin was supposed to ask Kenobi for help, to which the latter declines, resulting in the former's eyes turning from blue to yellow.\nThe Naboo star skiff shown flying off from Mustafar to Polis Massa. This scene was featured in the teaser trailer.\nAdditional footage of Emperor Palpatine's shuttle leaving Mustafar and arriving on Coruscant, along with two V-wings.\nPadmé's scene of giving birth to twins would have been longer.\nDialogue between Palpatine and a surgical droid.\nDarth Vader initially had his arms raised up while on the table, however they were digitally lowered to where they are in the final film.\nVader causes a whirlwind of destruction that causes droids to break and fires to ignite.\nAn alternate version of Obi-Wan delivering Luke to the Lars Homestead, that was shot during the production of Attack of the Clones.",
        "section": "Other cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 2714.0
      }
    },
    {
      "id": "1065",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Incomplete scenes released on Blu-ray[]\n\nLuke's Recovery — Luke in the bacta tank, with director Irvin Kershner providing the voice for 2-1B.\nThe Fate of General Veers — A snowspeeder crashes into an AT-AT Walker commanded by General Veers. (The character later appears in Expanded Universe stories, though the accident which could have resulted in his death is discussed as though the scene had taken place.)\nYoda's Test — Yoda trains Luke, who uses his lightsaber to cut up 4 metal bars that Yoda would have been levitating (no audio). This scene was included in the original novelization however.\nHiding in the Asteroid — Han works on the Falcon while the asteroid belt is bombarded by the Empire.\nAlternate Han and Leia Kiss — A version of the kiss on the Falcon in which Leia brings Han in for another kiss before they're interrupted by Threepio (\"Okay, hotshot\").\nLobot's Capture — Lobot is captured by stormtroopers to be killed.\nLeia Tends to Luke — Leia tells Luke about Han's capture by Boba Fett.\n\n",
        "section": "Incomplete scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 245.0
      }
    },
    {
      "id": "1094",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on Blu-ray[]\n\nAlternate Opening — An alternate opening sequence for the film. After Finn awakens from his coma and realizes that he is aboard a ship, Lieutenant Kaydel Ko Connix tells Poe that they need more time as Resistance members flee in their transports, leading to the battle during the Evacuation of D'Qar against the First Order Dreadnoughts.\nPaige's Gun Jams — A scene during the battle over D'Qar where Paige's gun jams while she is in the Cobalt Hammer.\nLuke Has a Moment — Following the scene in which Luke Skywalker asks Rey and Chewbacca what happened to Han Solo, he returns to his hut and grieves the death of his brother-in-law while Leia does the same aboard the Raddus.\nPoe: Not Much of a Sewer — A conversation between Poe Dameron and Finn aboard the Raddus in which Dameron would have revealed he stitched up Finn's jacket following the Battle of Starkiller Base, sewing up in the process the gaping hole that was left by Kylo Ren's lightsaber.\nIt's Kind of Weird That You Recorded That — After recovering from his injuries in the bacta tank, Finn sees Rey's goodbye to him following the destruction of Starkiller Base recorded by BB-8.\nThe Caretaker Sizes Up Rey — The Caretakers meeting with Rey at Ahch-To and starting to take displeasure from her antics as she followed Luke for her first lesson.\nCaretaker Village Sequence — Rey's third lesson: After Rey spots boats sailing towards the Caretaker village, Luke notes that they are raiders who are arriving to ransack the village, causing Rey to go to the village only to have Luke saying that if Rey attempts to retaliate, the raiders, with more reinforcements, will return to attack again, because a Jedi would let this to play out without getting involved. Rey charges into the village anyway and sees a cheerful Lanai reunion instead.\nExtended Fathier Chase — An extended version of Finn's and Rose's escape from the racetrack with the fathiers. After escaping from the Canto Casino, the fathiers would have crashed against several other locations, including Zord's Spa and Bathhouse.\nMega Destroyer Incursion – Extended Version — After Finn, Rose, BB-8, and DJ infiltrate the Supremacy, once they enter an elevator, Finn meets 926, a fellow stormtrooper who knew him from his days serving the First Order. Unaware of Finn's defection from the Order, 926 congratulates him for his \"ascension\" and gives Finn a friendly swat on the posterior. Elsewhere in the destroyer, Kylo Ren awaits Rey's arrival.\nRose Bites the Hand That Taunts Her — After DJ's betrayal, when General Hux starts to taunt Rose and Finn for their failures, Rose bites Hux's hand, shaking him up until he gives the execution order and walks away.\nPhasma Squealed Like a Whoop Hog — An alternate fight sequence for Finn and Captain Phasma. Cornering Finn with the help of her fellow stormtroopers at a moving platform after Finn breaks the eye part of her helmet, Phasma prepares to finish off Finn, only to have him reveal her betrayal at Starkiller Base when she disabled the shields to save her own life. As she notes that the stormtroopers are uncomfortable with Finn's revelation, Phasma shoots them before they can do anything, but before she can shoot Finn, he cuts her hand off, prompting her to knock Finn aside with her baton. Just when she prepares to give Finn a final blow saying that he was always \"scum,\" Finn responds, \"Rebel scum\" and shoots her with one of the dead stormtroopers' weapons.\nRose & Finn Go To Where They Belong — Finn and Rose aboard a shuttle, and when Rose asks Finn where they are going, Finn answers that they are going to go to Crait to help the Resistance, which is where they belong.\nRey & Chewie in the Falcon — During the Battle of Crait, Rey and Chewbacca fly the Millennium Falcon and see the First Order attacking a concentrated point on the ground where Luke is standing. It is unknown whether they knew that Luke wasn't physically there.\nThe Costumes and Creatures of Canto Bight — Though necessarily not a deleted scene, this sequence is a compilation of unused footage from the scenes at Canto Bight, which showcases the creature designs and the impressive sets that went into making the location from the final cut of the film.\n\n",
        "section": "Completed scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 954.0
      }
    },
    {
      "id": "1098",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Cut scenes[]\n\nPalpatine's broadcast. This was shown in the video game Fortnite.\nHux and Pryde on Mustafar.\nKylo Ren battling Alazmec warriors at Fortress Vader and meeting the Eye of Webbish Bog on Mustafar.\nExtended hyperspace skipping.\nExtended repairs of Kylo Ren's mask.\nA scene further explaining Palpatine's return.\nExtended scenes of Rose Tico.\nA scene featuring Kylo Ren paying respect to Vader's mask.\nExtended Knights of Ren search on Pasaana.\nExtended search for Rey on Pasaana.\nExtended activity on Kijimi.\nPryde wielding his swagger stick.\nMore scenes on Kef Bir.\nA torture scene between Kylo Ren and Chewbacca that was considered too dark to be in the final movie.\nA shot of Rey wearing dark robes sitting on Palpatine's throne.\nLeia holding Han's medal on her deathbed.\nLeia and Luke's duel extended.\nLando and Chewie leaving for Exegol.\nA scene with Boolio imprisoned aboard the Steadfast.\nA rumored scene involving Anakin Skywalker's force ghost (played by Hayden Christensen).\nExtended shot of the Citizens' fleet arriving at Exegol.\nAll of the force ghosts appear during Rey and Palpatine's final clash.[source?]\n\n",
        "section": "Cut scenes[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 278.0
      }
    },
    {
      "id": "3930",
      "title": "Torture",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Society and culture"
        ],
        "content": "# Torture - Cloud City torture[]\n\nFor Star Wars: Episode V The Empire Strikes Back, director Irvin Kershner originally filmed more shots of Han Solo being tortured, which showed the machine in operation with spikes and needles and electronic things going, and flashes of electricity everywhere. It was cut because the filmmakers were afraid that this would be too intense for children. Some of Han's screaming off-screen was also taken out for the same reason. According to the director, everyone felt that the cut material was too much for a film of this type. However, a brief flashback panel in the comic issue Darth Vader (2020) 12 shows the scan grid equipped with several long sharp needles.\n\nIn the movie, Luke Skywalker has a vision of Han and Leia \"in pain\". Later, it is revealed that Darth Vader had Luke's friends tortured because he knew that their anguish would reach Luke through the Force and draw him to Bespin where he could be captured. The movie shows Chewbacca in a cell, being subjected to ear-piercing noise; the Legends novelization states that the Wookiee was subjected to sonic torture and searing lights. The movie also shows Han Solo being tortured via electricity on the scan grid, but what happened to Leia is never revealed; the princess is merely shown being pushed into the cell later and asking Han, \"Why are they doing this?\". The Legends novel Heir to the Empire states that both Han and Leia were tortured, and the Legends novel Dark Tide I: Onslaught briefly mentions that Han and Leia both went through an ordeal with a torture machine on Bespin, but does not provide any further explanation.\n\nThe canon junior novel The Empire Strikes Back: So You Want to Be a Jedi? sheds a little more light on the subject and describes what Luke sees in his vision as \"They are being tortured. Leia is screaming, her eyes bulging from her head. Han is straining, his back arched, his neck on the verge of snapping.\" Later, Luke thinks of what he saw, as \"Before your eyes are your best friends. Screaming in pain. Writhing under needles and blades, barking with fear and whimpering in horror.\"\n\n",
        "section": "Cloud City torture[]",
        "source": "https://starwars.fandom.com/wiki/Torture",
        "title": "Torture",
        "tokens": 446.0
      }
    },
    {
      "id": "6175",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Misadventures with Lord Vader[]\n\nAs everyone gathers, three different versions of Obi-Wan Kenobi each greet each other. A legless Darth Maul clears his throat. Other people include both an older and younger Han Solo, Greedo, and numerous clone troopers, stormtroopers, First Order jet troopers and Sith troopers, among other combatants of the struggle between light and dark throughout galactic history. The two Solos agree to shoot Greedo first, and a battle commences between the forces of light and dark.\n\nRey and Lord Vader continue their fight. Lord Vader remarks that someone has trained her well. Rey remarks that he has no idea who. Just then, Luke Skywalker asks who are they. Rey recognizes him as a younger Master Skywalker while Darth Vader recognizes his son but pretends to be referring to the twin suns of Tatooine. Luke notices the green crystal key and asks what it is. When Rey and Vader charge after him, he tells them it is a private farm. The two tackle Skywalker and the three of them get sucked through a portal.",
        "section": "Misadventures with Lord Vader[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 231.0
      }
    },
    {
      "id": "6163",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Adventures in time[]\n\nAs she holds the artifact and ponders about what it unlocks, the door begins revolving, opening a portal through space. When Rey puts down the crystal, the door closes. Rey turns the crystal, reopening the portal into a Force gateway. Rey is sucked into the Force gateway and lands in the swamps of Dagobah. There she witnesses a younger Luke Skywalker training under Yoda's tutelage while R2-D2 watches.\n\nAs part of the training, Luke has to stand upside down while he levitates Yoda and several tools. Yoda tells Luke to concentrate. Rey realizes that they have traveled back in time to when Luke was training on Dagobah under Yoda's tutelage. Rey is excited that she might learn some profound Jedi wisdom. Luke grumbles that the blood is starting to rush to his head but Yoda tells him to concentrate. Just then R2-D2 starts beeping and Luke loses his concentration.\n\nRey believes she can learn something from this. Luke tries to use the Force to lift his X-wing starfighter out of the swamps of Dagobah. Yoda tells him that there is no try. When Luke suggests that trying is a good thing, Yoda responds that participation trophies are not for Jedi. Luke tries to lift his X-wing out of the swamp but fails. Just then, BB-8 is grabbed by a swamp slug. As she struggles, Rey touches the crystal which opens the portal.\n\nThe portal takes them back to the Kordoku temple. Rey realizes that the crystal is a key to the galaxy's past that helps makes a Jedi's future clearer. Rey thinks she can train Finn by travelling back in time to watch other Jedi Masters train their students. Rey convinces a reluctant BB-8 to follow her aboard the Trade Federation battleship Saak'ak where Master Qui-Gon Jinn and his Padawan Obi-Wan Kenobi are waiting to meet the Trade Federation for negotiations during the Naboo trade dispute. Kenobi is bored but Master Jinn tells him that Jedi do not seek adventures. Just then, the Trade Federation floods the meeting room with gas. Kenobi yearns for adventure and the two ignite their lightsabers.\n\nRey and BB-8 then travel in time to Coruscant following the assassination attempt on Senator Padmé Amidala. The two end up above the turbolift carrying an older Master Kenobi and his Padawan Anakin Skywalker. Kenobi senses that Anakin is eager to see Padmé but he reminds him that they are on a mission. Kenobi tells Skywalker that he must be completely aware of his surroundings. Rey is excited to see the older Jedi. BB-8 tries to warn her not to let them see her but the two are noticed by Kenobi and Skywalker, who ignite their lightsabers. Rey says hi before turning the crystal and opening the portal.\n\nLater, Rebel Alliance X-wings launch their attack on the Death Star during the Battle of Yavin. As Luke and R2-D2 fly their starfighter through the Death Star trench, Rey and BB-8 land in the cockpit, interrupting Luke as he is trying to aim his starfighter's cannon at the reactor shaft. Skywalker hears the Force spirit of Kenobi telling him to use the Force. Luke pushes Rey out of the way as he tries to find his targeting computer. Just then, Darth Vader strikes R2-D2 with a laser blast from his TIE Advanced x1.\n\nKenobi implores Luke to use the Force. Rey tells Skywalker to listen to his master. Meanwhile Han Solo shoots Vader's escort TIE fighters and damages Vader's TIE Advanced, causing it to spin out of control. Solo tells Skywalker to blow up the Death Star and go home. After firing a missile down the reactor shaft, Skywalker jets his starfighter out of the Death Star. The Death Star explodes. Before Skywalker can thank Rey, she travels back in time. Solo hears that over the intercom and tells Skywalker he is welcome, believing that Skywalker was referring to him. Returning to the present, Rey tells BB-8 that they helped Skywalker blow up the Death Star. Rey is excited and says this is their best Life Day ever.\n\n",
        "section": "Adventures in time[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 869.0
      }
    },
    {
      "id": "6161",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Journey to Kordoku[]\n\nOutside, Rey prepares to depart on her T-65 X-wing starfighter. Finn pleads with her not to leave, saying that he knows he can become a Jedi. Rey says she has to go for his sake. Rey travels to the planet Kordoku with BB-8 but has trouble finding the temple amidst the colored clouds. Rey finds that the X-wing is flying towards a mountain and tells BB-8 to pull up, narrowly escaping a collision. She finds that the temple is within a mountain with three peaks. The snow-capped mountain is surrounded by snow and a snowy forest.\n\nRey lands her X-wing and approaches the entrance to the temple, a narrow way through rock-face. Above, the aurora borealis glows over the mountain temple. Rey is impressed by the architecture. BB-8 follows but is covered by snow. Rey brushes aside snow covering a circular doorway and uses the Force to summon a blue-green crystal key, which she believes to be the key to the galaxy's past but wonders what it opens.\n\n",
        "section": "Journey to Kordoku[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 225.0
      }
    },
    {
      "id": "6147",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Official description[]\n\nThe LEGO Star Wars Holiday Special, chronologically placed after the events of Star Wars: Episode IX The Rise of Skywalker, which took place in 35 ABY, follows the Jedi Rey as she journeys with BB-8 to gain a deeper knowledge of the Force, leaving their friends aboard the Millennium Falcon to prepare for the Wookiee festival of Life Day. However, Rey's course deviates from traveling to the Wookiee homeworld of Kashyyyk as she is hurled by a key into an adventure across space and time at a Jedi temple, meeting various figures of galactic history. However, she must return home in time for Life Day.\n\n",
        "section": "Official description[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 144.0
      }
    },
    {
      "id": "6182",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Saving the party[]\n\nMeanwhile, Chewbacca's hungry and bored family wait aboard the Millennium Falcon. Chewbacca chides his grey-furred relative for swallowing a porg. Poe notices Finn and Rose are smiling and asks why they are enjoying the biggest disaster since Jar Jar Binks' Galactic Senate speech. Rose points out that she has invited Max Rebo to set up a drum. Poe asks why they invited Max since nobody has listened to him in thirty years. Poe asks where is the rest of the band and thinks this won't work.\n\nAt that point, they are interrupted by Lando Calrissian, who praises Poe and his team's effort. He is accompanied by Jannah and Maz Kanata, who is delighted to see her boyfriend Chewbacca. Poe asks what is going on. Rose says that Life Day is about being with friends and family. Finn adds the more the merrier. They are joined by several Jawa, Rodian, and an Ewok. When Poe asks if they had a plan to feed them, Rose gestures towards Zorii Bliss, who has brought several pieces of tip-yip.\n\nA Mon Calamari gifts Lando Calrissian a present, which turns out to be a blue cape. While Max Rebo plays his drums, Finn and Rose sing a festive song in Huttese, which cheers up everyone but Poe. Rose senses Poe's despondency and asks what is wrong. Poe replies joy.\n\n",
        "section": "Saving the party[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 308.0
      }
    },
    {
      "id": "6193",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Rey's lesson[]\n\nBack at the Kordoku, Rey regrets her recklessness. Yoda speaks to her and materializes in spectral form. Rey tells Yoda that she failed to teach Finn and to stop Darth Vader and find a way out of here. Yoda responds that all teachers fail and says that he erred in teaching Luke on Dagobah. Rey says that is different but Yoda reassures her that she can learn from failure to be a better student or better teacher. Yoda tells her that he will show her what she failed to see before showing her a Force vision of her friends celebrating Life Day aboard the Millennium Falcon.\n\nAs Rey watches, a Christmas tree topples but Finn uses his wooden blade to stop it from crashing to the ground. When Rose asks where he learned that, Finn replies that Rey taught him to be mindful of his surroundings. Yoda reassures her that Finn is wise. Rey disagrees and says that she has studied and memorized the Jedi texts. Rey realizes that by focusing too much on the books, she hurt Finn's feelings and forgot about him. Yoda says a Jedi needs knowledge and training but that these are useless without connection. Yoda shows Rey visions of various Jedi masters with their students including Qui-Gon Jinn, Obi-Wan Kenobi, Anakin, Yoda, and Luke. Rey realizes that these masters and students shared a friendship.\n\nYoda asks if Rey understands. Rey says yes and he wishes her a happy Life Day. Before Yoda leaves, Rey asks him what she should do about Vader and the Emperor. Yoda replies that showed her all she needed to know and tells her that she had the power all along before disappearing.\n\nLuke asks if she managed to find the key but Rey says no. Luke asks if that was what Yoda meant when he said that she had all the power all along. Rey realizes that Luke saw the vision and thanks him for teaching her something. Rey meditates and uses the Force to light up the other crystals in the cave. Holding Luke's hand, she commands the crystals to circle around them. Together with Luke and BB-8, they enter a portal created by the many crystals.\n\n",
        "section": "Rey's lesson[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 453.0
      }
    },
    {
      "id": "6173",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Misadventures with Lord Vader[]\n\nBack on Kordoku, Vader uses the Force to snatch the green crystal key out of Rey's hands. While the Sith Lord tries to figure out what the device is, Rey charges at him with her lightsaber. Vader uses the Force to bring down rocks, separating them. Rey however uses her Force powers to cast the rocks aside. She hurls the rocks at him but Vader deflects them with the Force and his lightsaber. He asks if she is a Jedi and Rey confirms this is so.\n\nThe two fight over the green crystal key, causing the key to open a portal sucking them inside. BB-8 is left behind. Rey and Lord Vader emerge at Echo Base during the Battle of Hoth. As the two parry, Lord Vader is impressed by Rey and says that almost feels bad about having to destroy her. Before he can finish her, the command center is struck by a laser cannon. The past Lord Vader walks into the base with a contingent of Cold weather assault stormtrooper.\n\nThe past Lord Vader and his troops encounter the future Lord Vader. One of the snow troopers is confused, causing the past Lord Vader to Force choke him. The past Lord Vader orders the troops to seize the base but the future Lord Vader tells them to seize the girl. The past Lord Vader exerts his authority, prompting a lightsaber duel between the two Vaders. The two Lord Vaders size up their Force powers before realizing they are the same person. Both Vaders order their snowtroopers to destroy Rey. She manages to activate the portal and escape. The future Lord Vader and two snowtroopers follow. The past Lord Vader orders his troops to continue with their mission to seize the rebel base.\n\nOn Mustafar, Obi-Wan Kenobi and the fallen Anakin Skywalker, who becomes Darth Vader, are dueling on platforms above the lava lake. The two snowtroopers land on a floating platform while Rey and the future Darth Vader land on separate ones and parry. One of the snowtroopers passes the green kyber crystal, which Rey dropped, to Lord Vader but Rey snatches it in mid-air with the Force. Rey, the future Vader, the snow troopers, Kenobi, and Anakin slide down the time portal as the lava flows down a valley.\n\nOn Nevarro, Din Djarin and Grogu shelter behind a wall as Moff Gideon's stormtroopers and Death troopers converge on them. Rey, the future Darth Vader, Kenobi, Anakin, and the two snow troopers fall through a portal. Spotting Grogu, Rey and Vader say he is so cute. They open a portal in the ground, taking some stormtroopers and Death troopers with them.\n\nOn Tatooine, nine-year old Anakin Skywalker races against Sebulba in podracers during the Boonta Eve Classic. Just then, the portal opens and a snowtrooper and two stormtroopers land on Sebulba's Podracer. Rey and Darth Vader land on opposite sides of the engines of Anakin's podracer. One of the snowtroopers lands in the desert while the older Anakin and Kenobi land beside the younger Anakin. Fodesinbeed Annodue says that whichever end of the universe they came from, the fall must hurt. The crystal is caught between the force field generated by Sebulba's engines, causing it to suck everyone but the stranded snowtrooper into the time portal.\n\nOn Saleucami, two clone troopers on BARC speeders complain about traffic duty and quip about thinking like the same person. Just then, the portal opens and Anakin and Sebula's podracers race past. The two clone troopers realize they don't see podracers everyday, voicing their excitement over the racers' sudden appearance in unison. They race after the podracers, sirens blaring. As Rey and Lord Vader fight, the clones catch up with them and tell them to pull over. The motion generated by Sebulba's podracer engines triggers the crystal key, which sucks everyone onto the planet Exegol.\n\nRey attempts to summon the crystal but it generates a portal on the hull of an Xyston-class Star Destroyer, sucking everyone include a group of First Order stormtroopers in with them. While falling through the portal, Rey and Lord Vader continue their duel, rapidly entering and exiting a large number of portals, gathering more and more people with them. On Tatooine, an adolescent Luke Skywalker watches the twin suns of Tatooine setting over the Lars homestead while drinking blue milk. The portal opens, dumping everyone on the desert.",
        "section": "Misadventures with Lord Vader[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 973.0
      }
    },
    {
      "id": "6166",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Stepping into peril[]\n\nMeanwhile, on Kordoku, Rey is excited by her adventures of encountering previous Jedi Masters. BB-8 wants to go home but Rey insists on seeing one more master and apprentice for Finn. Yoda warns that even though she did not know it, her quest was fraught with peril. Aboard the second Death Star, Emperor Palpatine gloats over his trap for the Alliance Fleet above Endor. He tells Darth Vader that the rebels will discover too late that the second Death Star is fully operational and boasts of their impending destruction. Palpatine wants to rule the galaxy for eternity.\n\nVader disagrees and opines that \"Death Star Two\" feels derivative. He suggests Starkiller Base but the Emperor disagrees. Just as Rey and BB-8 enter through the time portal, Vader reminds the Emperor that today is Life Day. He gives the Emperor a mug saying \"Galaxy's Best Emperor\" as a gift. The Emperor is dismissive of the gift and hurls the mug aside, causing it to bounce off BB-8. Rey says this is not what she had in mind. She and BB-8 activate the portal and leave the second Death Star. However, the Emperor and Vader see the portal.\n\nThe Emperor hurls the mug through the portal, prompting Vader to complain that he had to search hard for it on Batuu. However, the Emperor is more interested in the source of the portal and sends Lord Vader through the portal to investigate. Before Rey and BB-8 can go home, they are followed by Darth Vader who ignites his lightsaber.\n\nMeanwhile, Poe and the others have finished decorating the Millennium Falcon in preparation for Chewbacca's family. Poe is excited and starts to enjoy the music. Shortly later, three Wookiees arrive. The two younger Wookiees go for the food while an older grey Wookiee attempts to eat a porg but is stopped by Chewbacca. The grey Wookiee defrosts a frozen First Order BB-series astromech droid. Rose is concerned that the party is deteriorating and Finn adds that Poe might lose arms. Poe asks who is up for party games but this doesn't work. Rose and Finn decide to send out a distress signal.\n\n",
        "section": "Stepping into peril[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 466.0
      }
    },
    {
      "id": "6177",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - In Sith hands[]\n\nBack on Kordoku, BB-8 is playing with his igniter when the green crystal drops, followed by Rey, Vader, and the younger Luke Skywalker. Rey asks where is the key. BB-8 retrieves the key and tries to roll away. However, Lord Vader uses the Force to hurl BB-8 aside and steals the green crystal. He activates the portal and departs with the mug. Rey tries to follow him but the portal closes. Rey says this is the worst Life Day ever while Luke drinks blue milk.\n\nAt the second Death Star, the Emperor spins in his chair when Lord Vader returns with the green crystal key. Vader explains that this is a key that allows them to travel through space and time. He says that he has witnessed its awesome power and believes they can use it to rule the galaxy. The Emperor however wants to go to the future where the Jedi are destroyed, the Rebellion is crushed and they reign supreme. The Emperor decides to go thirty years into the future.\n\nIn the future, the now Supreme Leader Kylo Ren is fiddling about shirtless in his chambers when General Armitage Hux stumbles on him. Hux informs him that they have send ships to head to the pectoral locations. Hux stutters before withdrawing. The Emperor grumbles about Kylo Ren being the Supreme Leader but their voices are heard by Kylo Ren, who is excited to see his grandfather and the Emperor. The Emperor tells Ren they came through a Life Day 'miracle.\" Kylo Ren is excited to see his hero but Lord Vader is unnerved by his fan art. Kylo Ren tells his guests that he just made himself Supreme Leader but the Emperor wants to know if he actually rules the galaxy in the future. Kylo Ren decides to update his guests about history but the Emperor tells him to put a shirt on.\n\nBack on Kordoku, Luke Skywalker asks where they are and who Rey is. Rey explains that she is just the Jedi Master who let Darth Vader on the loose to who knows where or when. As Rey attends to BB-8, Skywalker says that he is only a moisture farmer and has no idea who Darth Vader is but is an expert on vaporators. Seeing BB-8 damaged, Luke offers to help repair BB-8, restoring the droid. Rey is impressed with Luke's mechanical skills while Luke is curious about the spherical droid and takes an immediate liking to him.\n\nBack in the future, the Emperor learns the truth about his betrayal and death at the hands of Lord Vader during the Battle of Endor from Kylo Ren. The Emperor asks Ren for his lightsaber and toys with his cross-guard blade. The Emperor is impressed and asks Kylo Ren if he has a mask. Ren replies that he broke it, showing his Sith guests the altar where it rests. The Emperor uses the Force to repair Kylo Ren's helmet. Vader is impressed but the Emperor asks Kylo Ren if he would betray his master under any circumstances. This causes Ren to call his role in the murder of the previous Supreme Leader Snoke. Kylo Ren lies that he would not throw his master down a reactor shaft. The Emperor activates the portal with the crystal and invites Kylo Ren to change their destiny.\n\n",
        "section": "In Sith hands[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 672.0
      }
    },
    {
      "id": "6153",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Preparing for Life Day[]\n\nThey are interrupted by Poe Dameron, who tells them that they have got a Life Day party to set up. Poe is followed by Rose Tico, C-3PO, R2-D2 and Chewbacca. Poe mentions that Chewbacca's family is coming and that Wookiees like ripping arms off things and parties. He assigns Finn to do the decorating and asks Rey if she could help to roast the tip-yip. Rey murmurs in agreement before walking away.\n\nFrustrated with herself teaching Finn, Rey goes below deck to her personal Jedi library. Flipping through the books, Rey is frustrated that she can't train Finn despite following every teaching. Rey decides to meditate in the Force. She then feels a breeze which causes a brown Jedi book to drop. While reading the book, Rey smiles.\n\nMeanwhile, Poe tells Rose and Chewbacca that they have to prepare for Chewbacca's dinner. Rey then comes with the brown Jedi book and reads a passage telling her to visit the temple on Kordoku on Life Day where a key to the galaxy's past will help make a Jedi's future clearer. BB-8 beeps while Rose realizes this is not a tip-yip recipe. Chewbacca roars in frustration. When Finn asks what that means, Rey believes that she must go to Kordoku in order to help them with Finn's training. Finn thinks that Rey as a Jedi Master should take a break.\n\nRey says that she has to go now because today is Life Day to the dismay of the others. Rey suggests that one of them could do the tip-yip but Finn reminds her that it is about family. Poe quips that it is about the tip-yip until Rose punches him playfully. Rey promises not to miss the party while BB-8 decides to leave. D-O pleads with BB-8 not to leave but he follows Rey. D-O is lonely while Poe experiences an allergic reaction caused by the Wookiee fur and tree pollen on Kashyyyk. Dameron says that Generals don't cry and Rose adds that they lead. Poe decides to throw the greatest Life Day party in the history of the galaxy and tells them to decorate while he handles the tip-yip. Poe admits that he does not know how to roast tip-yip but dons his chef's cap.\n\n",
        "section": "Preparing for Life Day[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 493.0
      }
    },
    {
      "id": "6168",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Misadventures with Lord Vader[]\n\nBack on Kordoku, Vader uses the Force to snatch the green crystal key out of Rey's hands. While the Sith Lord tries to figure out what the device is, Rey charges at him with her lightsaber. Vader uses the Force to bring down rocks, separating them. Rey however uses her Force powers to cast the rocks aside. She hurls the rocks at him but Vader deflects them with the Force and his lightsaber. He asks if she is a Jedi and Rey confirms this is so.\n\nThe two fight over the green crystal key, causing the key to open a portal sucking them inside. BB-8 is left behind. Rey and Lord Vader emerge at Echo Base during the Battle of Hoth. As the two parry, Lord Vader is impressed by Rey and says that almost feels bad about having to destroy her. Before he can finish her, the command center is struck by a laser cannon. The past Lord Vader walks into the base with a contingent of Cold weather assault stormtrooper.\n\nThe past Lord Vader and his troops encounter the future Lord Vader. One of the snow troopers is confused, causing the past Lord Vader to Force choke him. The past Lord Vader orders the troops to seize the base but the future Lord Vader tells them to seize the girl. The past Lord Vader exerts his authority, prompting a lightsaber duel between the two Vaders. The two Lord Vaders size up their Force powers before realizing they are the same person. Both Vaders order their snowtroopers to destroy Rey. She manages to activate the portal and escape. The future Lord Vader and two snowtroopers follow. The past Lord Vader orders his troops to continue with their mission to seize the rebel base.\n\nOn Mustafar, Obi-Wan Kenobi and the fallen Anakin Skywalker, who becomes Darth Vader, are dueling on platforms above the lava lake. The two snowtroopers land on a floating platform while Rey and the future Darth Vader land on separate ones and parry. One of the snowtroopers passes the green kyber crystal, which Rey dropped, to Lord Vader but Rey snatches it in mid-air with the Force. Rey, the future Vader, the snow troopers, Kenobi, and Anakin slide down the time portal as the lava flows down a valley.\n\nOn Nevarro, Din Djarin and Grogu shelter behind a wall as Moff Gideon's stormtroopers and Death troopers converge on them. Rey, the future Darth Vader, Kenobi, Anakin, and the two snow troopers fall through a portal. Spotting Grogu, Rey and Vader say he is so cute. They open a portal in the ground, taking some stormtroopers and Death troopers with them.\n\nOn Tatooine, nine-year old Anakin Skywalker races against Sebulba in podracers during the Boonta Eve Classic. Just then, the portal opens and a snowtrooper and two stormtroopers land on Sebulba's Podracer. Rey and Darth Vader land on opposite sides of the engines of Anakin's podracer. One of the snowtroopers lands in the desert while the older Anakin and Kenobi land beside the younger Anakin. Fodesinbeed Annodue says that whichever end of the universe they came from, the fall must hurt. The crystal is caught between the force field generated by Sebulba's engines, causing it to suck everyone but the stranded snowtrooper into the time portal.\n\nOn Saleucami, two clone troopers on BARC speeders complain about traffic duty and quip about thinking like the same person. Just then, the portal opens and Anakin and Sebula's podracers race past. The two clone troopers realize they don't see podracers everyday, voicing their excitement over the racers' sudden appearance in unison. They race after the podracers, sirens blaring. As Rey and Lord Vader fight, the clones catch up with them and tell them to pull over. The motion generated by Sebulba's podracer engines triggers the crystal key, which sucks everyone onto the planet Exegol.\n\nRey attempts to summon the crystal but it generates a portal on the hull of an Xyston-class Star Destroyer, sucking everyone include a group of First Order stormtroopers in with them. While falling through the portal, Rey and Lord Vader continue their duel, rapidly entering and exiting a large number of portals, gathering more and more people with them. On Tatooine, an adolescent Luke Skywalker watches the twin suns of Tatooine setting over the Lars homestead while drinking blue milk. The portal opens, dumping everyone on the desert.\n\nAs everyone gathers, three different versions of Obi-Wan Kenobi each greet each other. A legless Darth Maul clears his throat. Other people include both an older and younger Han Solo, Greedo, and numerous clone troopers, stormtroopers, First Order jet troopers and Sith troopers, among other combatants of the struggle between light and dark throughout galactic history. The two Solos agree to shoot Greedo first, and a battle commences between the forces of light and dark.\n\nRey and Lord Vader continue their fight. Lord Vader remarks that someone has trained her well. Rey remarks that he has no idea who. Just then, Luke Skywalker asks who are they. Rey recognizes him as a younger Master Skywalker while Darth Vader recognizes his son but pretends to be referring to the twin suns of Tatooine. Luke notices the green crystal key and asks what it is. When Rey and Vader charge after him, he tells them it is a private farm. The two tackle Skywalker and the three of them get sucked through a portal.\n\n",
        "section": "Misadventures with Lord Vader[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 1187.0
      }
    },
    {
      "id": "6151",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Training Finn[]\n\nAboard the Millennium Falcon on the planet Kashyyyk, Finn trains with a Marksman-H training remote while wielding Rey's yellow lightsaber. As Finn struggles, Rey tells him to relax and concentrate. Since Finn is distracted by the porgs, Rey places a hood on his head. She tells Finn to be mindful of his surroundings and asks if he can feel the remote. However, the remote stings Finn in the backside. When Finn expresses frustration, Rey reassures Finn that the Force is strong with him.\n\nShe remind him that a Jedi must let go. Misunderstanding Rey, Finn swings his lightsaber across the Millennium Falcon's passenger hold, causing some damage to the furniture. When his hood comes off, Finn eyes the training remote and slices it in half. Finn cheers but the damaged training remote stings him in the backside. Finn loses his temper. As Rey flips through the book, she wonders what she is not doing right.\n\nA frustrated Finn asks if she is sure that he is meant to become a Jedi. Rey tells him to hand her the lightsaber and explains that the Jedi text says that when we go down the wrong path, we must take another. She hands Finn a wooden lightsaber. Finn parries with the newly repaired training remote but it sets his wooden blade alight. Rey wonders what she is doing wrong.\n\n",
        "section": "Training Finn[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 287.0
      }
    },
    {
      "id": "6149",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Prologue[]\n\nThe film begins with Yoda establishing that the First Order and the Sith were no more, saying that peace has spread across the galaxy. With freedom restored, Life Day could once again be celebrated. Yoda explains that Life Day is a holiday of friendship, family and connection. The camera then shifts to the pages of a book. Yoda explains that Rey Skywalker and her friends had traveled to Kashyyyk to celebrate with Chewbacca and his family. However, he adds that the celebration would have to wait for Rey and Finn.\n\n",
        "section": "Prologue[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 119.0
      }
    },
    {
      "id": "6186",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - The Emperor's new apprentice[]\n\nAboard the second Death Star, the Emperor and Kylo Ren regale about the Death Stars and Starkiller Base. They are interrupted by Vader, whose presence the Emperor does not welcome. The Emperor sends Darth Vader to fetch Luke Skywalker from the Forest Moon of Endor. Vader grumpily complies before leaving. In Vader's absence, Ren warns the Emperor that sending Vader to fetch Skywalker will lead to the exact chain of events which ends up with Vader hurling the Emperor down a reactor shaft. Kylo Ren warns there is no coming back from that and asks the Emperor if he is worried about his apprentice betraying him. The Emperor dismisses Darth Vader as his former apprentice.\n\n",
        "section": "The Emperor's new apprentice[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 153.0
      }
    },
    {
      "id": "6196",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Connection and letting go[]\n\nBack on the second Death Star, the Emperor asks if Kylo Ren understands the plan. Ren stops spinning on the Emperor's throne and says that when Vader returns with Luke Skywalker, he will chuck them down the reactor shaft. The Emperor is pleased and vows to rule the galaxy with Ren at his side. Ren however is unsure but the Emperor displays a hologram chart showing that the Emperor is clearly above the Supreme Leader.\n\nRen is willing to throw Skywalker down a reactor shaft but is not keen on throwing his grandfather down too. The Emperor warns Kylo Ren not to get cold feet. Just then, a time portal appears and Rey exits. As she enters the Emperor's Throne Room, Rey calls out to Kylo Ren through his original name Ben Solo. Confused, the Emperor asks Ren who Ben is. Ren rejects his former identity and says he is Supreme Leader Kylo Ren. The younger Luke Skywalker then exits the portal, and his presence enrages his nephew. The Emperor orders Ren to kill them.\n\nRey and Kylo Ren engage in a lightsaber duel. Ren gains the upper hand and hurls Rey against a wall. The Emperor cheers. Luke yells that no one hurts his friend and hurls a carton of blue milk at Kylo Ren. Ren uses the Force to intercept the contents and hurl it back at Skywalker. The Emperor orders Ren to kill Skywalker. Before he can do so, BB-8 blocks his path long enough for Rey to intercept his blade with her lightsaber. The Emperor orders Ren to also kill Rey and Darth Vader as well.\n\nJust then, Lord Vader arrives with the older Luke Skywalker. Ren is surprised to see his uncle. Vader asks the Emperor what he meant by destroy Vader too. The Emperor is caught off-guard and Rey takes the opportunity to throw Kylo Ren into Vader. Rey enlists the older Luke Skywalker's help. The Emperor convinces Vader and Kylo Ren to join him in the fight against Rey and Skywalker. A lightsaber battle ensures with Kylo Ren fighting Luke and Rey fighting Darth Vader.\n\nKylo Ren tells Skywalker that he has always hated him but the older Skywalker says that he has never met him before. The Emperor unleashes Force lightning. Rey charges at him but is intercepted by Kylo Ren. To Rey's surprise, Ren deactivates his lightsaber, offers his hand and invites her to rule the galaxy with him. While the Emperor is briefly distracted by Ren and Rey's interaction, BB-8 takes the key from his hands. Ren attempts to use the Force to get the key from BB-8, but it fly passes him to Rey. A saddened Rey looks at Kylo Ren and calls him Ben again, as she says goodbye to him while using the key to send him back to his ship. Ren's helmet shatters and he throws a tantrum by destroying his room with his lightsaber. A horrified General Hux sneaks out of the room.\n\nBack aboard the Emperor's Throne Room, the Emperor attacks the older Luke Skywalker with Force lightning, killing him. The Emperor then unleashes Force lightning on Darth Vader, crippling him. The Emperor invites Rey to join him as his newest apprentice. Rey rejects his offer, telling him that he has failed before and will fail again. She says that good will always triumph over evil. The Emperor attacks her with Force lightning and threatens to kill both Skywalkers, Ren, and Vader if she does not join him.\n\nVowing to rule the galaxy by himself, the Emperor steals the blue-green crystal and tries to enter the portal. Rey stops him. The Emperor dismisses her as pathetic and asks if she can think to defeat him alone. Rey responds that she is not alone. The older Luke Skywalker comes to Rey's aid and uses the Force to levitate the green crystal. Rey asks Luke if she remembers his first Force lesson to \"let go.\" Luke lets go, causing the crystal to slam into the Emperor and Vader who crash into the Emperor's throne.\n\nWith the Sith distracted, Rey departs with the younger Luke and BB-8. She tells the older Luke that she is putting his younger self back where he belongs. The older Luke stays behind and watches as Lord Vader flings the Emperor down the reactor shaft, telling him that he has had enough taking orders from him. He also throws the Emperor's mug down, wishing him a \"Happy Life Day.\" As the Emperor plummets to his demise, he realizes that he was so mean and decides to change his ways. Distracted, he hits the reactor shaft and is lost to the abyss.\n\n",
        "section": "Connection and letting go[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 942.0
      }
    },
    {
      "id": "6164",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - A messy preparation[]\n\nBack aboard the Millennium Falcon, Poe and his team prepare decorations and lights with the help of the porgs. However, the porgs let go of one of the cables, which crashes into the ice GNK-series power droid. Rose realizes that they still need a tree and sends Chewbacca to fetch one while she and Finn clean the mess. When Finn remarks that Rey said that they would not notice if she was gone, he says he noticed. Meanwhile, Poe roasts a piece of tip-yip meat over the exhaust engines of the Falcon. Rose is horrified by Poe's recklessness. The tip-yip meat is scorched and only extinguished by D-O. Just then, Chewbacca and the porgs fell a tree, which lands on the hull of the Falcon.\n\n",
        "section": "A messy preparation[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 176.0
      }
    },
    {
      "id": "6202",
      "title": "The LEGO Star Wars Holiday Special",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2020 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon LEGO films",
          "Disney+ Originals"
        ],
        "content": "# The LEGO Star Wars Holiday Special - Celebration of life[]\n\nRey takes the younger Luke Skywalker back to Tatooine. She tells BB-8 that he will be fine because he is one tough Jedi even though he does not know it yet. Rey then takes the various combatants back to their correct time zones before returning to the Jedi Temple on Kordoku.\n\nBack at the Millennium Falcon, Poe and the others celebrate. Rey arrives and is delighted that she made it back in time. BB-8 tells an incredulous C-3PO about his encounters with numerous Master Skywalkers. Rey tells Finn that she found that what she was looking for was right here before hugging him. Poe invites Finn to cut up the tip-yip but Rey gives Finn the honors of doing so. Finn ignites his lightsaber and Rey says she is ready to train him. Attempting to focus on let go, Finn cuts the table in half by accident but Rey says that they will work on that together. Just then, it begins snowing on Kashyyyk. Everyone rushes out to enjoy the snow. One of the Wookiees hurls BB-8. Poe and Zorii also spend a tender moment together. Rey sees the Force ghosts of Luke and Leia Skywalker. Yoda ends the story by saying that Life Day is a time for family and friends before wishing the viewer a happy Life Day.\n\n",
        "section": "Celebration of life[]",
        "source": "https://starwars.fandom.com/wiki/The_LEGO_Star_Wars_Holiday_Special",
        "title": "The LEGO Star Wars Holiday Special",
        "tokens": 285.0
      }
    },
    {
      "id": "6249",
      "title": "Star Wars Screen Entertainment",
      "metadata": {
        "categories": [
          "Real-world media",
          "1994 releases",
          "Legends computer games"
        ],
        "content": "# Star Wars Screen Entertainment - Screen savers[]\n\nBlueprints: Blueprints of ships including details, plus indications of the location of each of its parts (e.g., hyperdrive in the Millennium Falcon).\nCantina: A static photo of the Mos Eisley Cantina, then the system chooses one of the characters in the cantina and explains his or her story.\nCharacter biographies: Profiles focusing on the lead characters of A New Hope. Most of the details center on that film's plot.\nDarth Vader: The message \"The Dark Lord of the Sith approaches\" followed by a static close-up of Darth Vader, adding voice and/or breathing.\nDeath Star Trench: An animation of the trench, at high speed. Users can choose if they want only an X-wing, only a TIE fighter, or both (in this case, the X-wing will be chasing the TIE).\nHyperspace: A semi-static picture of the Millennium Falcon cockpit, with moving stars outside. Suddenly, Han Solo moves his arm and the stars become lines as if entering the hyperspace. After a while, Han moves again and the lines become stars. Chewbacca periodically howls.\nImperial Clock: The \"clock\" used by Grand Moff Tarkin while reaching Yavin 4, adding a real 24- or 12-hour digital clock.\n\nJawas: Small Jawas, droids, banthas, womp rats and Tusken Raiders move across the screen. The Jawas sometimes \"open\" the screen to see if there's anything of value under it. Tusken Raiders scare the Jawas, who stop whatever they were doing and run away.\nLightsaber Duel: Similar to Jawas, it features small Darth Vader attacking small Obi-Wan Kenobi.\nPoster Art: It features different posters from A New Hope.\nRebel Clock: Similar to Imperial clock, with Dodonna's display of the Battle of Yavin. It is analog. The Death Star marks minutes and Yavin 4 marks hours. The Death Star might be over Yavin.\nScrolling Text: Recreates the film's opening crawl. User can edit the crawl and write his or her own text. It also included a hidden message from George Lucas about his plans to release the prequel trilogy.\nSpace Battles: As seen from some window in a cruiser, small dots move against each other and shoot beams. Mon Calamari cruisers, Nebulon-B frigates and Star Destroyers drift slowly across the screen while fighters occasionally fly by.\nStoryboards: Real storyboards from A New Hope, alongside the script.\n\n",
        "section": "Screen savers[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Screen_Entertainment",
        "title": "Star Wars Screen Entertainment",
        "tokens": 533.0
      }
    },
    {
      "id": "6251",
      "title": "Star Wars Screen Entertainment",
      "metadata": {
        "categories": [
          "Real-world media",
          "1994 releases",
          "Legends computer games"
        ],
        "content": "# Star Wars Screen Entertainment - Continuity[]\n\nSome of the information in the biographies became outdated after the release of the 1997 re-release and the prequels. It identifies Owen Lars as Obi-Wan Kenobi's brother (which originated in the Return of the Jedi novelization and has since been contradicted), and is the only source listing Beru Lars' maiden name as Beru Weth (later revealed to be Beru Whitesun). It also includes alternate names for some Mos Eisley Cantina patrons, many later revealed to be aliases in other sources.\n\nThe software's biography of Darth Vader includes details of his past that are very similar to the plot of the prequels, still years away. This is also the original source of Grand Moff Tarkin's first name, which has since become canon; it was initially spelled \"Willhuf\" in the software, though later spelled as \"Wilhuff\" in later media.\n\nIn the Jawas and Lightsaber Duel options, the images are from the video game Super Star Wars.\n\n",
        "section": "Continuity[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Screen_Entertainment",
        "title": "Star Wars Screen Entertainment",
        "tokens": 215.0
      }
    }
  ]
}