{
  "cluster_id": 45,
  "size": 83,
  "vectors": [
    {
      "id": "1117",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Sword of Khashyun[]\n\nBack at Oga's Cantina, Kendoh Voss showed Hondo a tablet with a picture of the Sword of Khashyun which Kendoh's gang wanted to get passed the First Order blockade. Hondo said that he has seen it before to which Dok-Ondar told him over an earpiece to stop answering her but Hondo continues on and talks about a person that they left behind when getting the sword. She was a well know as an archaeologist and was known to have conned Darth Vader.\n\nA long time before, Doctor Chelli Lona Aphra with her protocol droid 0-0-0 met with Hondo Ohnaka to get a ship so they could find the Sword of Khashyun.\n\n",
        "section": "Sword of Khashyun[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 163.0
      }
    },
    {
      "id": "1116",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - A heist from the Temple of the Kyber[]\n\nSometime before, Hondo Ohnaka, Dok-Ondar and Quadoro broke into the tunnels of the Temple of the Kyber to steal a statue. They were stopped by a guardian who they quickly stunned. Quadoro questioned Captain Ohnaka on why he has to be in the front, to which he was quickly gunned down by more guardians. While Hondo continued to fight the guardians, Dok-Ondar located their target and began to admire the history of it. He felt that it brought him closer to his parents. Dok-Ondar used a laser torch to break off the statue from the rest of it's base but the lasers deflected off and shot to the ceiling which caused part of the ceiling to fall and take a guardian Hondo was fighting with it. Dok-Ondar used Ki-Adi-Mundi's lightsaber instead to break off the statue. After doing so, Hondo quickly grabbed the Ithorian and they made their way to the exit. They were stopped by another guardian, this one introduced himself as Chirrut Îmwe and refused to let them pass by. Hondo underestimated the blind man and started to shoot at him. Chirrut dodged the blaster fire and knocked out Hondo. Hondo got back up and started to duel Chirrut with his own staff. Dok-Ondar intervened and stated that this statue was a clue to figuring out the murder of his parents. Chirrut let them go and the two returned to the ship.\n\nAs they left they were spotted a Imperial starfighter who was on patrol. Hondo started to fly toward the Star Destroyer over head stating that the starfighters will not fire on their own ship. As he flew closer to the ship, he took off into hyperspace.\n\n",
        "section": "A heist from the Temple of the Kyber[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 384.0
      }
    },
    {
      "id": "1115",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Meeting with Hondo Ohnaka[]\n\nA group of First Order stormtroopers were chasing Remex Io through the streets of Black Spire Outpost. While shooting at Remex as stray bullet hit a Zeltron, killing him. The stormtroopers have an arrest warrant on Remex and were told to take him in alive until Remex started to shot back at them, killing one of them. Remex changed his form to a human sitting on the street. When asked where Remex went, he told the stormtroopers that he ran toward the spaceport. After changing back to his regular form, Remex was quickly grabbed by the throat and by Varg, Dok-Ondar's \"fixer\". Varg said he was here fix a big problem for Dok-Ondar.\n\nShortly after at Oga's Cantina, Remex managed to meet up with Kendoh Voss and Wooro. Remex told Kendoh that Dok-Ondar had found out about the heist and they must abort the plan. Kendoh told Remex that they are still going forward with the plan and walked over to a booth to go meet with a fortune teller. The fortune teller told the person in the booth behind them all about Kendoh and her gang. The person asked Kendoh to go over to him and introduced himself as the Weequay pirate, Hondo Ohnaka. Kendoh says they need a pilot who can make a run through a First Order blockade. Back at the bar, Remex was skeptical about hiring Hondo as their pilot. But Wooro told him it was all part of their ploy. At the booth, Hondo reassures Kendoh that he is the right person for the job and mentioned a job that he and Dok-Ondar took and escaped the Guardians of the Whills and escaped an Imperial blockade. At another location, Dok-Ondar is holding a recording of Hondo talking to Kendoh, and he told Hondo to just try to get Kendoh to pump information about her plan.\n\n",
        "section": "Meeting with Hondo Ohnaka[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 428.0
      }
    },
    {
      "id": "1333",
      "title": "Sentience",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Incomplete lists",
          "2 more",
          "Biological phenomena",
          "Society and culture"
        ],
        "content": "# Sentience - Sentience and the Force[]\n\nWith his sentience, Darth Sidious manipulated unwitting senators of the Galactic Senate such as Jar Jar Binks to grant him supreme authority, although by the will of the Force, Sidious was deposed by the son of the Chosen One, who was conceived by the midi-chlorians—organisms that formed a symbiotic relationship with organic beings and communicated to them the Force's will; the foundation of life and what connects and maintains the symbiotic relationship between the Living Force—the energy of all life—and the Cosmic Force, which bound all things in the galaxy.\n\n",
        "section": "Sentience and the Force[]",
        "source": "https://starwars.fandom.com/wiki/Sentience",
        "title": "Sentience",
        "tokens": 124.0
      }
    },
    {
      "id": "1670",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Hondo Ohnaka[]\n\nDuring the newly-established Galactic Empire's occupation of Jedha, Dok-Ondar hired and accompanied Captain Hondo Ohnaka to retrieve a Kyber crystal statue from the Temple of the Kyber. Dok-Ondar, Ohnaka, and his protege Quadoro went into the temple. Inside they were confronted by several Guardians of the Whills. Despite the Guardians, Dok-Ondar was able to grab one of the statues by using Mundi's lightsaber to cut it out. As they made their way out, they were confronted by Chirrut Îmwe. Dok-Ondar was able to convince Îmwe to let them leave with the statue. He and Ohnaka were able to board their shuttle and make their way past the Empire's blockade.\n\n",
        "section": "Hiring Hondo Ohnaka[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 173.0
      }
    },
    {
      "id": "1674",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Encountering Kendoh's crew[]\n\nAt one point, Remex Io, a Clawdite reunited with his crew led by female human Kendoh Voss, spoke with Dok-Ondar on Batuu, at Black Spire Outpost. Dok-Ondar was disappointed with how late the crew was, due to the First Order's arrival and Io needing to take a longer route through an alley. While there, the other member of Voss' crew, Wooro, noticed an infant sarlacc. Dok-Ondar told him the story of Solo smuggling them in from a reserve on I'vorcia Prime, but Voss immediately got to showing Dok-Ondar what she wants to sell him. When Dok-Ondar saw what was on the screen, a lightsaber, he asked them to leave immediately. His assistant asked him how that weapon could have been retrieved, and Dok-Ondar wanted to make sure it did not fall into the wrong hands.\n\nLater, the First Order arrived at Dok-Ondar's place to investigate the lightsaber that he owned. A stormtrooper sergeant threatened Dok-Ondar, saying all of his items could be reclassified as contraband and destroyed and also noting that owning a lightsaber could once again be a crime. When the stormtroopers left, Dok-Ondar noted to his assistant and translator Tohago that he planned to move the hilt of the sword to a safe location to prevent the First Order from discovering it.\n\nLater, Dok-Ondar sent his Clawdite enforcer Varg to intercept Io. Varg incapacitated Io and impersonated him to get on the inside of the Kendooh Gang. Then, Dok-Ondar listened in on a conversation between Voss and Hondo Ohnaka, who he was in league with. Voss revealed part of her plan to Ohnaka, trying to hire him as a pilot, unaware of his ties with Dok-Ondar. However, when Voss showed Ohnaka what the cargo was, the Sword of Khashyun, Dok-Ondar was furious to see Ohnaka reveal his knowledge of the sword to Voss.\n\nOhnaka made his way to Dok-Ondar to inform him of what he knew, but when he began to babble loudly in the street, Dok-Ondar angrily silenced him, warning him of the amount of spies in the area. Bringing him inside, Ohnaka told him what he knew, unaware that they were being spied on by a cam droid operated by the Kendoh Gang. Dok-Ondar explained the mission he and Aphra undertook on Moraband to Ohnaka, and when Ohnaka asked for more details, Dok-Ondar told him that they could talk more at the safe house, expressing his desire to move the hilt to Ohnaka's ship before it could be stolen. Just then, Voss and Wooro entered the den to steal the hilt. However, Dok-Ondar activated his primary security droid BK-86, but at the same time, a group of stormtroopers formed outside.\n\nThe stormtroopers entered, aiming their blasters at Dok-Ondar, Tohago, BK-86, Voss, and Wooro. After the stormtroopers beat Wooro and hit Voss on the chin with a blaster, they questioned Voss about her intentions on Batuu, believing her to be with the Resistance. Then, Voss improvised, eventually passing off the hilt to Wooro, who would unknowingly give it to Varg, thinking he was Io. Varg returned the hilt to Dok-Ondar, who then contacted Voss via hologram to reveal he was the benefactor that had hired them. Dok-Ondar told them that he could not afford to let them sell the blade and instead tried to unite the two pieces. As he succeeded in doing so, he told the crew that their payment was leaving the planet safely, saying he gave the First Order an anonymous tip regarding their location that would give them enough time to escape.\n\n",
        "section": "Encountering Kendoh's crew[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 856.0
      }
    },
    {
      "id": "1605",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - First Order era[]\n\nIn 34 ABY, the outpost attracted beings who sought to avoid the expanding reaches of the First Order and its conflict with the Resistance, which had erupted into a war. One such being was the Weequay smuggler Hondo Ohnaka, who brought the modified YT-1300 light freighter named the Millennium Falcon to the outpost and established Ohnaka Transport Solutions, a shipping company that was a front for his smuggling operations. Based out of Docking Bay 5, the company frequently recruited flight crew members among the outpost's new arrivals.\n\nThe human mercenary Bazine Netal had been hired to search for the Millennium Falcon and purchase it from whomever had it in their possession. At Oga's Cantina, the smuggler told her stories of his history with the ship to stall for time as a Yarkoran sabacc player secretly contacted Mahjo Reeloo, who owed Ohnaka a favor after an incident in the Undervaults of Gwongdeen. Netal paid Ohnaka for the Falcon and delivered it to Beixander 9, where Reeloo posed as Netal's contact to accept delivery of the ship before returning it to the outpost. Ohnaka notified Chewbacca, a Wookiee and the ship's former co-pilot, that the Falcon was safe from Netal's employers. Though Ohnaka continued to use it for his business, he also expressed certainty that the ship would continue to aid \"the good guys.\"\n\nAncient ruins just outside of the outpost housed a Resistance base around that same time. Eventually, Supreme Leader Kylo Ren arrived at the outpost and took command of the First Order garrison, having learned that Rey was with a group of Resistance fugitives on Batuu. A battle between the factions took place in the outpost and above the planet.\n\n",
        "section": "First Order era[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 386.0
      }
    },
    {
      "id": "1600",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - High Republic era[]\n\nDuring the High Republic Era, the Jedi Order built a Jedi temple near Black Spire Outpost.\n\nBetween 233 BBY and 232 BBY, Jedi Initiates Kai Brightstar, Lys Solay, and Nubs of the Tenoo Jedi Temple traveled to Black Spire Outpost with Jedi Padawan Celesta Kami of the Batuu Jedi Temple. While in search of tools to purchase for Kami's master, Carver Drow, the group found property developer Ozon Nimbee presenting to Black Spire residents on potential developments. Nimbee sought to construct buildings with unobstructed views of the Batuuan skies, which would necessitate cutting down very spires central to the outpost's identity. Despite of the refusal of the outpost residents, Nimbee tested using sabotage droids to cut down several spires near the outpost. The Jedi, witnessing the test, confronted Nimbee, who was berated by the townsfolk. Believing the only way to get buy-in for his plans was to cut down the spires within the outpost without permission, Nimbee released a swarm of his buzz droids on Black Spire Outpost. The Jedi and townsfolk fought the swarm of droids, destroying many of them. Soon, Drow arrived to destroy several more with his lightsaber and the Force. One droid, however, escaped notice before completely transecting the spire overlooking the milk stand. As the upper portion of the enormous spire fell, the Jedi used the Force to prevent it from crushing the milk stand and set it gently on the ground nearby. At some point, the fallen spire was placed upon its base once more, leaving behind the evidence of the clean cut. Following the defeat of Nimbee, Drow decided to promote relations with the local residents.\n\nTo foster friendly relations with the residents of Black Spire Outpost, the Jedi hosted at least two public training days outside the Temple. During a later visit to Batuu, Brightstar duelled with Master Drow during a public training day but experienced fears and doubts. At the advice of Drow, Brightstar later retreated to a cave where he experienced Force visions which helped him to overcome his doubts and insecurity. Following a second public training day, local girl Sadie Bolter stole Lys's lightsaber in order to overcome her own insecurities. However, the lightsaber was stolen by the local bully Pak Relda. Seeking to make amends with Solay and her friends, Bolter helped the Jedi to recover Lys's lightsaber and defeated Relda in a sword duel.\n\nLater, the Jedi Order abandoned the Batuu Jedi Temple after the facility was contaminated by an ancient Sith runestone, that claimed the lives of several Jedi including Master Sylwin. The sole survivor was Padawan Ady Sun'Zee. In response Master Yoda sealed the Batuu Temple with The Force, declaring it lost.\n\n",
        "section": "High Republic era[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 601.0
      }
    },
    {
      "id": "1669",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Biography[]\n\nDok-Ondar was born into a family of gardeners and began his love of collecting and discovering bones, unusual rocks and other unusual things while helping his parents in the garden. Supportive and encouraging of his hobbies, his parents allowed him to develop trading and business skills to turn his collecting into a career. However, they were murdered under mysterious circumstances after stumbling upon archaeological secrets related to the Jedi and Sith\n\nIn 10 BBY, Dok-Ondar was present on First Light, the yacht operated by Crimson Dawn crime lord Dryden Vos, while Vos met with Tobias Beckett and Han Solo. Qi'ra, Vos' top lieutenant, wanted to ensure that Dok-Ondar was being well attended to.\n\nDok-Ondar later traveled to Jabba the Hutt's Palace on Tatooine and was in attendance when Jabba was berating Greedo for his failure to retrieve an important target on Mygeeto. Dok-Ondar would end up saving the Rodian bounty hunter's life when he offered to purchase Ki-Adi-Mundi's lightsaber, which Greedo had retrieved during the course of his failed mission and was unsuccessfully trying to barter to Jabba in exchange for his life, in addition to the dianoga puppy he'd been there to buy as well for double the price.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 280.0
      }
    },
    {
      "id": "1662",
      "title": "The Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 articles and stories",
          "Myths & Fables"
        ],
        "content": "# The Black Spire - Plot summary[]\n\nAccording to legend, long ago a family lived on Batuu. The father died during a supply run accident leaving his wife and four children to run a grain farm.\n\nOne day while the four children were playing by edge of the Surabat River Valley Anya's brother went missing. The girls searched for their brother until dusk but they could not find him. They eventually went home hoping that he was there but he was not. Anya's Mother had warn the children not to play by the valley but had not told them that it was because the slaver Sampa Grott would sometimes abduct people from the valley and put them to work. Knowing that her son was lost forever Anya's mother fell into despair.\n\nHowever the girls still had hope and the next morning Anya's oldest sister left for Black Spire Outpost armed with her late father's farming sickle to search for her brother. That night having not returned it seemed that the oldest sister had also be captured by the slavers and the mom fell deeper into despair. The next morning however the middle sister made the decision to leave to search for both her brother and sister. Leaving Anya to look after their mother the girl left armed with her late father's blaster. But that sister did not return. Anya not able to endure her mother's cries fled into the goods and began to sob.\n\nA robed man, having heard the crying and wishing to help, approached Anya in the woods. Initially afraid of the man, thinking he might be another slaver, Anya eventually told him how she lost her siblings. After hearing the tale the man encouraged Anya to go after her siblings believing she was the only one that could save them. Since Anya did not have a weapon the stranger fashioned a small wooden dagger from a fallen branch. After that the man disappeared into the woods.\n\nThe next morning Anya left for Black Spire Outpost armed with her dagger. Eventually while searching the Outpost Anya over heard a Gran and a Ithorian talking about Sampa Grott. The Gran has recently been tricked by Sampa and was about to head over to Sampa to confront him. Anya followed the Gran to the hidden junkyard, Sampa's Cradle. Once there she seeing that Sampa Grott was big brutal man that could not have been easily beaten in a fight Anya decided she had to come up with a more clever plan to save her siblings.\n\nAnya found Sampa's house and hid under his bed and waited for him to return home. After Sampa fell asleep Anya crept up and put her wooden dagger to his throat. Feeling the tip of the dagger, Sampa's eyes opened but did not move fearing that his throat would be cut. Anya having disguised her voice told Sampa that she was an assassin and was sent to kill him. Sampa begged for his life and Anya told him if she released the three children she would let him live. Sampa quickly agreed and Anya left the house and headed home. The next morning her bother and two sisters had both been returned. Sampa was rumored to have fled into Wild Space where his enemies couldn't find him.\n\n",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/The_Black_Spire",
        "title": "The Black Spire",
        "tokens": 660.0
      }
    },
    {
      "id": "1668",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar\n\nDok-Ondar\n\n\nBiographical information\n\nHomeworld\nIthor\n\n\n\nDescriptive information\n\nSpecies\nIthorian\n\n\nGender\nMale\n\n\nPronouns\nHe/Him\n\n\nHair color\nWhite\n\n\nEye color\nBlue\n\n\nSkin color\nBrown\n\n\n\nFamily information\n\nParent(s)\nDok-Ondar's fatherDok-Ondar's mother\n\n\n\nChronological & political information\n\nAffiliation(s)\nDok-Ondar's Den of Antiquities\n\n\n[Source]\n\nDok-Ondar was an Ithorian male collector who operated an antiquities shop in Black Spire Outpost on the planet Batuu on the edge of the Outer Rim Territories. According to a rumor, he was willing to trade any treasure as long as the price was right.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 164.0
      }
    },
    {
      "id": "1672",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Doctor Aphra[]\n\nDuring the Galactic Civil War, Dok-Ondar hired some men and accompanied Dr. Chelli Lona Aphra and her crew to Moraband using his ship. Dok-Ondar went to Moraband retrieve the Sword of Khashyun from a Sith Temple. Dok-Ondar watched as Aphra and his muscle, a group of Shistavanens, went into the temple. When 0-0-0 attempted to kill him, Dok-Ondar and his last man ripped 0-0-0 apart. He confronted Aphra after she and BT-1 retrieved the sword. Dok-Ondar fired a EMP pulse at BT-1 and refused to let the sword go to her. Aphra refused to give him the sword and had BT-1 take out the last of his muscle. Dok-Ondar shot at Aphra and split the sword in half. As he tried to reclaim the sword, which was now stuck in the ground, he noticed 0-0-0 rebooting and decided to take what he could, claiming one half and leaving Aphra the other half. Dok-Ondar left her and her droids stranded on Moraband. He deeply regretted splitting the sword in half.\n\n",
        "section": "Hiring Doctor Aphra[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 264.0
      }
    },
    {
      "id": "1676",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Personality and traits[]\n\nDok-Ondar was known for being a bit temperamental, yet he was willing to sell good stuff to his customers if they did the right deals with him. Dok's reputation on Batuu and beyond made him a respected and often feared figure within the black market and collecting community. Anyone who dared try and cheat on him would be put on his enemies list, referred to as the \"Doklist\" by locals, and find themselves the target of bounty hunters. Dok-Ondar also found himself in the position of an unofficial banker for Black Spire Outpost and worked with Oga Garra to keep track of debts owed to the both of them, with Oga's crew helping enforce these debts.\n\n",
        "section": "Personality and traits[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 155.0
      }
    },
    {
      "id": "1671",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Han Solo[]\n\nAt one point before the Battle of Yavin, Dok-Ondar, dealer of ancient antiquities stationed on Batuu, hired Solo to retrieve some infant sarlaccs from a famous holo scientific sarlacc keeper, Genzhor, on the planet I'vorcia Prime. When Solo arrived at the reserve, he found that Dr. Genzhor had been slain by his assistant, Ooris, when he pushed him into a pit of sarlaccs, and he was trying to scam him and attempted to steal his ship, the Millennium Falcon. After the events on I'vorcia Prime, Dok-Ondar was met again by Solo, returning the infant sarlacc. Dok-Ondar was dissatisfied with the results, due to there only being one, but Han lied and told him the reserve only had one.\n\n",
        "section": "Hiring Han Solo[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 183.0
      }
    },
    {
      "id": "1781",
      "title": "Star Wars: Tales from the Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles in need of cleanup",
          "Articles with an excess of redlinks",
          "7 more",
          "Articles with multiple issues",
          "2020 releases",
          "Incomplete Credits",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge - The Temple of Doom[]\n\nAfter returning to Seezelslak's Cantina, The Droid Repair Tech gave Seezelslak the right ingredients to make a drink, and while enjoying the drink, Seezelslak told them a tale. He said that long before the Clone Wars, the Jedi set up a temple to research dark artifacts on Batuu. One day, Jedi Master Sylwin and her padawan, Ady Sun'Zee found one of these Dark Relic, and brought it back to the Temple for research. But the relic was powerful, and turned them all against each other. Master Sylein put up a fight, but was lost. Ady hit the distress beacon to warn the council, and blacked out. When she came to, she was in the Temple, and was being attacked by Demlins that were corrupted by the artifact. She held her own, using her Lightsaber Master Yoda appears. He had gotten wind of the distress beacon, and had come to help. Master Yoda said that it had been three days since the distress call was sent. Yoda then went alone to contain the relic. Despite Master Yoda's Orders, Ady followed him into the Temple. The security system in the Temple activated, and Ady battled more demlins, and security droids, and when finished, Ady resumed her search for the Artifact. She found a fake version, and when she touched it, it glowed red, and created vines all over the Temple. Ady used her lightsaber to cut her way through, until she found the real artifact. Ady grabbed it, and heard master Sylwins voice telling her that she would never be a Jedi. Ady cut her way through more vines, until she arrives in a room with master Yoda calmly, sitting down. Master Yoda tells her that it was her fault, and under the influence of the artifact, she killed everyone in the Temple. Demlins then emerged from the floor, and dragged Master Yoda down into a Chasm, while Ady's lightsaber failed to work. The walls were ripped away to reveal a swirling storm of red clouds and rock. Ady fought more and more demlins, until she heard Master Yoda's voice telling her that her weapon was not needed. Ady placed her Lightsaber on the glowing white pedestal, and everything went black. Ady woke up to Master Yoda using The Force to fight against the artifact, and she saw he was being overpowered. Yoda asked Ady for help, and together, they contained the artifact. Yoda sealed of the Temple, and reassured Ady that she can fight the Darkness within her. Seezelslak then finished his tale by saying that Ady hid the keys to the Temple somewhere on Batuu.\n\n",
        "section": "The Temple of Doom[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
        "title": "Star Wars: Tales from the Galaxy's Edge",
        "tokens": 593.0
      }
    },
    {
      "id": "2039",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Plot summary[]\n\nMoradi pretends to get captured and is again interrogated by Kath. She manipulates Kath's pride to start a boxing match, allowing Kriki to get on board to program the ship to send a message that the Resistance is no longer on Batuu before the ship self destructs. Meanwhile, Dolin is met by Ylena who brings blasters from Savi's, and by many young people from his settlement who decided to join the cause after the First Order killed two villagers. When Dolin is signaled, the group rushes the transport to further distract Kath and his troops while Kriki works inside the transport; however, they only take down a few while incurring heavy losses as they are not trained soldiers. Just when everything seems lost, a man in red-painted stormtrooper's armor and a black cape emerges from the clearing. It is Archex dressed as his former identity, Captain Cardinal.\n\nArchex offers himself as Kath's prisoner, knowing Kath will not leave the planet unless he has something to give his superiors. Kriki has succeeded; after the ship departs with Kath and Archex on board, the message is sent and the ship explodes. A week later, a fully-recovered Moradi meets with Garra, who provides Moradi with a long range comms array as thanks for getting rid of the First Order. Moradi notified Organa that the base has been established and she can start using it as a fleet waypoint.\n\nSeveral weeks later, Moradi is training her many new recruits when she receives an alert from the Resistance that Kylo Ren and the 709th Legion are en route. She looks up to see a star destroyer entering the atmosphere, and tells her recruits that it is time to fight.",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 367.0
      }
    },
    {
      "id": "2030",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Behind the scenes[]\n\nDok-Ondar's Den of Antiquities is one of the gift shops at Star Wars: Galaxy's Edge, found at both Disneyland and Disney's Hollywood Studios. It specializes in high-end collectibles related to Jedi and Sith lore such as statues, historic lightsabers, and holocrons. The popular series of replica lightsaber hilts of well-known characters, known as Legacy Lightsabers, can be purchased at Dok-Ondar's.\n\nBy the end of May, 2024, the five-year anniversary of Galaxy's Edge, 32 Legacy Lightsaber hilts had been released and sold at Dok-Ondar's.\n\nAn animatronic of Ondar can also be found in the shop, with cast-member attendants interacting with him.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 173.0
      }
    },
    {
      "id": "2019",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Description[]\n\nDok-Ondar was an avid collector of antiques and any other oddities that would interest him, including weapons, armor, animals, plants, droids, and even remains of sentient beings. He amassed his vast collection in his travels and with the aid of his employees, scavengers, mercenaries, bounty hunters, and any others who were willing to take on his quests. His expansive collection of antiquities and valuables made his store resemble a small museum with buyable treasures.\n\nOutside of the store, Dok-Ondar displayed a bust of Jedi, a statue of a Jedi Consular resembling one formerly located at the Jedi Temple, and a large stone foot. He also had an Ithorian gravestone dedicated to his father and mother.\n\n",
        "section": "Description[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 166.0
      }
    },
    {
      "id": "2029",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Items not on display[]\n\nBedlam relic\nDancing Goddess\nOne of The Grand Inquisitor's lightsabers (sold to Karr Nuq Sin)\nJedi Master Ki-Adi-Mundi's lightsaber\nJedi Temple Guard's helmet\nSith scroll\nTwi'lek Ark (stolen by Edmo Ectacle)\nWED Treadwell repair droid\n\n",
        "section": "Items not on display[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 94.0
      }
    },
    {
      "id": "2027",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Weapons[]\n\nA-180 blaster\nAmban phase-pulse blaster\nBD-1 Cutter vibro-axs\nDefender sporting blaster pistol\nDL-44 heavy blaster pistol\nDLT-19D heavy blaster rifles\nE-11 medium blaster rifle\nE-11D blaster carbines\nEC-17 hold-out blaster\nELG-3A blaster pistol\nGaderffii sticks\nGamorrean battle-axes\nGlie-44 blaster pistol\nMunit'kad halberd\nRelby-v10 micro grenade launcher\nRyyk blades\nSE-14r light repeating blaster\nSword of Khashyun\nWESTAR-34 blaster pistol\nWookiee Klorri-clan battle shield\n\n",
        "section": "Weapons[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 175.0
      }
    },
    {
      "id": "2020",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Miscellaneous items in collection[]\n\nAdvozse skull\nBandfill\nBlack Sun banner\nBust of Darth Sidious\nBust of Maul\nBust of Plo Koon\nBust of Shaak Ti\nBust of Yaddle\nBust of a Gungan\nBust of a Togruta\nChindinkalu flute\nDesilijic banner\nDiagnostech life support units\nDorenian Beshniquel\nDouble jocimer\nDuros skull\nFour Sages of Dwartii statues\nGreat Sith Wars Bas-Relief\nHolocrons\nHumanoid skull\nKalikori\nKloo horn\nKyber crystals\nMandalorian banner\nMedal of Bravery\nNaboo Palace Guard uniform\nNe Ganna Dateel Jabba\nOmmni box\nSeven-string hallikset\nSith Chalice replica\nStylized Starbird banners\nTemple of the Kyber, kyber crystal statue\nTognath skull\nTransparent Documents\nTusken Raider banner\nUpside-down ancient navi-computer dataplaque\nUrn containing ashes of a blue snaggletooth\nX-wing starfighter sculpture\nZ-6 jetpack\n\n",
        "section": "Miscellaneous items in collection[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 265.0
      }
    },
    {
      "id": "2036",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Plot summary[]\n\nOn D'Qar, Vi Moradi is still recovering physically and psychologically from her interrogation on the Absolution by Captain Cardinal, whom she rescued after his near-fatal confrontation with Phasma. Before General Leia Organa leaves for Takodana, she gives Vi Moradi a new mission: to establish a new Resistance outpost on the planet Moradi has identified, and to bring Archex—the former Cardinal—to assist her. Before Moradi can depart for Batuu the next day, Organa transmits an announcement that Hosnian Prime and the Hosnian system have been destroyed by the First Order. Moradi's mission is put on hold.\n\nFour months after the Battle of Crait, Moradi's mission is back on. Alongside the PK-Ultra worker droid Pook, she picks up Archex from his enforced healing retreat on Cerea and they journey to Batuu. Their starship is caught in a skirmish between two smuggler ships upon arrival and they are forced to crash land in the forest. While unconscious, their ship is ransacked by the crew of the local crime boss, Oga Garra. A local Batuuan woman, Salju, find them and offers assistance. She gives Moradi a tour of Black Spire Outpost and gets her a job at Savi & Son Salvage to earn money to buy back her own equipment to establish a Resistance base. Through her new work, Moradi meets Ylena and Savi's Gatherers, but fails to recruit them to the Resistance. Due to limited mobility resulting from wounds inflicted by Phasma, Archex must remain hidden in the forest, leaving him feeling useless.\n\nMoradi is taken by one of Garra's enforcers to meet the crime boss within her cantina. Garra tells her that if she locates an artifact within the ruins and brings it back to Garra, Moradi can have her property back. Moradi secures Garra's agreement that the Resistance may also use the ruins as a base. Meanwhile, the First Order is alerted to the Resistance presence on Batuu, and General Hux dispatches Lieutenant Wulfgar Kath and twenty stormtroopers to inspect the world. Kath has a vendetta against Moradi and Archex after failing to prevent their escape from the Absolution.\n\nGarra offers to tell Kath of the Resistance if Kath brings her the artifact in the ruins. Kath and two troopers enter the ruins, following Moradi as she negotiates the ancient security measures. Two troopers are downed by Vi, though the latter becomes poisoned. Moradi is rescued by a farm boy named Dolin and his truffleboar Waba. Dolin brings him to his grandmother Grana and they nurse her back to health, but when Moradi persuades Dolin to join the Resistance, Grana rejects her grandson.\n\nMoradi gives the artifact to Garra and regains most of her property except her long range comm array, which is what she needs most to update General Organa of her situation. The next day, Moradi goes into town to buy a comm array and defends a Chadra-Fan named Kriki who is being mistreated by her employer. Kriki chooses to join the Resistance, helping Moradi with her errands and fixing up the new base within the ruins, the layout of which is being planned by Archex. Later on, Moradi recruits a drunken but charismatic loudmouth named Zade Kalliday, who helps manage the recruitment of Resistance personnel. Soon after, while Moradi is picking up lunch, she witnesses stormtroopers harassing two old women seeking information on Moradi. When she defends the women, she is overwhelmed by the two troopers, who take her prisoner.\n\nAfter undergoing torture by Kath, Moradi is rescued by her new companions. By then, multiple stormtroopers have been killed, leaving only twelve. Moradi and her three recruits make a plan to get the First Order to leave Batuu despite being outnumbered. She uses a stolen First Order comm link to tap into their network and send out a message to the Resistance, requesting that Organa send supplies and personnel, but Organa informs her that none are available and she has faith in Moradi. Dolin also goes back to his village to recruit for the upcoming attack, but his grandmother disowns him. Having no other options, the group proceeds with their plan.",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 910.0
      }
    },
    {
      "id": "2021",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Creatures and plants[]\n\nAnooba (mounted)\nCave sketto (stuffed)\nCoppergrin (mounted)\nCorellian hound (mounted)\nDianoga (juvenile)\nFelucian fireflies\nFelucian plants\nKod'yok (mounted)\nMythosaur skull\nNaboo plants\nNexu (mounted)\nOllopom\nProfrogg (stuffed)\nSimpi (Sarlacc juvenile)\nTauntaun (mounted)\nWampa (stuffed)\nWomp rat (stuffed)\n\n",
        "section": "Creatures and plants[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 125.0
      }
    },
    {
      "id": "2025",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Headgear[]\n\nA-wing flight helmet\nAlderaanian consular security helmet\nAT-AT pilot helmet\nB-wing flight helmet\nClone trooper helmet (Phase I)\nCoastal defender stormtrooper helmet\nCold-weather Soldier headgear\nEmperor's Royal Guard helmet\nEndor strike team helmet\nEtched mask\nEzra Bridger's Scout trooper helmet\nFemale Tusken Raider hoods \nImperial combat assault tank pilot helmets\nImperial Navy Trooper helmet\nImperial officer battle armor helmet\nJedi youngling helmets\nK-22995 light flight helmets\nKaleesh Erkush mask\nMandalorian helmet\nSeventh Sister's helmet\nStormtrooper helmets\nTIE fighter pilot helmet\nU-wing flight helmet\nUbese helmet\nY-wing flight helmets\n\n",
        "section": "Headgear[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 180.0
      }
    },
    {
      "id": "2023",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Droids[]\n\nBK-86\n\n",
        "section": "Droids[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 20.0
      }
    },
    {
      "id": "2104",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - A heist from the Temple of the Kyber[]\n\nSometime before, Hondo Ohnaka, Dok-Ondar and Quadoro broke into the tunnels of the Temple of the Kyber to steal a statue. They were stopped by a guardian who they quickly stunned. Quadoro questioned Captain Ohnaka on why he has to be in the front, to which he was quickly gunned down by more guardians. While Hondo continued to fight the guardians, Dok-Ondar located their target and began to admire the history of it. He felt that it brought him closer to his parents. Dok-Ondar used a laser torch to break off the statue from the rest of it's base but the lasers deflected off and shot to the ceiling which caused part of the ceiling to fall and take a guardian Hondo was fighting with it. Dok-Ondar used Ki-Adi-Mundi's lightsaber instead to break off the statue. After doing so, Hondo quickly grabbed the Ithorian and they made their way to the exit. They were stopped by another guardian, this one introduced himself as Chirrut Îmwe and refused to let them pass by. Hondo underestimated the blind man and started to shoot at him. Chirrut dodged the blaster fire and knocked out Hondo. Hondo got back up and started to duel Chirrut with his own staff. Dok-Ondar intervened and stated that this statue was a clue to figuring out the murder of his parents. Chirrut let them go and the two returned to the ship.\n\nAs they left they were spotted a Imperial starfighter who was on patrol. Hondo started to fly toward the Star Destroyer over head stating that the starfighters will not fire on their own ship. As he flew closer to the ship, he took off into hyperspace.\n\n",
        "section": "A heist from the Temple of the Kyber[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 384.0
      }
    },
    {
      "id": "2103",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Meeting with Hondo Ohnaka[]\n\nA group of First Order stormtroopers were chasing Remex Io through the streets of Black Spire Outpost. While shooting at Remex as stray bullet hit a Zeltron, killing him. The stormtroopers have an arrest warrant on Remex and were told to take him in alive until Remex started to shot back at them, killing one of them. Remex changed his form to a human sitting on the street. When asked where Remex went, he told the stormtroopers that he ran toward the spaceport. After changing back to his regular form, Remex was quickly grabbed by the throat and by Varg, Dok-Ondar's \"fixer\". Varg said he was here fix a big problem for Dok-Ondar.\n\nShortly after at Oga's Cantina, Remex managed to meet up with Kendoh Voss and Wooro. Remex told Kendoh that Dok-Ondar had found out about the heist and they must abort the plan. Kendoh told Remex that they are still going forward with the plan and walked over to a booth to go meet with a fortune teller. The fortune teller told the person in the booth behind them all about Kendoh and her gang. The person asked Kendoh to go over to him and introduced himself as the Weequay pirate, Hondo Ohnaka. Kendoh says they need a pilot who can make a run through a First Order blockade. Back at the bar, Remex was skeptical about hiring Hondo as their pilot. But Wooro told him it was all part of their ploy. At the booth, Hondo reassures Kendoh that he is the right person for the job and mentioned a job that he and Dok-Ondar took and escaped the Guardians of the Whills and escaped an Imperial blockade. At another location, Dok-Ondar is holding a recording of Hondo talking to Kendoh, and he told Hondo to just try to get Kendoh to pump information about her plan.\n\n",
        "section": "Meeting with Hondo Ohnaka[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 428.0
      }
    },
    {
      "id": "2105",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Sword of Khashyun[]\n\nBack at Oga's Cantina, Kendoh Voss showed Hondo a tablet with a picture of the Sword of Khashyun which Kendoh's gang wanted to get passed the First Order blockade. Hondo said that he has seen it before to which Dok-Ondar told him over an earpiece to stop answering her but Hondo continues on and talks about a person that they left behind when getting the sword. She was a well know as an archaeologist and was known to have conned Darth Vader.\n\nA long time before, Doctor Chelli Lona Aphra with her protocol droid 0-0-0 met with Hondo Ohnaka to get a ship so they could find the Sword of Khashyun.\n\n",
        "section": "Sword of Khashyun[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 163.0
      }
    },
    {
      "id": "2396",
      "title": "The Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 articles and stories",
          "Myths & Fables"
        ],
        "content": "# The Black Spire - Plot summary[]\n\nAccording to legend, long ago a family lived on Batuu. The father died during a supply run accident leaving his wife and four children to run a grain farm.\n\nOne day while the four children were playing by edge of the Surabat River Valley Anya's brother went missing. The girls searched for their brother until dusk but they could not find him. They eventually went home hoping that he was there but he was not. Anya's Mother had warn the children not to play by the valley but had not told them that it was because the slaver Sampa Grott would sometimes abduct people from the valley and put them to work. Knowing that her son was lost forever Anya's mother fell into despair.\n\nHowever the girls still had hope and the next morning Anya's oldest sister left for Black Spire Outpost armed with her late father's farming sickle to search for her brother. That night having not returned it seemed that the oldest sister had also be captured by the slavers and the mom fell deeper into despair. The next morning however the middle sister made the decision to leave to search for both her brother and sister. Leaving Anya to look after their mother the girl left armed with her late father's blaster. But that sister did not return. Anya not able to endure her mother's cries fled into the goods and began to sob.\n\nA robed man, having heard the crying and wishing to help, approached Anya in the woods. Initially afraid of the man, thinking he might be another slaver, Anya eventually told him how she lost her siblings. After hearing the tale the man encouraged Anya to go after her siblings believing she was the only one that could save them. Since Anya did not have a weapon the stranger fashioned a small wooden dagger from a fallen branch. After that the man disappeared into the woods.\n\nThe next morning Anya left for Black Spire Outpost armed with her dagger. Eventually while searching the Outpost Anya over heard a Gran and a Ithorian talking about Sampa Grott. The Gran has recently been tricked by Sampa and was about to head over to Sampa to confront him. Anya followed the Gran to the hidden junkyard, Sampa's Cradle. Once there she seeing that Sampa Grott was big brutal man that could not have been easily beaten in a fight Anya decided she had to come up with a more clever plan to save her siblings.\n\nAnya found Sampa's house and hid under his bed and waited for him to return home. After Sampa fell asleep Anya crept up and put her wooden dagger to his throat. Feeling the tip of the dagger, Sampa's eyes opened but did not move fearing that his throat would be cut. Anya having disguised her voice told Sampa that she was an assassin and was sent to kill him. Sampa begged for his life and Anya told him if she released the three children she would let him live. Sampa quickly agreed and Anya left the house and headed home. The next morning her bother and two sisters had both been returned. Sampa was rumored to have fled into Wild Space where his enemies couldn't find him.\n\n",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/The_Black_Spire",
        "title": "The Black Spire",
        "tokens": 660.0
      }
    },
    {
      "id": "2411",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Personality and traits[]\n\nDok-Ondar was known for being a bit temperamental, yet he was willing to sell good stuff to his customers if they did the right deals with him. Dok's reputation on Batuu and beyond made him a respected and often feared figure within the black market and collecting community. Anyone who dared try and cheat on him would be put on his enemies list, referred to as the \"Doklist\" by locals, and find themselves the target of bounty hunters. Dok-Ondar also found himself in the position of an unofficial banker for Black Spire Outpost and worked with Oga Garra to keep track of debts owed to the both of them, with Oga's crew helping enforce these debts.\n\n",
        "section": "Personality and traits[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 155.0
      }
    },
    {
      "id": "2410",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Encountering Kendoh's crew[]\n\nAt one point, Remex Io, a Clawdite reunited with his crew led by female human Kendoh Voss, spoke with Dok-Ondar on Batuu, at Black Spire Outpost. Dok-Ondar was disappointed with how late the crew was, due to the First Order's arrival and Io needing to take a longer route through an alley. While there, the other member of Voss' crew, Wooro, noticed an infant sarlacc. Dok-Ondar told him the story of Solo smuggling them in from a reserve on I'vorcia Prime, but Voss immediately got to showing Dok-Ondar what she wants to sell him. When Dok-Ondar saw what was on the screen, a lightsaber, he asked them to leave immediately. His assistant asked him how that weapon could have been retrieved, and Dok-Ondar wanted to make sure it did not fall into the wrong hands.\n\nLater, the First Order arrived at Dok-Ondar's place to investigate the lightsaber that he owned. A stormtrooper sergeant threatened Dok-Ondar, saying all of his items could be reclassified as contraband and destroyed and also noting that owning a lightsaber could once again be a crime. When the stormtroopers left, Dok-Ondar noted to his assistant and translator Tohago that he planned to move the hilt of the sword to a safe location to prevent the First Order from discovering it.\n\nLater, Dok-Ondar sent his Clawdite enforcer Varg to intercept Io. Varg incapacitated Io and impersonated him to get on the inside of the Kendooh Gang. Then, Dok-Ondar listened in on a conversation between Voss and Hondo Ohnaka, who he was in league with. Voss revealed part of her plan to Ohnaka, trying to hire him as a pilot, unaware of his ties with Dok-Ondar. However, when Voss showed Ohnaka what the cargo was, the Sword of Khashyun, Dok-Ondar was furious to see Ohnaka reveal his knowledge of the sword to Voss.\n\nOhnaka made his way to Dok-Ondar to inform him of what he knew, but when he began to babble loudly in the street, Dok-Ondar angrily silenced him, warning him of the amount of spies in the area. Bringing him inside, Ohnaka told him what he knew, unaware that they were being spied on by a cam droid operated by the Kendoh Gang. Dok-Ondar explained the mission he and Aphra undertook on Moraband to Ohnaka, and when Ohnaka asked for more details, Dok-Ondar told him that they could talk more at the safe house, expressing his desire to move the hilt to Ohnaka's ship before it could be stolen. Just then, Voss and Wooro entered the den to steal the hilt. However, Dok-Ondar activated his primary security droid BK-86, but at the same time, a group of stormtroopers formed outside.\n\nThe stormtroopers entered, aiming their blasters at Dok-Ondar, Tohago, BK-86, Voss, and Wooro. After the stormtroopers beat Wooro and hit Voss on the chin with a blaster, they questioned Voss about her intentions on Batuu, believing her to be with the Resistance. Then, Voss improvised, eventually passing off the hilt to Wooro, who would unknowingly give it to Varg, thinking he was Io. Varg returned the hilt to Dok-Ondar, who then contacted Voss via hologram to reveal he was the benefactor that had hired them. Dok-Ondar told them that he could not afford to let them sell the blade and instead tried to unite the two pieces. As he succeeded in doing so, he told the crew that their payment was leaving the planet safely, saying he gave the First Order an anonymous tip regarding their location that would give them enough time to escape.\n\n",
        "section": "Encountering Kendoh's crew[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 856.0
      }
    },
    {
      "id": "2407",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Han Solo[]\n\nAt one point before the Battle of Yavin, Dok-Ondar, dealer of ancient antiquities stationed on Batuu, hired Solo to retrieve some infant sarlaccs from a famous holo scientific sarlacc keeper, Genzhor, on the planet I'vorcia Prime. When Solo arrived at the reserve, he found that Dr. Genzhor had been slain by his assistant, Ooris, when he pushed him into a pit of sarlaccs, and he was trying to scam him and attempted to steal his ship, the Millennium Falcon. After the events on I'vorcia Prime, Dok-Ondar was met again by Solo, returning the infant sarlacc. Dok-Ondar was dissatisfied with the results, due to there only being one, but Han lied and told him the reserve only had one.\n\n",
        "section": "Hiring Han Solo[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 183.0
      }
    },
    {
      "id": "2408",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Doctor Aphra[]\n\nDuring the Galactic Civil War, Dok-Ondar hired some men and accompanied Dr. Chelli Lona Aphra and her crew to Moraband using his ship. Dok-Ondar went to Moraband retrieve the Sword of Khashyun from a Sith Temple. Dok-Ondar watched as Aphra and his muscle, a group of Shistavanens, went into the temple. When 0-0-0 attempted to kill him, Dok-Ondar and his last man ripped 0-0-0 apart. He confronted Aphra after she and BT-1 retrieved the sword. Dok-Ondar fired a EMP pulse at BT-1 and refused to let the sword go to her. Aphra refused to give him the sword and had BT-1 take out the last of his muscle. Dok-Ondar shot at Aphra and split the sword in half. As he tried to reclaim the sword, which was now stuck in the ground, he noticed 0-0-0 rebooting and decided to take what he could, claiming one half and leaving Aphra the other half. Dok-Ondar left her and her droids stranded on Moraband. He deeply regretted splitting the sword in half.\n\n",
        "section": "Hiring Doctor Aphra[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 264.0
      }
    },
    {
      "id": "2404",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar\n\nDok-Ondar\n\n\nBiographical information\n\nHomeworld\nIthor\n\n\n\nDescriptive information\n\nSpecies\nIthorian\n\n\nGender\nMale\n\n\nPronouns\nHe/Him\n\n\nHair color\nWhite\n\n\nEye color\nBlue\n\n\nSkin color\nBrown\n\n\n\nFamily information\n\nParent(s)\nDok-Ondar's fatherDok-Ondar's mother\n\n\n\nChronological & political information\n\nAffiliation(s)\nDok-Ondar's Den of Antiquities\n\n\n[Source]\n\nDok-Ondar was an Ithorian male collector who operated an antiquities shop in Black Spire Outpost on the planet Batuu on the edge of the Outer Rim Territories. According to a rumor, he was willing to trade any treasure as long as the price was right.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 164.0
      }
    },
    {
      "id": "2406",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Hondo Ohnaka[]\n\nDuring the newly-established Galactic Empire's occupation of Jedha, Dok-Ondar hired and accompanied Captain Hondo Ohnaka to retrieve a Kyber crystal statue from the Temple of the Kyber. Dok-Ondar, Ohnaka, and his protege Quadoro went into the temple. Inside they were confronted by several Guardians of the Whills. Despite the Guardians, Dok-Ondar was able to grab one of the statues by using Mundi's lightsaber to cut it out. As they made their way out, they were confronted by Chirrut Îmwe. Dok-Ondar was able to convince Îmwe to let them leave with the statue. He and Ohnaka were able to board their shuttle and make their way past the Empire's blockade.\n\n",
        "section": "Hiring Hondo Ohnaka[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 173.0
      }
    },
    {
      "id": "2405",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Biography[]\n\nDok-Ondar was born into a family of gardeners and began his love of collecting and discovering bones, unusual rocks and other unusual things while helping his parents in the garden. Supportive and encouraging of his hobbies, his parents allowed him to develop trading and business skills to turn his collecting into a career. However, they were murdered under mysterious circumstances after stumbling upon archaeological secrets related to the Jedi and Sith\n\nIn 10 BBY, Dok-Ondar was present on First Light, the yacht operated by Crimson Dawn crime lord Dryden Vos, while Vos met with Tobias Beckett and Han Solo. Qi'ra, Vos' top lieutenant, wanted to ensure that Dok-Ondar was being well attended to.\n\nDok-Ondar later traveled to Jabba the Hutt's Palace on Tatooine and was in attendance when Jabba was berating Greedo for his failure to retrieve an important target on Mygeeto. Dok-Ondar would end up saving the Rodian bounty hunter's life when he offered to purchase Ki-Adi-Mundi's lightsaber, which Greedo had retrieved during the course of his failed mission and was unsuccessfully trying to barter to Jabba in exchange for his life, in addition to the dianoga puppy he'd been there to buy as well for double the price.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 280.0
      }
    },
    {
      "id": "2520",
      "title": "Star Wars: Tales from the Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles in need of cleanup",
          "Articles with an excess of redlinks",
          "7 more",
          "Articles with multiple issues",
          "2020 releases",
          "Incomplete Credits",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge - The Temple of Doom[]\n\nAfter returning to Seezelslak's Cantina, The Droid Repair Tech gave Seezelslak the right ingredients to make a drink, and while enjoying the drink, Seezelslak told them a tale. He said that long before the Clone Wars, the Jedi set up a temple to research dark artifacts on Batuu. One day, Jedi Master Sylwin and her padawan, Ady Sun'Zee found one of these Dark Relic, and brought it back to the Temple for research. But the relic was powerful, and turned them all against each other. Master Sylein put up a fight, but was lost. Ady hit the distress beacon to warn the council, and blacked out. When she came to, she was in the Temple, and was being attacked by Demlins that were corrupted by the artifact. She held her own, using her Lightsaber Master Yoda appears. He had gotten wind of the distress beacon, and had come to help. Master Yoda said that it had been three days since the distress call was sent. Yoda then went alone to contain the relic. Despite Master Yoda's Orders, Ady followed him into the Temple. The security system in the Temple activated, and Ady battled more demlins, and security droids, and when finished, Ady resumed her search for the Artifact. She found a fake version, and when she touched it, it glowed red, and created vines all over the Temple. Ady used her lightsaber to cut her way through, until she found the real artifact. Ady grabbed it, and heard master Sylwins voice telling her that she would never be a Jedi. Ady cut her way through more vines, until she arrives in a room with master Yoda calmly, sitting down. Master Yoda tells her that it was her fault, and under the influence of the artifact, she killed everyone in the Temple. Demlins then emerged from the floor, and dragged Master Yoda down into a Chasm, while Ady's lightsaber failed to work. The walls were ripped away to reveal a swirling storm of red clouds and rock. Ady fought more and more demlins, until she heard Master Yoda's voice telling her that her weapon was not needed. Ady placed her Lightsaber on the glowing white pedestal, and everything went black. Ady woke up to Master Yoda using The Force to fight against the artifact, and she saw he was being overpowered. Yoda asked Ady for help, and together, they contained the artifact. Yoda sealed of the Temple, and reassured Ady that she can fight the Darkness within her. Seezelslak then finished his tale by saying that Ady hid the keys to the Temple somewhere on Batuu.\n\n",
        "section": "The Temple of Doom[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
        "title": "Star Wars: Tales from the Galaxy's Edge",
        "tokens": 593.0
      }
    },
    {
      "id": "2832",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Meeting with Hondo Ohnaka[]\n\nA group of First Order stormtroopers were chasing Remex Io through the streets of Black Spire Outpost. While shooting at Remex as stray bullet hit a Zeltron, killing him. The stormtroopers have an arrest warrant on Remex and were told to take him in alive until Remex started to shot back at them, killing one of them. Remex changed his form to a human sitting on the street. When asked where Remex went, he told the stormtroopers that he ran toward the spaceport. After changing back to his regular form, Remex was quickly grabbed by the throat and by Varg, Dok-Ondar's \"fixer\". Varg said he was here fix a big problem for Dok-Ondar.\n\nShortly after at Oga's Cantina, Remex managed to meet up with Kendoh Voss and Wooro. Remex told Kendoh that Dok-Ondar had found out about the heist and they must abort the plan. Kendoh told Remex that they are still going forward with the plan and walked over to a booth to go meet with a fortune teller. The fortune teller told the person in the booth behind them all about Kendoh and her gang. The person asked Kendoh to go over to him and introduced himself as the Weequay pirate, Hondo Ohnaka. Kendoh says they need a pilot who can make a run through a First Order blockade. Back at the bar, Remex was skeptical about hiring Hondo as their pilot. But Wooro told him it was all part of their ploy. At the booth, Hondo reassures Kendoh that he is the right person for the job and mentioned a job that he and Dok-Ondar took and escaped the Guardians of the Whills and escaped an Imperial blockade. At another location, Dok-Ondar is holding a recording of Hondo talking to Kendoh, and he told Hondo to just try to get Kendoh to pump information about her plan.\n\n",
        "section": "Meeting with Hondo Ohnaka[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 428.0
      }
    },
    {
      "id": "2837",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Sword of Khashyun[]\n\nBack at Oga's Cantina, Kendoh Voss showed Hondo a tablet with a picture of the Sword of Khashyun which Kendoh's gang wanted to get passed the First Order blockade. Hondo said that he has seen it before to which Dok-Ondar told him over an earpiece to stop answering her but Hondo continues on and talks about a person that they left behind when getting the sword. She was a well know as an archaeologist and was known to have conned Darth Vader.\n\nA long time before, Doctor Chelli Lona Aphra with her protocol droid 0-0-0 met with Hondo Ohnaka to get a ship so they could find the Sword of Khashyun.\n\n",
        "section": "Sword of Khashyun[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 163.0
      }
    },
    {
      "id": "2835",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - A heist from the Temple of the Kyber[]\n\nSometime before, Hondo Ohnaka, Dok-Ondar and Quadoro broke into the tunnels of the Temple of the Kyber to steal a statue. They were stopped by a guardian who they quickly stunned. Quadoro questioned Captain Ohnaka on why he has to be in the front, to which he was quickly gunned down by more guardians. While Hondo continued to fight the guardians, Dok-Ondar located their target and began to admire the history of it. He felt that it brought him closer to his parents. Dok-Ondar used a laser torch to break off the statue from the rest of it's base but the lasers deflected off and shot to the ceiling which caused part of the ceiling to fall and take a guardian Hondo was fighting with it. Dok-Ondar used Ki-Adi-Mundi's lightsaber instead to break off the statue. After doing so, Hondo quickly grabbed the Ithorian and they made their way to the exit. They were stopped by another guardian, this one introduced himself as Chirrut Îmwe and refused to let them pass by. Hondo underestimated the blind man and started to shoot at him. Chirrut dodged the blaster fire and knocked out Hondo. Hondo got back up and started to duel Chirrut with his own staff. Dok-Ondar intervened and stated that this statue was a clue to figuring out the murder of his parents. Chirrut let them go and the two returned to the ship.\n\nAs they left they were spotted a Imperial starfighter who was on patrol. Hondo started to fly toward the Star Destroyer over head stating that the starfighters will not fire on their own ship. As he flew closer to the ship, he took off into hyperspace.\n\n",
        "section": "A heist from the Temple of the Kyber[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 384.0
      }
    },
    {
      "id": "3158",
      "title": "The Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 articles and stories",
          "Myths & Fables"
        ],
        "content": "# The Black Spire - Plot summary[]\n\nAccording to legend, long ago a family lived on Batuu. The father died during a supply run accident leaving his wife and four children to run a grain farm.\n\nOne day while the four children were playing by edge of the Surabat River Valley Anya's brother went missing. The girls searched for their brother until dusk but they could not find him. They eventually went home hoping that he was there but he was not. Anya's Mother had warn the children not to play by the valley but had not told them that it was because the slaver Sampa Grott would sometimes abduct people from the valley and put them to work. Knowing that her son was lost forever Anya's mother fell into despair.\n\nHowever the girls still had hope and the next morning Anya's oldest sister left for Black Spire Outpost armed with her late father's farming sickle to search for her brother. That night having not returned it seemed that the oldest sister had also be captured by the slavers and the mom fell deeper into despair. The next morning however the middle sister made the decision to leave to search for both her brother and sister. Leaving Anya to look after their mother the girl left armed with her late father's blaster. But that sister did not return. Anya not able to endure her mother's cries fled into the goods and began to sob.\n\nA robed man, having heard the crying and wishing to help, approached Anya in the woods. Initially afraid of the man, thinking he might be another slaver, Anya eventually told him how she lost her siblings. After hearing the tale the man encouraged Anya to go after her siblings believing she was the only one that could save them. Since Anya did not have a weapon the stranger fashioned a small wooden dagger from a fallen branch. After that the man disappeared into the woods.\n\nThe next morning Anya left for Black Spire Outpost armed with her dagger. Eventually while searching the Outpost Anya over heard a Gran and a Ithorian talking about Sampa Grott. The Gran has recently been tricked by Sampa and was about to head over to Sampa to confront him. Anya followed the Gran to the hidden junkyard, Sampa's Cradle. Once there she seeing that Sampa Grott was big brutal man that could not have been easily beaten in a fight Anya decided she had to come up with a more clever plan to save her siblings.\n\nAnya found Sampa's house and hid under his bed and waited for him to return home. After Sampa fell asleep Anya crept up and put her wooden dagger to his throat. Feeling the tip of the dagger, Sampa's eyes opened but did not move fearing that his throat would be cut. Anya having disguised her voice told Sampa that she was an assassin and was sent to kill him. Sampa begged for his life and Anya told him if she released the three children she would let him live. Sampa quickly agreed and Anya left the house and headed home. The next morning her bother and two sisters had both been returned. Sampa was rumored to have fled into Wild Space where his enemies couldn't find him.\n\n",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/The_Black_Spire",
        "title": "The Black Spire",
        "tokens": 660.0
      }
    },
    {
      "id": "3322",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Biography[]\n\nDok-Ondar was born into a family of gardeners and began his love of collecting and discovering bones, unusual rocks and other unusual things while helping his parents in the garden. Supportive and encouraging of his hobbies, his parents allowed him to develop trading and business skills to turn his collecting into a career. However, they were murdered under mysterious circumstances after stumbling upon archaeological secrets related to the Jedi and Sith\n\nIn 10 BBY, Dok-Ondar was present on First Light, the yacht operated by Crimson Dawn crime lord Dryden Vos, while Vos met with Tobias Beckett and Han Solo. Qi'ra, Vos' top lieutenant, wanted to ensure that Dok-Ondar was being well attended to.\n\nDok-Ondar later traveled to Jabba the Hutt's Palace on Tatooine and was in attendance when Jabba was berating Greedo for his failure to retrieve an important target on Mygeeto. Dok-Ondar would end up saving the Rodian bounty hunter's life when he offered to purchase Ki-Adi-Mundi's lightsaber, which Greedo had retrieved during the course of his failed mission and was unsuccessfully trying to barter to Jabba in exchange for his life, in addition to the dianoga puppy he'd been there to buy as well for double the price.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 280.0
      }
    },
    {
      "id": "3325",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Han Solo[]\n\nAt one point before the Battle of Yavin, Dok-Ondar, dealer of ancient antiquities stationed on Batuu, hired Solo to retrieve some infant sarlaccs from a famous holo scientific sarlacc keeper, Genzhor, on the planet I'vorcia Prime. When Solo arrived at the reserve, he found that Dr. Genzhor had been slain by his assistant, Ooris, when he pushed him into a pit of sarlaccs, and he was trying to scam him and attempted to steal his ship, the Millennium Falcon. After the events on I'vorcia Prime, Dok-Ondar was met again by Solo, returning the infant sarlacc. Dok-Ondar was dissatisfied with the results, due to there only being one, but Han lied and told him the reserve only had one.\n\n",
        "section": "Hiring Han Solo[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 183.0
      }
    },
    {
      "id": "3323",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Hondo Ohnaka[]\n\nDuring the newly-established Galactic Empire's occupation of Jedha, Dok-Ondar hired and accompanied Captain Hondo Ohnaka to retrieve a Kyber crystal statue from the Temple of the Kyber. Dok-Ondar, Ohnaka, and his protege Quadoro went into the temple. Inside they were confronted by several Guardians of the Whills. Despite the Guardians, Dok-Ondar was able to grab one of the statues by using Mundi's lightsaber to cut it out. As they made their way out, they were confronted by Chirrut Îmwe. Dok-Ondar was able to convince Îmwe to let them leave with the statue. He and Ohnaka were able to board their shuttle and make their way past the Empire's blockade.\n\n",
        "section": "Hiring Hondo Ohnaka[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 173.0
      }
    },
    {
      "id": "3327",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Hiring Doctor Aphra[]\n\nDuring the Galactic Civil War, Dok-Ondar hired some men and accompanied Dr. Chelli Lona Aphra and her crew to Moraband using his ship. Dok-Ondar went to Moraband retrieve the Sword of Khashyun from a Sith Temple. Dok-Ondar watched as Aphra and his muscle, a group of Shistavanens, went into the temple. When 0-0-0 attempted to kill him, Dok-Ondar and his last man ripped 0-0-0 apart. He confronted Aphra after she and BT-1 retrieved the sword. Dok-Ondar fired a EMP pulse at BT-1 and refused to let the sword go to her. Aphra refused to give him the sword and had BT-1 take out the last of his muscle. Dok-Ondar shot at Aphra and split the sword in half. As he tried to reclaim the sword, which was now stuck in the ground, he noticed 0-0-0 rebooting and decided to take what he could, claiming one half and leaving Aphra the other half. Dok-Ondar left her and her droids stranded on Moraband. He deeply regretted splitting the sword in half.\n\n",
        "section": "Hiring Doctor Aphra[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 264.0
      }
    },
    {
      "id": "3320",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar\n\nDok-Ondar\n\n\nBiographical information\n\nHomeworld\nIthor\n\n\n\nDescriptive information\n\nSpecies\nIthorian\n\n\nGender\nMale\n\n\nPronouns\nHe/Him\n\n\nHair color\nWhite\n\n\nEye color\nBlue\n\n\nSkin color\nBrown\n\n\n\nFamily information\n\nParent(s)\nDok-Ondar's fatherDok-Ondar's mother\n\n\n\nChronological & political information\n\nAffiliation(s)\nDok-Ondar's Den of Antiquities\n\n\n[Source]\n\nDok-Ondar was an Ithorian male collector who operated an antiquities shop in Black Spire Outpost on the planet Batuu on the edge of the Outer Rim Territories. According to a rumor, he was willing to trade any treasure as long as the price was right.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 164.0
      }
    },
    {
      "id": "3330",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Encountering Kendoh's crew[]\n\nAt one point, Remex Io, a Clawdite reunited with his crew led by female human Kendoh Voss, spoke with Dok-Ondar on Batuu, at Black Spire Outpost. Dok-Ondar was disappointed with how late the crew was, due to the First Order's arrival and Io needing to take a longer route through an alley. While there, the other member of Voss' crew, Wooro, noticed an infant sarlacc. Dok-Ondar told him the story of Solo smuggling them in from a reserve on I'vorcia Prime, but Voss immediately got to showing Dok-Ondar what she wants to sell him. When Dok-Ondar saw what was on the screen, a lightsaber, he asked them to leave immediately. His assistant asked him how that weapon could have been retrieved, and Dok-Ondar wanted to make sure it did not fall into the wrong hands.\n\nLater, the First Order arrived at Dok-Ondar's place to investigate the lightsaber that he owned. A stormtrooper sergeant threatened Dok-Ondar, saying all of his items could be reclassified as contraband and destroyed and also noting that owning a lightsaber could once again be a crime. When the stormtroopers left, Dok-Ondar noted to his assistant and translator Tohago that he planned to move the hilt of the sword to a safe location to prevent the First Order from discovering it.\n\nLater, Dok-Ondar sent his Clawdite enforcer Varg to intercept Io. Varg incapacitated Io and impersonated him to get on the inside of the Kendooh Gang. Then, Dok-Ondar listened in on a conversation between Voss and Hondo Ohnaka, who he was in league with. Voss revealed part of her plan to Ohnaka, trying to hire him as a pilot, unaware of his ties with Dok-Ondar. However, when Voss showed Ohnaka what the cargo was, the Sword of Khashyun, Dok-Ondar was furious to see Ohnaka reveal his knowledge of the sword to Voss.\n\nOhnaka made his way to Dok-Ondar to inform him of what he knew, but when he began to babble loudly in the street, Dok-Ondar angrily silenced him, warning him of the amount of spies in the area. Bringing him inside, Ohnaka told him what he knew, unaware that they were being spied on by a cam droid operated by the Kendoh Gang. Dok-Ondar explained the mission he and Aphra undertook on Moraband to Ohnaka, and when Ohnaka asked for more details, Dok-Ondar told him that they could talk more at the safe house, expressing his desire to move the hilt to Ohnaka's ship before it could be stolen. Just then, Voss and Wooro entered the den to steal the hilt. However, Dok-Ondar activated his primary security droid BK-86, but at the same time, a group of stormtroopers formed outside.\n\nThe stormtroopers entered, aiming their blasters at Dok-Ondar, Tohago, BK-86, Voss, and Wooro. After the stormtroopers beat Wooro and hit Voss on the chin with a blaster, they questioned Voss about her intentions on Batuu, believing her to be with the Resistance. Then, Voss improvised, eventually passing off the hilt to Wooro, who would unknowingly give it to Varg, thinking he was Io. Varg returned the hilt to Dok-Ondar, who then contacted Voss via hologram to reveal he was the benefactor that had hired them. Dok-Ondar told them that he could not afford to let them sell the blade and instead tried to unite the two pieces. As he succeeded in doing so, he told the crew that their payment was leaving the planet safely, saying he gave the First Order an anonymous tip regarding their location that would give them enough time to escape.\n\n",
        "section": "Encountering Kendoh's crew[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 856.0
      }
    },
    {
      "id": "3332",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Personality and traits[]\n\nDok-Ondar was known for being a bit temperamental, yet he was willing to sell good stuff to his customers if they did the right deals with him. Dok's reputation on Batuu and beyond made him a respected and often feared figure within the black market and collecting community. Anyone who dared try and cheat on him would be put on his enemies list, referred to as the \"Doklist\" by locals, and find themselves the target of bounty hunters. Dok-Ondar also found himself in the position of an unofficial banker for Black Spire Outpost and worked with Oga Garra to keep track of debts owed to the both of them, with Oga's crew helping enforce these debts.\n\n",
        "section": "Personality and traits[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 155.0
      }
    },
    {
      "id": "3422",
      "title": "Star Wars: Tales from the Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles in need of cleanup",
          "Articles with an excess of redlinks",
          "7 more",
          "Articles with multiple issues",
          "2020 releases",
          "Incomplete Credits",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge - The Temple of Doom[]\n\nAfter returning to Seezelslak's Cantina, The Droid Repair Tech gave Seezelslak the right ingredients to make a drink, and while enjoying the drink, Seezelslak told them a tale. He said that long before the Clone Wars, the Jedi set up a temple to research dark artifacts on Batuu. One day, Jedi Master Sylwin and her padawan, Ady Sun'Zee found one of these Dark Relic, and brought it back to the Temple for research. But the relic was powerful, and turned them all against each other. Master Sylein put up a fight, but was lost. Ady hit the distress beacon to warn the council, and blacked out. When she came to, she was in the Temple, and was being attacked by Demlins that were corrupted by the artifact. She held her own, using her Lightsaber Master Yoda appears. He had gotten wind of the distress beacon, and had come to help. Master Yoda said that it had been three days since the distress call was sent. Yoda then went alone to contain the relic. Despite Master Yoda's Orders, Ady followed him into the Temple. The security system in the Temple activated, and Ady battled more demlins, and security droids, and when finished, Ady resumed her search for the Artifact. She found a fake version, and when she touched it, it glowed red, and created vines all over the Temple. Ady used her lightsaber to cut her way through, until she found the real artifact. Ady grabbed it, and heard master Sylwins voice telling her that she would never be a Jedi. Ady cut her way through more vines, until she arrives in a room with master Yoda calmly, sitting down. Master Yoda tells her that it was her fault, and under the influence of the artifact, she killed everyone in the Temple. Demlins then emerged from the floor, and dragged Master Yoda down into a Chasm, while Ady's lightsaber failed to work. The walls were ripped away to reveal a swirling storm of red clouds and rock. Ady fought more and more demlins, until she heard Master Yoda's voice telling her that her weapon was not needed. Ady placed her Lightsaber on the glowing white pedestal, and everything went black. Ady woke up to Master Yoda using The Force to fight against the artifact, and she saw he was being overpowered. Yoda asked Ady for help, and together, they contained the artifact. Yoda sealed of the Temple, and reassured Ady that she can fight the Darkness within her. Seezelslak then finished his tale by saying that Ady hid the keys to the Temple somewhere on Batuu.\n\n",
        "section": "The Temple of Doom[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
        "title": "Star Wars: Tales from the Galaxy's Edge",
        "tokens": 593.0
      }
    },
    {
      "id": "3621",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Headgear[]\n\nA-wing flight helmet\nAlderaanian consular security helmet\nAT-AT pilot helmet\nB-wing flight helmet\nClone trooper helmet (Phase I)\nCoastal defender stormtrooper helmet\nCold-weather Soldier headgear\nEmperor's Royal Guard helmet\nEndor strike team helmet\nEtched mask\nEzra Bridger's Scout trooper helmet\nFemale Tusken Raider hoods \nImperial combat assault tank pilot helmets\nImperial Navy Trooper helmet\nImperial officer battle armor helmet\nJedi youngling helmets\nK-22995 light flight helmets\nKaleesh Erkush mask\nMandalorian helmet\nSeventh Sister's helmet\nStormtrooper helmets\nTIE fighter pilot helmet\nU-wing flight helmet\nUbese helmet\nY-wing flight helmets\n\n",
        "section": "Headgear[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 180.0
      }
    },
    {
      "id": "3607",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities\n\nDok-Ondar's Den of Antiquities\n\n\nGeneral information\n\nLocation\nMerchant Row, Black Spire Outpost, Batuu\n\n\n[Source]\n\nDok-Ondar's Den of Antiquities was located in Black Spire Outpost on the planet Batuu. Its proprietor was the Ithorian collector Dok-Ondar.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 82.0
      }
    },
    {
      "id": "3636",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Behind the scenes[]\n\nDok-Ondar's Den of Antiquities is one of the gift shops at Star Wars: Galaxy's Edge, found at both Disneyland and Disney's Hollywood Studios. It specializes in high-end collectibles related to Jedi and Sith lore such as statues, historic lightsabers, and holocrons. The popular series of replica lightsaber hilts of well-known characters, known as Legacy Lightsabers, can be purchased at Dok-Ondar's.\n\nBy the end of May, 2024, the five-year anniversary of Galaxy's Edge, 32 Legacy Lightsaber hilts had been released and sold at Dok-Ondar's.\n\nAn animatronic of Ondar can also be found in the shop, with cast-member attendants interacting with him.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 173.0
      }
    },
    {
      "id": "3615",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Miscellaneous items in collection[]\n\nAdvozse skull\nBandfill\nBlack Sun banner\nBust of Darth Sidious\nBust of Maul\nBust of Plo Koon\nBust of Shaak Ti\nBust of Yaddle\nBust of a Gungan\nBust of a Togruta\nChindinkalu flute\nDesilijic banner\nDiagnostech life support units\nDorenian Beshniquel\nDouble jocimer\nDuros skull\nFour Sages of Dwartii statues\nGreat Sith Wars Bas-Relief\nHolocrons\nHumanoid skull\nKalikori\nKloo horn\nKyber crystals\nMandalorian banner\nMedal of Bravery\nNaboo Palace Guard uniform\nNe Ganna Dateel Jabba\nOmmni box\nSeven-string hallikset\nSith Chalice replica\nStylized Starbird banners\nTemple of the Kyber, kyber crystal statue\nTognath skull\nTransparent Documents\nTusken Raider banner\nUpside-down ancient navi-computer dataplaque\nUrn containing ashes of a blue snaggletooth\nX-wing starfighter sculpture\nZ-6 jetpack\n\n",
        "section": "Miscellaneous items in collection[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 265.0
      }
    },
    {
      "id": "3630",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Items not on display[]\n\nBedlam relic\nDancing Goddess\nOne of The Grand Inquisitor's lightsabers (sold to Karr Nuq Sin)\nJedi Master Ki-Adi-Mundi's lightsaber\nJedi Temple Guard's helmet\nSith scroll\nTwi'lek Ark (stolen by Edmo Ectacle)\nWED Treadwell repair droid\n\n",
        "section": "Items not on display[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 94.0
      }
    },
    {
      "id": "3612",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Description[]\n\nDok-Ondar was an avid collector of antiques and any other oddities that would interest him, including weapons, armor, animals, plants, droids, and even remains of sentient beings. He amassed his vast collection in his travels and with the aid of his employees, scavengers, mercenaries, bounty hunters, and any others who were willing to take on his quests. His expansive collection of antiquities and valuables made his store resemble a small museum with buyable treasures.\n\nOutside of the store, Dok-Ondar displayed a bust of Jedi, a statue of a Jedi Consular resembling one formerly located at the Jedi Temple, and a large stone foot. He also had an Ithorian gravestone dedicated to his father and mother.\n\n",
        "section": "Description[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 166.0
      }
    },
    {
      "id": "3624",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Weapons[]\n\nA-180 blaster\nAmban phase-pulse blaster\nBD-1 Cutter vibro-axs\nDefender sporting blaster pistol\nDL-44 heavy blaster pistol\nDLT-19D heavy blaster rifles\nE-11 medium blaster rifle\nE-11D blaster carbines\nEC-17 hold-out blaster\nELG-3A blaster pistol\nGaderffii sticks\nGamorrean battle-axes\nGlie-44 blaster pistol\nMunit'kad halberd\nRelby-v10 micro grenade launcher\nRyyk blades\nSE-14r light repeating blaster\nSword of Khashyun\nWESTAR-34 blaster pistol\nWookiee Klorri-clan battle shield\n\n",
        "section": "Weapons[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 175.0
      }
    },
    {
      "id": "3618",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Droids[]\n\nBK-86\n\n",
        "section": "Droids[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 20.0
      }
    },
    {
      "id": "3617",
      "title": "Dok-Ondar's Den of Antiquities",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Dok-Ondar's Den of Antiquities - Creatures and plants[]\n\nAnooba (mounted)\nCave sketto (stuffed)\nCoppergrin (mounted)\nCorellian hound (mounted)\nDianoga (juvenile)\nFelucian fireflies\nFelucian plants\nKod'yok (mounted)\nMythosaur skull\nNaboo plants\nNexu (mounted)\nOllopom\nProfrogg (stuffed)\nSimpi (Sarlacc juvenile)\nTauntaun (mounted)\nWampa (stuffed)\nWomp rat (stuffed)\n\n",
        "section": "Creatures and plants[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar%27s_Den_of_Antiquities",
        "title": "Dok-Ondar's Den of Antiquities",
        "tokens": 125.0
      }
    },
    {
      "id": "3845",
      "title": "Sentience",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Incomplete lists",
          "2 more",
          "Biological phenomena",
          "Society and culture"
        ],
        "content": "# Sentience - Sentience and the Force[]\n\nWith his sentience, Darth Sidious manipulated unwitting senators of the Galactic Senate such as Jar Jar Binks to grant him supreme authority, although by the will of the Force, Sidious was deposed by the son of the Chosen One, who was conceived by the midi-chlorians—organisms that formed a symbiotic relationship with organic beings and communicated to them the Force's will; the foundation of life and what connects and maintains the symbiotic relationship between the Living Force—the energy of all life—and the Cosmic Force, which bound all things in the galaxy.\n\n",
        "section": "Sentience and the Force[]",
        "source": "https://starwars.fandom.com/wiki/Sentience",
        "title": "Sentience",
        "tokens": 124.0
      }
    },
    {
      "id": "4752",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - High Republic era[]\n\nDuring the High Republic Era, the Jedi Order built a Jedi temple near Black Spire Outpost.\n\nBetween 233 BBY and 232 BBY, Jedi Initiates Kai Brightstar, Lys Solay, and Nubs of the Tenoo Jedi Temple traveled to Black Spire Outpost with Jedi Padawan Celesta Kami of the Batuu Jedi Temple. While in search of tools to purchase for Kami's master, Carver Drow, the group found property developer Ozon Nimbee presenting to Black Spire residents on potential developments. Nimbee sought to construct buildings with unobstructed views of the Batuuan skies, which would necessitate cutting down very spires central to the outpost's identity. Despite of the refusal of the outpost residents, Nimbee tested using sabotage droids to cut down several spires near the outpost. The Jedi, witnessing the test, confronted Nimbee, who was berated by the townsfolk. Believing the only way to get buy-in for his plans was to cut down the spires within the outpost without permission, Nimbee released a swarm of his buzz droids on Black Spire Outpost. The Jedi and townsfolk fought the swarm of droids, destroying many of them. Soon, Drow arrived to destroy several more with his lightsaber and the Force. One droid, however, escaped notice before completely transecting the spire overlooking the milk stand. As the upper portion of the enormous spire fell, the Jedi used the Force to prevent it from crushing the milk stand and set it gently on the ground nearby. At some point, the fallen spire was placed upon its base once more, leaving behind the evidence of the clean cut. Following the defeat of Nimbee, Drow decided to promote relations with the local residents.\n\nTo foster friendly relations with the residents of Black Spire Outpost, the Jedi hosted at least two public training days outside the Temple. During a later visit to Batuu, Brightstar duelled with Master Drow during a public training day but experienced fears and doubts. At the advice of Drow, Brightstar later retreated to a cave where he experienced Force visions which helped him to overcome his doubts and insecurity. Following a second public training day, local girl Sadie Bolter stole Lys's lightsaber in order to overcome her own insecurities. However, the lightsaber was stolen by the local bully Pak Relda. Seeking to make amends with Solay and her friends, Bolter helped the Jedi to recover Lys's lightsaber and defeated Relda in a sword duel.\n\nLater, the Jedi Order abandoned the Batuu Jedi Temple after the facility was contaminated by an ancient Sith runestone, that claimed the lives of several Jedi including Master Sylwin. The sole survivor was Padawan Ady Sun'Zee. In response Master Yoda sealed the Batuu Temple with The Force, declaring it lost.\n\n",
        "section": "High Republic era[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 601.0
      }
    },
    {
      "id": "4769",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - First Order era[]\n\nIn 34 ABY, the outpost attracted beings who sought to avoid the expanding reaches of the First Order and its conflict with the Resistance, which had erupted into a war. One such being was the Weequay smuggler Hondo Ohnaka, who brought the modified YT-1300 light freighter named the Millennium Falcon to the outpost and established Ohnaka Transport Solutions, a shipping company that was a front for his smuggling operations. Based out of Docking Bay 5, the company frequently recruited flight crew members among the outpost's new arrivals.\n\nThe human mercenary Bazine Netal had been hired to search for the Millennium Falcon and purchase it from whomever had it in their possession. At Oga's Cantina, the smuggler told her stories of his history with the ship to stall for time as a Yarkoran sabacc player secretly contacted Mahjo Reeloo, who owed Ohnaka a favor after an incident in the Undervaults of Gwongdeen. Netal paid Ohnaka for the Falcon and delivered it to Beixander 9, where Reeloo posed as Netal's contact to accept delivery of the ship before returning it to the outpost. Ohnaka notified Chewbacca, a Wookiee and the ship's former co-pilot, that the Falcon was safe from Netal's employers. Though Ohnaka continued to use it for his business, he also expressed certainty that the ship would continue to aid \"the good guys.\"\n\nAncient ruins just outside of the outpost housed a Resistance base around that same time. Eventually, Supreme Leader Kylo Ren arrived at the outpost and took command of the First Order garrison, having learned that Rey was with a group of Resistance fugitives on Batuu. A battle between the factions took place in the outpost and above the planet.\n\n",
        "section": "First Order era[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 386.0
      }
    },
    {
      "id": "4859",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Plot summary[]\n\nMoradi pretends to get captured and is again interrogated by Kath. She manipulates Kath's pride to start a boxing match, allowing Kriki to get on board to program the ship to send a message that the Resistance is no longer on Batuu before the ship self destructs. Meanwhile, Dolin is met by Ylena who brings blasters from Savi's, and by many young people from his settlement who decided to join the cause after the First Order killed two villagers. When Dolin is signaled, the group rushes the transport to further distract Kath and his troops while Kriki works inside the transport; however, they only take down a few while incurring heavy losses as they are not trained soldiers. Just when everything seems lost, a man in red-painted stormtrooper's armor and a black cape emerges from the clearing. It is Archex dressed as his former identity, Captain Cardinal.\n\nArchex offers himself as Kath's prisoner, knowing Kath will not leave the planet unless he has something to give his superiors. Kriki has succeeded; after the ship departs with Kath and Archex on board, the message is sent and the ship explodes. A week later, a fully-recovered Moradi meets with Garra, who provides Moradi with a long range comms array as thanks for getting rid of the First Order. Moradi notified Organa that the base has been established and she can start using it as a fleet waypoint.\n\nSeveral weeks later, Moradi is training her many new recruits when she receives an alert from the Resistance that Kylo Ren and the 709th Legion are en route. She looks up to see a star destroyer entering the atmosphere, and tells her recruits that it is time to fight.",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 367.0
      }
    },
    {
      "id": "4855",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Plot summary[]\n\nOn D'Qar, Vi Moradi is still recovering physically and psychologically from her interrogation on the Absolution by Captain Cardinal, whom she rescued after his near-fatal confrontation with Phasma. Before General Leia Organa leaves for Takodana, she gives Vi Moradi a new mission: to establish a new Resistance outpost on the planet Moradi has identified, and to bring Archex—the former Cardinal—to assist her. Before Moradi can depart for Batuu the next day, Organa transmits an announcement that Hosnian Prime and the Hosnian system have been destroyed by the First Order. Moradi's mission is put on hold.\n\nFour months after the Battle of Crait, Moradi's mission is back on. Alongside the PK-Ultra worker droid Pook, she picks up Archex from his enforced healing retreat on Cerea and they journey to Batuu. Their starship is caught in a skirmish between two smuggler ships upon arrival and they are forced to crash land in the forest. While unconscious, their ship is ransacked by the crew of the local crime boss, Oga Garra. A local Batuuan woman, Salju, find them and offers assistance. She gives Moradi a tour of Black Spire Outpost and gets her a job at Savi & Son Salvage to earn money to buy back her own equipment to establish a Resistance base. Through her new work, Moradi meets Ylena and Savi's Gatherers, but fails to recruit them to the Resistance. Due to limited mobility resulting from wounds inflicted by Phasma, Archex must remain hidden in the forest, leaving him feeling useless.\n\nMoradi is taken by one of Garra's enforcers to meet the crime boss within her cantina. Garra tells her that if she locates an artifact within the ruins and brings it back to Garra, Moradi can have her property back. Moradi secures Garra's agreement that the Resistance may also use the ruins as a base. Meanwhile, the First Order is alerted to the Resistance presence on Batuu, and General Hux dispatches Lieutenant Wulfgar Kath and twenty stormtroopers to inspect the world. Kath has a vendetta against Moradi and Archex after failing to prevent their escape from the Absolution.\n\nGarra offers to tell Kath of the Resistance if Kath brings her the artifact in the ruins. Kath and two troopers enter the ruins, following Moradi as she negotiates the ancient security measures. Two troopers are downed by Vi, though the latter becomes poisoned. Moradi is rescued by a farm boy named Dolin and his truffleboar Waba. Dolin brings him to his grandmother Grana and they nurse her back to health, but when Moradi persuades Dolin to join the Resistance, Grana rejects her grandson.\n\nMoradi gives the artifact to Garra and regains most of her property except her long range comm array, which is what she needs most to update General Organa of her situation. The next day, Moradi goes into town to buy a comm array and defends a Chadra-Fan named Kriki who is being mistreated by her employer. Kriki chooses to join the Resistance, helping Moradi with her errands and fixing up the new base within the ruins, the layout of which is being planned by Archex. Later on, Moradi recruits a drunken but charismatic loudmouth named Zade Kalliday, who helps manage the recruitment of Resistance personnel. Soon after, while Moradi is picking up lunch, she witnesses stormtroopers harassing two old women seeking information on Moradi. When she defends the women, she is overwhelmed by the two troopers, who take her prisoner.\n\nAfter undergoing torture by Kath, Moradi is rescued by her new companions. By then, multiple stormtroopers have been killed, leaving only twelve. Moradi and her three recruits make a plan to get the First Order to leave Batuu despite being outnumbered. She uses a stolen First Order comm link to tap into their network and send out a message to the Resistance, requesting that Organa send supplies and personnel, but Organa informs her that none are available and she has faith in Moradi. Dolin also goes back to his village to recruit for the upcoming attack, but his grandmother disowns him. Having no other options, the group proceeds with their plan.\n\nMoradi pretends to get captured and is again interrogated by Kath. She manipulates Kath's pride to start a boxing match, allowing Kriki to get on board to program the ship to send a message that the Resistance is no longer on Batuu before the ship self destructs. Meanwhile, Dolin is met by Ylena who brings blasters from Savi's, and by many young people from his settlement who decided to join the cause after the First Order killed two villagers. When Dolin is signaled, the group rushes the transport to further distract Kath and his troops while Kriki works inside the transport; however, they only take down a few while incurring heavy losses as they are not trained soldiers. Just when everything seems lost, a man in red-painted stormtrooper's armor and a black cape emerges from the clearing. It is Archex dressed as his former identity, Captain Cardinal.\n\nArchex offers himself as Kath's prisoner, knowing Kath will not leave the planet unless he has something to give his superiors. Kriki has succeeded; after the ship departs with Kath and Archex on board, the message is sent and the ship explodes. A week later, a fully-recovered Moradi meets with Garra, who provides Moradi with a long range comms array as thanks for getting rid of the First Order. Moradi notified Organa that the base has been established and she can start using it as a fleet waypoint.\n\nSeveral weeks later, Moradi is training her many new recruits when she receives an alert from the Resistance that Kylo Ren and the 709th Legion are en route. She looks up to see a star destroyer entering the atmosphere, and tells her recruits that it is time to fight.\n\n",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 1264.0
      }
    },
    {
      "id": "4857",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Plot summary[]\n\nOn D'Qar, Vi Moradi is still recovering physically and psychologically from her interrogation on the Absolution by Captain Cardinal, whom she rescued after his near-fatal confrontation with Phasma. Before General Leia Organa leaves for Takodana, she gives Vi Moradi a new mission: to establish a new Resistance outpost on the planet Moradi has identified, and to bring Archex—the former Cardinal—to assist her. Before Moradi can depart for Batuu the next day, Organa transmits an announcement that Hosnian Prime and the Hosnian system have been destroyed by the First Order. Moradi's mission is put on hold.\n\nFour months after the Battle of Crait, Moradi's mission is back on. Alongside the PK-Ultra worker droid Pook, she picks up Archex from his enforced healing retreat on Cerea and they journey to Batuu. Their starship is caught in a skirmish between two smuggler ships upon arrival and they are forced to crash land in the forest. While unconscious, their ship is ransacked by the crew of the local crime boss, Oga Garra. A local Batuuan woman, Salju, find them and offers assistance. She gives Moradi a tour of Black Spire Outpost and gets her a job at Savi & Son Salvage to earn money to buy back her own equipment to establish a Resistance base. Through her new work, Moradi meets Ylena and Savi's Gatherers, but fails to recruit them to the Resistance. Due to limited mobility resulting from wounds inflicted by Phasma, Archex must remain hidden in the forest, leaving him feeling useless.\n\nMoradi is taken by one of Garra's enforcers to meet the crime boss within her cantina. Garra tells her that if she locates an artifact within the ruins and brings it back to Garra, Moradi can have her property back. Moradi secures Garra's agreement that the Resistance may also use the ruins as a base. Meanwhile, the First Order is alerted to the Resistance presence on Batuu, and General Hux dispatches Lieutenant Wulfgar Kath and twenty stormtroopers to inspect the world. Kath has a vendetta against Moradi and Archex after failing to prevent their escape from the Absolution.\n\nGarra offers to tell Kath of the Resistance if Kath brings her the artifact in the ruins. Kath and two troopers enter the ruins, following Moradi as she negotiates the ancient security measures. Two troopers are downed by Vi, though the latter becomes poisoned. Moradi is rescued by a farm boy named Dolin and his truffleboar Waba. Dolin brings him to his grandmother Grana and they nurse her back to health, but when Moradi persuades Dolin to join the Resistance, Grana rejects her grandson.\n\nMoradi gives the artifact to Garra and regains most of her property except her long range comm array, which is what she needs most to update General Organa of her situation. The next day, Moradi goes into town to buy a comm array and defends a Chadra-Fan named Kriki who is being mistreated by her employer. Kriki chooses to join the Resistance, helping Moradi with her errands and fixing up the new base within the ruins, the layout of which is being planned by Archex. Later on, Moradi recruits a drunken but charismatic loudmouth named Zade Kalliday, who helps manage the recruitment of Resistance personnel. Soon after, while Moradi is picking up lunch, she witnesses stormtroopers harassing two old women seeking information on Moradi. When she defends the women, she is overwhelmed by the two troopers, who take her prisoner.\n\nAfter undergoing torture by Kath, Moradi is rescued by her new companions. By then, multiple stormtroopers have been killed, leaving only twelve. Moradi and her three recruits make a plan to get the First Order to leave Batuu despite being outnumbered. She uses a stolen First Order comm link to tap into their network and send out a message to the Resistance, requesting that Organa send supplies and personnel, but Organa informs her that none are available and she has faith in Moradi. Dolin also goes back to his village to recruit for the upcoming attack, but his grandmother disowns him. Having no other options, the group proceeds with their plan.",
        "section": "Plot summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 910.0
      }
    },
    {
      "id": "5824",
      "title": "Batuu Jedi temple",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu locations",
          "Jedi temples"
        ],
        "content": "# Batuu Jedi temple - Layout[]\n\nEstablished along the Galactic Frontier in the Trilon sector, the Batuu Jedi temple was set up as a research facility for the Jedi Order, not far from Black Spire Outpost. Located within a forest punctuated by the petrified trunks of enormous trees, the Temple itself was a large facility with several large towers of white stone. The main body of the Temple was a large, blocky building with two short wings protruding on either side of the building. One end of the main structure was surrounded by several small towers buttressing its walls. On either side of the Temple were two tall towers that were capped by a domed roof that bulged out just below the peak. A larger central spire erupted from the center of the Temple, the pinnacle of which resembled the three-finned crown of the Grand Jedi Temple on Coruscant.\n\nThe interior of the Temple was austere and sparse, with large open rooms connected by pillared halls. The Temple's main hall, constructed of white stone, contained a large statue of a Jedi surrounded by doors that opened onto exterior balconies. Just off the hall was a chamber which housed several artifacts, including an ancient Sith Runestone which was permeated by the dark side of the Force. An Archives, located in a small rotunda, contained a wealth of journals and holobooks just off of a large main hall. Down a winding set of stairs was a specialized containment room equipped with electrical nodes and a scaleable control floor and observation portal. A large, circular lecture hall with a circular speaker's pit ringed by benches was the crosspoint of a number of corridors near the artifact containment rooms. A metal dome over the speaker's pit denoted astronomical bodies, with a replica of the planet Batuu sitting at the center of the hall.\n\n",
        "section": "Layout[]",
        "source": "https://starwars.fandom.com/wiki/Batuu_Jedi_temple",
        "title": "Batuu Jedi temple",
        "tokens": 373.0
      }
    },
    {
      "id": "5830",
      "title": "Batuu Jedi temple",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu locations",
          "Jedi temples"
        ],
        "content": "# Batuu Jedi temple - Temple of Darkness[]\n\nBetween 233 BBY and 232 BBY, Jedi Master Carver Drow and his Padawan Celesta Kami resided at the Temple and hosted Jedi Initiates Kai Brightstar, Lys Solay and Nubs. Solay noted that the stately, stony complex of white towers was different from the Tenoo Jedi Temple, which had a giant Tenoo tree. To foster friendly relations with the local residents of Black Spire Outpost, the Jedi hosted several public training days outside the Temple.\n\nDuring the High Republic Era, Jedi Master Sylwin worked within the Temple with several other Jedi, including her Padawan Ady Sun'Zee. During the Jedi's study of an ancient Sith Runestone delivered to the Temple by Jedi Master Cohmac Vitus, the dark side energies that inhabited the crystal were unleashed and corrupted the Temple and Sylwin and the other Jedi succumbed to the whispers in their minds. Before succumbing to unconsciousness, Sun'Zee was able to activate the Temple's distress beacon and signal the Jedi High Council that the Temple was in trouble. When Sun'Zee awoke three days later, she was attacked by demlins, native creatures that had been corrupted and made feral by the runestone's influence from deep in the Temple. Unable to remember what happened, Sun'Zee was relieved when Grand Master Yoda arrived in response to the signal. Entering the Temple, the Jedi found it filled with ominous dark vines emanating from the runestone. Fighting through the corruption and the Temple's security systems, together Sun'Zee and Master Yoda were able to contain the darkness back inside the rhinestone's casing. While Sun'Zee had been convinced that she had killed the other Jedi at the Temple, Master Yoda assured her that it was an illusion create by the artifact, and that Sun'Zee's ability to resist it made her worthy of knighthood. Sealing the Temple with the Force, Yoda declared the Temple lost, and he and Sun'Zee returned to Coruscant.\n\n",
        "section": "Temple of Darkness[]",
        "source": "https://starwars.fandom.com/wiki/Batuu_Jedi_temple",
        "title": "Batuu Jedi temple",
        "tokens": 434.0
      }
    },
    {
      "id": "5833",
      "title": "Batuu Jedi temple",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu locations",
          "Jedi temples"
        ],
        "content": "# Batuu Jedi temple - A Relic in the Ruins[]\n\nIn 34 ABY, a Jedi artifact, known as the Mural of the Light was located by Deek in an archaeological site in the ruins of Sardeevem Chasm. While Deek believed it to hold historic value, antique dealer Dok-Ondar knew that the mural actually was a key to locating the treasure vaults in the lost Jedi Temple and hired a treasure hunter to retrieve the key for him. While Deek believed they were in danger, the Listehol Baron Yasto Attsmun, a band of pirates trailing behind him, and an independent hunter Lens Kamo all competed to find the cipher and the vault. Searching the Chasm for Deek and the cipher, it was soon revealed that Deek had indeed been killed after hiding the relic to prevent it from being sold on the black market. Searching further through the Chasm's excavation site, Dok-Ondar's hunter found where the Mural of the Light had been located before Deek had carved it from the wall. Continuing on, the hunter located a band of pirates trying to load the relic for transport and sale. Defeating the pirates and scanning the cipher, the hunter returned to Dok-Ondar's only to discover that the mural was only part of the cipher. Setting out to search the Cavern of the Moons for the rest of the cipher, the hunter located a stone altar dedicated to the Convergence of the Moons, which hid an ancient and secret vault more recently used by Deek to hide his treasures. Deep within the cavern's subterranean chambers, the hunter located a site that was adorned with Jedi murals depicting a mysterious ritual. Scanning the cipher embedded int he mural, the hunter was able to transmit their findings to Dok-Ondar for analysis.\n\nOnce deciphered, the key revealed the locations of the Temple ruins, and Dok-Ondar was able to surmise the existence of the ancient Sith Runestone left there by Master Yoda and Padawan Sun'Zee. Entering the Temple's lower levels, the hunter found it set with booby-traps laid by Lens Kamo. Evading the traps, the hunter eventually joined Kamo in infiltrating the vault, taking the runestone, and evading the defense droids sent out by Baron Attsmun. Eventually the pair were detained by the Baron's droids in one of the Temple's halls and Attsmun unleashed Kamo's former partner Ayuu, who had been cybernetically altered into a raging brute, against them. Ayuu smashed through the Temple's ancient foundations, sending the group tumbling into the caverns below. After Ayuu turned on the Baron and smashed his head in, the three treasure hunters escaped the ruins of the ancient Jedi Temple alive.\n\n",
        "section": "A Relic in the Ruins[]",
        "source": "https://starwars.fandom.com/wiki/Batuu_Jedi_temple",
        "title": "Batuu Jedi temple",
        "tokens": 575.0
      }
    },
    {
      "id": "5937",
      "title": "Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Locations in grid square G-15",
          "8 more",
          "Arboreal planets",
          "Batuu locations",
          "First Order planets",
          "Jedi planets",
          "Rocky planets",
          "Shadowports",
          "Trilon sector planets",
          "Western Reaches planets"
        ],
        "content": "# Batuu - High Republic Era[]\n\nDuring the High Republic Era, the Jedi Order maintained a Jedi temple on Batuu. Between 233 BBY and 232 BBY, Jedi Master Carver Drow and his Padawan Celesta Kami resided at the Temple and hosted Jedi younglings Kai Brightstar, Lys Solay and Nubs. During their visit, the younglings helped Kami foil a get rich scheme by the unscrupulous businessman Ozon Nimbee to cut Black Spire's spires to redevelop the town. To foster friendly relations with the local residents of Black Spire Outpost, the Jedi hosted several public training days outside the Temple. During a later visit to Batuu, Brightstar experienced visions inside a cave that helped him overcome his fears and doubts. On another visit, local girl Sadie Bolter stole Lys's lightsaber but later helped her reclaim it from the local bully Pak Relda.\n\nA model of security droid helped the Jedi at the Batuu Jedi temple. In the temple, the Jedi took to studying an ancient Sith Runestone, which began an incident. Sylvestri Yarrow and her crew came to owe a debt, which was hard for them to pay off, on Batuu.\n\n",
        "section": "High Republic Era[]",
        "source": "https://starwars.fandom.com/wiki/Batuu",
        "title": "Batuu",
        "tokens": 255.0
      }
    },
    {
      "id": "5980",
      "title": "Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Locations in grid square G-15",
          "8 more",
          "Arboreal planets",
          "Batuu locations",
          "First Order planets",
          "Jedi planets",
          "Rocky planets",
          "Shadowports",
          "Trilon sector planets",
          "Western Reaches planets"
        ],
        "content": "# Batuu - The First Order and the Resistance[]\n\nSoon the notorious Kendoh Gang arrived in Black Spire Outpost with the intent of stealing the hilt of the Sword of Khashyun from Dok-Ondar. The group already possessed the blade and was intent on cashing in with their anonymous benefactor by assembling the completed sword. During their time there, the First Order put out an arrest warrant for Remex Io, the crew's Clawdite member. Dok-Ondar's fixer, Varg, had notified the First Order of Io's presence, and Io was confronted by stormtroopers. He fled into the market and was pursued by the troopers, resulting in the death of a nearby civilian. After losing sight of Io, the stormtroopers were informed by a local, who was actually Io using his natural shape-shifting abilities, that their target was running toward the spaceport. Varg then caught Io himself, incapacitating him and then using his own shapeshifting powers to impersonate him and join up with Kendoh Voss and Wooro at Oga's Cantina. Voss spoke with Hondo Ohnaka, a former pirate captain who ran Ohnaka Transport Solutions, about their heist, unaware Ohnaka was in league with Dok-Ondar.\n\nOhnaka eventually reported back to Dok-Ondar but was spied on by a cam droid operated by the Kendoh Gang. When Voss and Wooro moved to steal the hilt, a group of stormtroopers surrounded the would-be thieves as well as Dok-Ondar, all of whom the First Order thought had possible ties to the rise in Resistance activity in the area. When the First Order inquired about Voss' activities, the gangster knocked over a kyber statue, which deflected the blaster fire aimed at her. Voss escalated the chaos by unleashing a baby sarlacc and using the opportunity to pass Wooro the hilt. However, Wooro would give the hilt to Io, who was actually Varg. The group escaped the First Order but soon realized that they had been tricked. Wooro found Io back at the ship and realized the hilt had been stolen back. Dok-Ondar then contacted Voss via hologram, saying that he had been the anonymous benefactor and told them that their payment was a favor he did for them, which was to trick the First Order into pursuing an anonymous lead that would give them time to escape.\n\nDuring the First Order's occupation, stormtroopers frequently patrolled the outpost as they stayed alert to signs of the Resistance.",
        "section": "The First Order and the Resistance[]",
        "source": "https://starwars.fandom.com/wiki/Batuu",
        "title": "Batuu",
        "tokens": 542.0
      }
    },
    {
      "id": "6971",
      "title": "Hover-cruise",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Comprehensive articles",
          "Entertainment"
        ],
        "content": "# Hover-cruise\n\nA hover-cruise was a relaxing recreational activity that beings could participate in. While on the supertanker fuel depot Colossus in 34 ABY, ace pilot Torra Doza became increasingly displeased with being confined to her quarters due to the First Order presence on the platform. After expressing these feelings to her pet voorpak, Buggles, Doza left to see if her father, the Colossus's Captain Imanuel Doza, would take her on a hover-cruise. However, the captain refused and insisted his daughter stay in her quarters, promising they would go on a hover-cruise only after the First Order had departed.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Hover-cruise",
        "title": "Hover-cruise",
        "tokens": 137.0
      }
    },
    {
      "id": "8411",
      "title": "Zan Yant",
      "metadata": {
        "categories": [
          "Legends articles",
          "Galactic Republic military personnel",
          "Healers and doctors",
          "4 more",
          "Males",
          "Musicians",
          "Talusians",
          "Zabrak"
        ],
        "content": "# Zan Yant\n\nZan Yant\n\n\nBiographical information\n\nHomeworld\nTalus\n\n\nDied\n20 BBY (15:5 GrS), Drongar\n\n\n\nDescriptive information\n\nSpecies\nZabrak\n\n\nGender\nMale\n\n\nHair color\nBlack\n\n\nSkin color\nTan\n\n\n\nChronological & political information\n\nAffiliation(s)\nGalactic Republic\n\n\n[Source]\n\nZan Yant was a male Zabrak surgeon who worked for the Republic during the Clone Wars.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Zan_Yant",
        "title": "Zan Yant",
        "tokens": 100.0
      }
    },
    {
      "id": "8414",
      "title": "Zan Yant",
      "metadata": {
        "categories": [
          "Legends articles",
          "Galactic Republic military personnel",
          "Healers and doctors",
          "4 more",
          "Males",
          "Musicians",
          "Talusians",
          "Zabrak"
        ],
        "content": "# Zan Yant - Biography[]\n\nA member of the wealthy Yant family on Talus, Zan Yant was trained at the best medical schools in the galaxy. In 20 BBY, the Battle of Drongar began, and the Republic needed surgeons. Yant was conscripted and assigned to the Rimsoo Seven facility on Drongar. There, Yant had met Corellian head surgeon Jos Vondar and became fast friends with him.\n\nA good friend of Barriss Offee, and a talented musician, Yant's outlet to escape the horror of the war around him was to play his quetarra. Yant entertained his friends by playing a variety of musical works. Doing so calmed his mind and helped him cope with the traumas of everyday. Yant was very protective of his quetarra, but once when intoxicated, jumped up and down on the quetarra case with the quetarra inside to demonstrate the case's strength.\n\nTragedy struck when the Rimsoo unit was attacked and forced to evacuate. Yant lost his quetarra in the chaos, which the Sullustan reporter Den Dhur had recovered at great risk to his own life. Yant was both surprised and touched at Dhur's heroics. Before Yant could thank Dhur, however, an explosion occurred. A piece of shrapnel lodged into his brain stem, killing him instantly.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Zan_Yant",
        "title": "Zan Yant",
        "tokens": 294.0
      }
    },
    {
      "id": "8679",
      "title": "Rorax Falken",
      "metadata": {
        "categories": [
          "Legends articles",
          "Pages needing citation",
          "Articles to be expanded",
          "6 more",
          "Articles with multiple issues",
          "Educators",
          "Humans",
          "Males",
          "Musicians",
          "Physicists"
        ],
        "content": "# Rorax Falken\n\nRorax Falken\n\n\nBiographical information\n\nDied\n4 ABY (39)\n\n\n\nDescriptive information\n\nSpecies\nHuman\n\n\nGender\nMale\n\n\nHair color\nGray\n\n\nEye color\nGreen\n\n\n\nChronological & political information\n\nAffiliation(s)\nGalactic EmpireGhost Jedi\n\n\n[Source]\n\nRorax Falken was a renowned physicist and one of the multitude of scientists and engineers whose work was incorporated into the first Death Star.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Rorax_Falken",
        "title": "Rorax Falken",
        "tokens": 95.0
      }
    },
    {
      "id": "8909",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - The death of Darth Plagueis[]\n\nAccording to Sidious, Plagueis was powerful enough that he could use the Force to influence the midi-chlorians to create life and keep the ones he cared about from dying, a precious knowledge that awarded him the epithet of \"the Wise.\" However, Plagueis also developed a belief that the Force could \"strike back\" at him for his power. In truth, he became so powerful that the only thing he still dreaded was losing his power.\n\nUltimately, Plagueis' only fear was bound to come true; at some point, Sidious had learned everything he needed from his distracted master, after which he decided that he had no further use for his teacher. In accordance with the Rule of Two tradition, Sidious broke into his master's apartment and disposed of Plagueis, murdering his mentor in cold blood, killing him in his sleep, and ascending to ultimate power and acquiring the title of Sith Master for himself. As noted by Sidious, Plagueis did not act fast enough to prevent his own demise. Sometime before or after Plagueis' demise, Sidious acquired his own pupil in the Nightsister Mother Talzin's son, Darth Maul, a young Dathomirian Zabrak whom Sidious had accepted from Talzin when he was only a child.\n\n",
        "section": "The death of Darth Plagueis[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 278.0
      }
    },
    {
      "id": "8911",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - The rise of Darth Sidious[]\n\nSidious accomplished his ascendance as a Dark Lord of the Sith by killing Plagueis, adhering to the Sith Order's tradition in which the apprentice completed his dark-side training by killing his master. Plagueis' legacy continued through Sidious; With the death of Plagueis, Sidious not only gained the status of Master, but also acquired 11-4D, the late Sith Lord's multi-limbed assistant. In addition, Sidious also inherited Plagueis' studies; in depth research into the biological underpinnings of life with the end goal of discovering how to cheat death.\n\nPlagueis' death served as an example to the apprentice who betrayed and killed him; Sidious regarded his master's trust in him as a mistake, which he vowed to never make. During the Clone Wars, Sidious was aware that his second apprentice, Darth Tyranus, plotted to usurp his title of Sith Master by killing him. Sensing that Tyranus' betrayal was imminent, Sidious successfully conspired to have his student killed by his intended replacement, the Jedi Knight and prophesied Chosen One Anakin Skywalker.\n\n",
        "section": "The rise of Darth Sidious[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 249.0
      }
    },
    {
      "id": "8904",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis\n\nDarth Plagueis\n\n\nBiographical information\n\nDied\nBetween c. 40 BBY and 32 BBY\n\n\n\nDescriptive information\n\nSpecies\nMuun\n\n\nPronouns\nHe/him\n\n\nEye color\nYellow and red\n\n\nSkin color\nPale\n\n\n\nChronological & political information\n\nAffiliation(s)\nSith\n\n\nMasters\nDarth Tenebrous\n\n\nApprentices\n\"The Stranger\"Darth Sidious\n\n\n[Source]\n\nDarth Plagueis (pronounced /'pleɪɡ.əs/) was a Muun Dark Lord of the Sith who trained \"the Stranger\" and Darth Sidious. Plagueis lusted for immortality, believing the secret lay in science. To that end, he researched bioengineering with Sidious and experimented with his ability to influence the midi-chlorians to create life. In doing so, Plagueis acquired considerable knowledge of the Force, but he was ultimately betrayed and murdered by his own apprentice in accordance with the Rule of Two. Sidious later recounted the tale of his master's demise to lure the Jedi Knight Anakin Skywalker to the dark side of the Force, calling the fallen Sith Lord Darth Plagueis the Wise. After his own demise, Sidious used his master's teachings to cheat death, but he was permanently destroyed by his granddaughter, Rey.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 279.0
      }
    },
    {
      "id": "8906",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - Achieving masterhood[]\n\nDarth Plagueis was a legendary Muun Dark Lord of the Sith trained by the Sith Master Darth Tenebrous. At some point during his life, Plagueis acquired the protocol droid 11-4D. During his time as a Sith Lord and studying the Force, Plagueis acquired a vast amount of knowledge about the dark side and its teachings.\n\nDuring the High Republic Era, Plagueis was actively working against the Jedi. By 132 BBY, he had taken on a former Jedi—a human known as \"the Stranger\" or by the pseudonym \"Qimir\"—as his apprentice. In that year, Plagueis was present on an island on a planet inhabited by the Stranger. While there, he lurked in the shadows of the Stranger's cave abode as he observed the Stranger and the former Jedi Padawan Verosha Aniseya, whom the Stranger would take on as a Sith acolyte, depart from the planet in their ship, Exile II. Plagueis was still lurking there when the Stranger and Aniseya returned, Aniseya now the Stranger's apprentice.\n\n",
        "section": "Achieving masterhood[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 242.0
      }
    },
    {
      "id": "8907",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - Master of Darth Sidious[]\n\nThe precise time when Plagueis came to acquire his new Sith apprentice was unknown, but the Dark Lord chose Sheev Palpatine, a human from Naboo, as his pupil. As master and disciple, Plagueis and Palpatine—who took the Sith moniker Darth Sidious—worked together for years, trying to unlock the secrets of immortality as Plagueis lusted for it and to execute the Sith Order's long-percolating plan of supplanting the Galactic Republic with a new Sith Empire.\n\nWhile training Sidious, Plagueis taught him that two Sith were required for their perilous machinations. So, if they worked together in accordance to the Rule of Two, with one of them serving as a bait for the dark side of the Force and the other as a vessel, they would succeed in acquiring the ability to harness the full power of the dark side and rule immortal for ten thousand years. While apprenticed by Plagueis, Sidious also built his own lightsabers.\n\nBelieving the secrets to immortality to lie in science, Plagueis conducted in-depth research into the biological underpinnings of life. Some of that research constituted unnatural experiments, through his ability to coax the midi-chlorians, in an attempt to cheat death, that, though incomplete, were encouraging to his apprentice. The Sith Order had long coveted the ability to live forever, unwilling to accept the Jedi Order's belief that death was a natural part of life, but over the centuries generations of Sith Lords failed to unlock the ability that led to eternal life. He was so obsessed with the subject that he ignored the signs that his \"faithful apprentice\" was progressing in a disturbing way for him.\n\nAccording to Darth Sidious' book, The Secrets of the Sith, Plagueis discovered a form of immortality through transference, a Force power that allowed the user to transfer his consciousness to another body, essentially using bodies as vessels. Plagueis also attempted to forge a Force dyad with Sidious, a unique Force-bond as strong as life itself, which was discovered from the Doctrine of the Dyad, the predecessor to the Rule of Two. However, Plagueis was unsuccessful in forming the dyad.\n\nDarth Plagueis had arranged for his apprentice to become the Senator of Naboo and the rest of the Chommell sector with Palpatine being elected in 52 BBY. By the time that Sidious, under his public persona of Sheev Palpatine, was appointed to the Galactic Senate as the Senator of Naboo, Plagueis was still teaching him, which allowed Palpatine to sharpen his political skills within the plan imagined for him by his master, before they returned to Coruscant.\n\n",
        "section": "Master of Darth Sidious[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 572.0
      }
    },
    {
      "id": "8919",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - Transference[]\n\nDuring the Battle of Endor in 4 ABY, Sidious was killed by a redeemed Anakin Skywalker, who turned back to the light side of the Force and threw Sidious down a reactor shaft to save his son Luke Skywalker. While falling, however, Sidious reflected that he had prepared himself for that scenario unlike Plagueis and called on all the power of the dark side to leave his body and thrust his consciousness to a cloned body created by the Sith Eternal on the secret Sith world of Exegol.\n\nWhen Sidious used Plagueis' secret to immortality and his own research into mix of Sith sorcery and technology to resurrect his spirit in a new vessel, he was able to stave off death for a time, but immortality still eluded the Dark Lord. To this end, the transfer was imperfect; when Sidious thrusted his essence toward the new cloned vessel, and had awoken, he realized the painful, temporary existence he was now within, the body racked with decay in consequence to his massive power within the dark side of the Force, leading the Sith Lord toward death permanently if not dealt with. Because of this, Sidious mused that perhaps Plagueis, in the end, was having the final laugh over his apprentice, as karma for his demise.\n\nIn the years following the Empire's end, during the final stages of the war between the First Order and the Resistance, Sidious' granddaughter, Rey tracked him down to Exegol as the Resistance and the Sith Eternal prepared for a final showdown. Before a redeemed Ben Solo came to her rescue, Sidious insisted his granddaughter to strike him down as he did with Plagueis, allowing Rey to read his mind and discover how he came back thanks to Plagueis' teachings. Ultimately, Rey used the voices and power of the past and deceased Jedi to permanently destroy Sidious and the Sith for good.\n\nIn the wake of victory at the aftermath of the Battle of Exegol, the Exegol Excavation Project was launched to excavate the Sith Citadel on Exegol. The archeological endeavor led by Beaumont Kin managed to uncover a file regarding Darth Plagueis within the Arcane Library. According to Kin's notes as provided in the book The Rise and Fall of the Galactic Empire, the file was notably defaced, but the information contained within brought to life the existence of Darth Plagueis and help construct an incomplete hierarchy of information about the known Sith Lords.\n\n",
        "section": "Transference[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 513.0
      }
    },
    {
      "id": "8920",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - Personality and traits[]\n\nDarth Plagueis was a Dark Lord of the Sith who possessed a vast knowledge of the dark side of the Force. He was a Muun and had yellow and red eyes. He was a meticulous planner, who tried to accomplish the Sith's goal to replace the Galactic Republic with a Sith Empire. Due to his powers, he also became paranoid, believing that the Force could \"strike back.\"\n\nObsessed with achieving immortality, Plagueis strived to discover the path towards becoming an eternal being alongside his apprentice Darth Sidious and rule together for thousands of years, and believed the secret to it laid in science. His desire to cheat death represented a subversion of the natural order of things and an ultimate act of manipulation of the universe and the will of the Force. While Plagueis became afraid of losing his power, he never expected his apprentice to be the reason he would lose power. Ultimately, Plagueis had trusted and underestimated Sidious, who betrayed and murdered him when he least expected it. Though Plagueis did not live to achieve his goals, Sidious succeeded to survive his own death, but given that his transfer was imperfect, he asked himself if maybe Plagueis got the last laugh after all at his failure.\n\n",
        "section": "Personality and traits[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 262.0
      }
    },
    {
      "id": "8923",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - Behind the scenes[]\n\nDarth Plagueis was first mentioned on-screen in the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy. Although Palpatine was never confirmed to be Plagueis' apprentice in the movie itself, a link to the official encyclopedia on StarWars.com did refer to Sidious as having been \"trained by Darth Plagueis.\" He first appeared unnamed in \"The Acolyte,\" the eponymous eighth episode of the 2024 television series The Acolyte, his identity in the episode being later confirmed by showrunner Leslye Headland in an interview. There, the character's appearance in the episode was rendered entirely with computer-generated imagery, without the use of motion capture. Before his appearance in The Acolyte, Plagueis was first pictured via silhouette in the reference book Star Wars Made Easy.\n\nThe character was created by George Lucas as early as the first draft of Revenge of the Sith—dated April 2003—and possibly earlier. His story was massively expanded upon in the 2012 Star Wars Legends novel Darth Plagueis, written by James Luceno. It notably established Plagueis to be a Muun, just as Lucas proposed, a trait that was used once more in The Acolyte and had been canonized prior by the reference book Endless Vigil. All the same, prior to The Acolyte, Plagueis' canon appearance was kept hidden via his silhouettes in Star Wars Made Easy and Star Wars: The Secrets of the Sith. Plagueis was always intended to appear in the season 1 finale of The Acolyte. Headland later confirmed that Plagueis was the Master of \"the Stranger\" when speaking with Entertainment Weekly. Having been talking immediately beforehand about the character's cameo in the episode alongside that of Yoda, Headland stated \"We wanted to show Qimir's master. We weren't going to wait a second season for that.\"\n\nAlthough Legends works show that Plagueis had power over life and death, Lucas himself stated Palpatine's tale about Plagueis' abilities was a lie. Canon also dispensed with the idea of these powers being a lie. The Biography gallery of Darth Sidious' Databank entry and the \"Senator Palpatine\" card part of 2020 Topps Star Wars Holocron Series both state that Plagueis was killed by Sidious after he took Darth Maul as his apprentice. However, the 2019 reference book Ultimate Star Wars, New Edition lists Plagueis' murder at Sidious' hands as taking place before Sidious takes Maul under his wing.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 556.0
      }
    },
    {
      "id": "8917",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - The Tragedy of Darth Plagueis the Wise[]\n\nIn the waning days of the Republic, Sidious recounted the history of his late master to Skywalker, whom he befriended years before the Clone Wars in an effort to gradually turn him to the dark side of the Force. Skywalker, who was unaware at the time that his friend was in fact a Sith Lord, and having developed premonitions of his secret wife's death in childbirth, was intrigued by the story of Plagueis, particularly his ability to prevent death. When the fear of loss drove Skywalker to betray the Jedi Order, turning him into the Sith Lord Darth Vader, Sidious reformed the Republic into the Galactic Empire and declared himself Emperor. At the same time, he had the Jedi systematically executed throughout the galaxy by Order 66, completing the Sith plan that lasted for over a millennium.\n\nOne of the few Jedi to survive was a Padawan named Ferren Barr. Barr began investigating as to why the Jedi fell so quickly and learned of Plagueis' existence, putting his file on him in his list of individuals involved in the crisis. In the years that followed his rise to power, Sidious came to genuinely, if posthumously, appreciate Plagueis for the planner and prophet he had been. Sometimes, Sidious mused about how his late master would have reacted when confronted with the trivial, day-to-day matters of Imperial politics, remarking that Plagueis never foresaw that he would become Emperor. Sidious desired not just the immortaltiy his master had craved and achieved, but the power to fashion a universe of his own creation, and make it so the Force could not \"strike back\".\n\nPlagueis' failure to form a dyad with his apprentice had convinced Sidious that his master was unworthy of the task. However, Sidious also failed to recreate the dyad with his own disciple Vader, despite their combined power as scions of the two strongest Force-sensitive bloodlines, the Palpatines and the Skywalkers. In 3 ABY, cultists searching the catacombs beneath the Sith Citadel on the planet Exegol, a secret Sith world that Palpatine had taken over, repeated Plagueis' name in something similar to a chant, along with the names of other Sith.\n\n",
        "section": "The Tragedy of Darth Plagueis the Wise[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 479.0
      }
    },
    {
      "id": "8921",
      "title": "Darth Plagueis",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Dark Lords of the Sith",
          "6 more",
          "Darths",
          "Individuals of unspecified gender",
          "Individuals with he/him pronouns",
          "Muuns",
          "Rule of Two Sith",
          "Sith Masters"
        ],
        "content": "# Darth Plagueis - Powers and abilities[]\n\nAccording to Darth Sidious, Darth Plagueis was a powerful Sith Lord who was able to use the Force to influence the midi-chlorians to create life, a power that was reportedly to be extremely rare for one sensitive to the Force to possess, and could even be used by certain Sith Lords to prolong their life or even cheat death. Utilizing this ability, Plagueis was able to conduct unnatural experimentations in his bid to discover immortality. His great knowledge of the dark side of the Force could also even aid him in keeping the ones he cared about from dying.\n\nFocused on achieving immortality through sciences and the biologicial underpinnings of life, Darth Plagueis managed to discover a way to become immortal, which consisted on transferring his consciousness to another body and use it like a vessel. Plagueis did not have time, however, to use this skill to evade death when his student cut him down. His apprentice Darth Sidious was later able to survive his first death through this method, yet the transfer was imperfect.\n\nDarth Plagueis may have had the ability to see into the future as his apprentice later mused in appreciation of him for the prophet he had been. However, what Plagueis never saw coming was his apprentice's rise to power.\n\n",
        "section": "Powers and abilities[]",
        "source": "https://starwars.fandom.com/wiki/Darth_Plagueis",
        "title": "Darth Plagueis",
        "tokens": 272.0
      }
    }
  ]
}