{
  "cluster_id": 42,
  "size": 57,
  "vectors": [
    {
      "id": "1096",
      "title": "User:Enderdrag64/Workbench",
      "metadata": {
        "categories": [
          "Films",
          "Real-world lists",
          "Star Wars culture"
        ],
        "content": "# User:Enderdrag64/Workbench - Completed scenes released on Blu-ray[]\n\nProxima's Den — Qi'ra sticks a knife at Solo. After Solo and Qi'ra make plans to leave Corellia, Solo is brought to Proxima's pool.\nCorellian Foot Chase — As Solo and Qi'ra make their escape, they hide in a barrel of eels, that covers their scent from Moloch and his Corellian hounds.\nHan Solo: Imperial Cadet — Solo disobeys orders to jettison and instead crashes his TIE fighter. Solo, after receiving a eye wound, is then court-martialed by Commodore Almudin in a tribunal. Han attempts to defend, but is found guilty and is assigned to the infantry on Mimban.\nThe Battle of Mimban (extended) — Solo, alongside Beckett and his gang posing as mud troopers, fight the Mimbanese. Beckett gives Solo a different blaster and tells Solo to cover him. As Korso continues to fight he is badly wounded by an explosion. Beckett then pulls him back to shelter, but Korso dies.\nHan versus Chewie (extended) — In this version, after Solo speaks Shyriiwook, Chewbacca uses Han to try and break the pillar. Chewie gives up this attempt until Solo forces him to charge at the pillar.\nSnowball Fight! — On their way to meet Dryden, Solo and Chewie get into a snowball fight until Beckett tells them to stop and follow him.\nMeet Dryden (extended) — Dryden gives Solo some Thwip feet that he eats as Beckett and Dryden talk about Nest's interference.\nCoaxium Double-cross — Solo asks one of the villagers on Savareen if they have extra cases as Dryden's ship arrives.\n\n",
        "section": "Completed scenes released on Blu-ray[]",
        "source": "https://starwars.fandom.com/wiki/User:Enderdrag64/Workbench",
        "title": "User:Enderdrag64/Workbench",
        "tokens": 379.0
      }
    },
    {
      "id": "1601",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - Imperial era[]\n\nIn 10 BBY, the pilot droid L3-37 questioned Lando Calrissian's ability to make the Kessel Run when, according to L3-37, he could not successfully fly the Millennium Falcon from \"here to Black Spire\" without her.\n\n",
        "section": "Imperial era[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 68.0
      }
    },
    {
      "id": "4412",
      "title": "Mimban",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Comprehensive articles",
          "Articles in need of updating",
          "8 more",
          "Articles to be expanded",
          "Locations in grid square O-12",
          "Arboreal planets",
          "Circarpous sector planets",
          "Galactic Empire planets",
          "Nanth'ri Trade Route",
          "Swamp planets",
          "The Slice planets"
        ],
        "content": "# Mimban - Age of the Empire[]\n\nWith Mimban controlled by the Galactic Empire via an occupation, swamp troopers and wet-weather gear stormtroopers of the 224th Imperial Armored Division were deployed on the planet to battle Iasento and the Mimbanese Liberation Army. An Imperial prisoner named Cassian Andor served on Mimban for one of the factions of Liberation Army; he was in the army as a cook. He was one of only 50 survivors of the campaign in his unit, which he later declared had been fighting against who should have been their allies. He spoke of serving on Mimban while en route to the planet Aldhani and claimed he saw action.\n\nAfter he was kicked out of an Imperial Academy, Han Solo was reassigned to Mimban. During that time, his commanding officer, Major Staz, was killed. Eventually, Han was framed by Tobias Beckett as a deserter. Lieutenant Alayus Bolandin punished him by throwing him to Chewbacca, a Wookiee in a makeshift execution pit. During her time in the Hunters of the Outer Rim competition, bounty hunter Imara Vex claimed that she had once carried out a job on Mimban, during which she tried to dress warmly but still failed to hold back the planet's damp, cold weather. She also saw firsthand how numerous threats could emerge from the world's swamps, which forced her to keep her rifle on hand. Vex remembered the Mimban job with a suit of armor and rifle she used in the Hunters competition.\n\n",
        "section": "Age of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Mimban",
        "title": "Mimban",
        "tokens": 314.0
      }
    },
    {
      "id": "4755",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - Imperial era[]\n\nIn 10 BBY, the pilot droid L3-37 questioned Lando Calrissian's ability to make the Kessel Run when, according to L3-37, he could not successfully fly the Millennium Falcon from \"here to Black Spire\" without her.\n\n",
        "section": "Imperial era[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 68.0
      }
    },
    {
      "id": "6294",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Rise of the First Order[]\n\nDuring the rise of the First Order, Kanata was visited by Solo, an old friend of hers. When Solo entered the castle, Kanata greeted him by shouting his name, temporarily halting the tavern's activity. Kanata approached Solo and inquired about the absence of Chewbacca—Solo's first mate and Kanata's Wookiee \"boyfriend\" of over thirty-one years. Solo, who was accompanied by Rey, Finn, and BB-8, which were a young scavenger from the desert world Jakku, a defecting First Order stormtrooper, and a Resistance astromech droid, respectively, explained that Chewbacca was making repairs to their starship, the Millennium Falcon. Assuming that Solo needed desperate help with something, Kanata led the group to a table to eat and discuss their dilemma.\n\nSolo explained that the droid BB-8 contained a map leading to Luke Skywalker, and that it needed to be delivered to his wife, Resistance General Leia Organa, with whom Solo was estranged. Kanata refused, saying that Solo had been avoiding the fight for too long, and he needed to go home. Finn objected Kanata's answer, while Rey asked Kanata what \"fight\" she was referring to. Kanata explained that there was only one fight: the fight against the dark side of the Force, which took the form of the Sith, the Empire, and the First Order. Kanata went on to argue that they should all oppose the spreading of the First Order, but Finn insisted that a fight against the First Order could not be won. As Finn spoke, Kanata adjusted her variable lens corrective goggles, crawled up onto the table, and looked into Finn's eyes, saying that he had the eyes of a man who wanted to run. Finn, telling Kanata she did not know the things he had seen, suggested that they all needed to run. Resigned, Kanata climbed down from the table and directed Finn to Sidon Ithano and Quiggold, two pirates who would trade work for transportation to the galaxy's Outer Rim Territories. Finn stood up and left, and when Rey went after him, Kanata asked Solo who she was.\n\nThe smuggler informed Kanata that Rey lived alone on Jakku, and that the scavenger wished to return there, believing her family would be coming back. Kanata went to speak with Rey, finding the human with BB-8 in a lower level hall, stumbling out of a storeroom and looking shaken. Rey, who had a vision after coming into contact with the Skywalker lightsaber, asked Kanata what it was, saying she regretted entering the room. Kanata explained that the lightsaber belonged to Luke and his father before him, and it was then calling to her. Rey responded by insisting she return to Jakku, but Kanata, removing her goggles and taking the girl's hand, told her that she already knew the truth: whomever Rey was awaiting would never come back. However, Kanata added that while no one from Rey's past was returning, there was someone who still could, so Rey replied that the person was Luke Skywalker.\n\nMaz then told Rey, that what she sought was not behind her, but ahead. Kanata admitted that she was not a Jedi herself, but she still knew the Force, explaining that it moved through and surrounded every living thing. Instructing Rey to close her eyes and feel the light side of the Force, the pirate told the scavenger that it would always guide her, and that the girl should keep the lightsaber. However, Rey stated that she would never touch the weapon again, and that she wanted nothing to do with the Force. Kanata stammered as Rey, followed by BB-8, quickly left the hall, leaving the pirate alone with her thoughts: one could teach knowledge, skills, and even the Force, but not patience.",
        "section": "Rise of the First Order[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 809.0
      }
    },
    {
      "id": "6292",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Rise of the First Order[]\n\nDuring the rise of the First Order, Kanata was visited by Solo, an old friend of hers. When Solo entered the castle, Kanata greeted him by shouting his name, temporarily halting the tavern's activity. Kanata approached Solo and inquired about the absence of Chewbacca—Solo's first mate and Kanata's Wookiee \"boyfriend\" of over thirty-one years. Solo, who was accompanied by Rey, Finn, and BB-8, which were a young scavenger from the desert world Jakku, a defecting First Order stormtrooper, and a Resistance astromech droid, respectively, explained that Chewbacca was making repairs to their starship, the Millennium Falcon. Assuming that Solo needed desperate help with something, Kanata led the group to a table to eat and discuss their dilemma.\n\nSolo explained that the droid BB-8 contained a map leading to Luke Skywalker, and that it needed to be delivered to his wife, Resistance General Leia Organa, with whom Solo was estranged. Kanata refused, saying that Solo had been avoiding the fight for too long, and he needed to go home. Finn objected Kanata's answer, while Rey asked Kanata what \"fight\" she was referring to. Kanata explained that there was only one fight: the fight against the dark side of the Force, which took the form of the Sith, the Empire, and the First Order. Kanata went on to argue that they should all oppose the spreading of the First Order, but Finn insisted that a fight against the First Order could not be won. As Finn spoke, Kanata adjusted her variable lens corrective goggles, crawled up onto the table, and looked into Finn's eyes, saying that he had the eyes of a man who wanted to run. Finn, telling Kanata she did not know the things he had seen, suggested that they all needed to run. Resigned, Kanata climbed down from the table and directed Finn to Sidon Ithano and Quiggold, two pirates who would trade work for transportation to the galaxy's Outer Rim Territories. Finn stood up and left, and when Rey went after him, Kanata asked Solo who she was.\n\nThe smuggler informed Kanata that Rey lived alone on Jakku, and that the scavenger wished to return there, believing her family would be coming back. Kanata went to speak with Rey, finding the human with BB-8 in a lower level hall, stumbling out of a storeroom and looking shaken. Rey, who had a vision after coming into contact with the Skywalker lightsaber, asked Kanata what it was, saying she regretted entering the room. Kanata explained that the lightsaber belonged to Luke and his father before him, and it was then calling to her. Rey responded by insisting she return to Jakku, but Kanata, removing her goggles and taking the girl's hand, told her that she already knew the truth: whomever Rey was awaiting would never come back. However, Kanata added that while no one from Rey's past was returning, there was someone who still could, so Rey replied that the person was Luke Skywalker.\n\nMaz then told Rey, that what she sought was not behind her, but ahead. Kanata admitted that she was not a Jedi herself, but she still knew the Force, explaining that it moved through and surrounded every living thing. Instructing Rey to close her eyes and feel the light side of the Force, the pirate told the scavenger that it would always guide her, and that the girl should keep the lightsaber. However, Rey stated that she would never touch the weapon again, and that she wanted nothing to do with the Force. Kanata stammered as Rey, followed by BB-8, quickly left the hall, leaving the pirate alone with her thoughts: one could teach knowledge, skills, and even the Force, but not patience.\n\nShortly after Rey left, patrons of the castle hurried outside to witness the destruction of the New Republic's capital, Hosnian Prime, visible in the sky above. Finn deduced it was an act of the First Order, and he regrouped with Solo and Chewbacca, asking where Rey was. Kanata approached the group and told them that Rey was where she needed to be, and said there was something they should see. The pirate led them to the storeroom where Rey was, and she presented the lightsaber to Finn. Solo, who had been a close friend of Luke's, asked where Kanata got the weapon, but Kanata dismissed him, saying it was a story for another time. Telling Finn to find Rey, Kanata passed the lightsaber to him. But before they left the room, the castle shook, signaling the arrival of the First Order, and the hallway collapsed as First Order TIE fighters leveled the castle.\n\nLed by Chewbacca, the four cleared a tunnel to the surface, where the Wookiee and Solo immediately joined the battle against the First Order troops. Finn and Kanata exited next, and the pirate ordered Finn to find and help Rey and BB-8. However, Finn insisted that he needed a weapon first, so Kanata reminded him that he already had one, seizing his wrist that held the lightsaber. Finn activated the blade and entered the fight alongside Solo and Chewbacca until forces of the Resistance arrived to provide support. However, despite the Resistance's arrival and the retreat of the First Order's forces, Finn was unable to prevent Rey from being taken captive by Kylo Ren. In the battle's aftermath, Kanata spoke with BB-8, telling the droid that although the First Order took Rey, they could not give up hope, and the Resistance needed the astromech's help. Kanata then walked over to Finn, joking that she had some cleaning up to do. Looking up at Finn, Kanata smiled with satisfaction, noting that she no longer saw the eyes of a coward, but the eyes of a warrior.\n\n",
        "section": "Rise of the First Order[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 1236.0
      }
    },
    {
      "id": "6274",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Pirate queen of Takodana[]\n\nBorn over a millennium before the conflict between the First Order and the Resistance, in 973 BBY, Maz Kanata was a Force-sensitive female who learned to live and thrive in the criminal underworld of the galaxy. Living on her homeworld, the planet Takodana, Kanata resided in a lakeside castle which was home to the ancient protocol droid ME-8D9, nicknamed \"Emmie.\" The castle was a battleground between ancient Jedi and Sith, and with time, Emmie was rumored to have started out with the Jedi Order. Relatively late during Kanata's stay on Takodana, she married, and her husband gifted her a statue in her image. The statue remained at the castle until the time of the First Order–Resistance conflict, although the marriage did not last.\n\nA thousand years before the First Order–Resistance conflict, Kanata became reputed as a \"pirate queen,\" giving credits, equipment, and connections to young smugglers, often allowing them a day in her home for free or a long-term stay for rent. She held sway over more than a thousand ports when the Galactic Republic was still young. In addition to hosting smugglers and pirates, Kanata housed traveling musicians, and she hired a majordomo who oversaw the castle's activities and a kitchen crew headed by the Artiodac chef Strono Tuggs, who stayed with Kanata's castle for centuries.\n\nUnlike her chef, however, Kanata spent centuries of her life traveling the galaxy collecting antiques and other treasures. She kept her collection of countless trinkets in the storehouses and vaults of her castle, and she protected items that spoke to her through the Force, believing that relics from the past could impact the future. In addition to these items, she had come into possession of other numerous treasures which she then stored within buried vaults armed with antitamper subspace alarms located all across the galaxy. She began to designate the locations on her Smuggler's Guide, a logbook of her own making. At some point, Kanata was part of the Free Fleet.\n\n",
        "section": "Pirate queen of Takodana[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 440.0
      }
    },
    {
      "id": "6277",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - High Republic Era[]\n\nDuring the High Republic Era, three criminals delivered a baby Aloxian to Takodana Castle hoping that she would be able to handle him, the criminals themselves having become terrified of the child. Initially assuming that the three were up to shenanigans, Kanata was surprised when she opened the box to find the infant Qort inside. Bringing him inside the castle, Kanata enlisted the help of her loadlifter droid steward HURID-327, but despite HURID's best efforts Qort would not stop crying.\n\nWhen Kanata went off to get some milk to feed the child with, Qort used his natural strength and untrained Force powers to incapacitate the droid, leaving him in pieces on the floor, before escaping to Takodana Castle's basement storerooms. There, Qort found a vonduun crab skull Kanata had been given by her friend Farks, putting it on just before Kanata found him, having been directed after the child by HURID. Calmed by the helmet, Qort would not remove it and did not destroy anything else.\n\nTrying to discover the origins of the child, Kanata called on Farks for information about the skull, and the Patrolian told her about the Aloxians and the importance of the helmets to their culture. Farks further speculated that the child had been kidnapped by Argoban raiders, who were known for such practices. Kanata, deciding that the information changed things, decided to get some assistance from Sav Malagán, a Jedi Master stationed at the nearby Jedi Temple and a long-time friend of hers. Qort's Force-sensitivity was eventually discovered, and he was taken in by the Jedi Order.\n\nYears later, following a debacle at Vrant Tarnum by Krix Kamerat, the leader of a Nihil specialized cell, the Eye of the Nihil Marchion Ro ordered him to find a way to prove himself after, who chose to attack Takodana, which had a Jedi Temple, in the hopes of destroying the temple and demonstrating to the Maz Kanata that the Nihil were the only true marauders in the area. The lone Jedi at the Takodana temple, Malagán, was able to drive off the first wave of the attack, but called for reinforcements from Starlight Beacon as she knew the Nihil would return.\n\nKanata and Malagán soon welcomed a group of Jedi Padawan reinforcements that arrived from the Star Hopper to the temple, which included Qort. The Padawans helped set up defenses at the temple. Due to Nihil infiltration, the temple was destroyed, and along with it, Qort's mask. With the block on his abilities removed, Qort took to the skies and fought off the Nihil with his lightsaber as Kanata and Malagán watched on.\n\nAt some point, Kanata went on many adventures with Marlaa Jinara during the High Republic Era. Prior or during 232 BBY, Kanata and Jinara used Cardogian honey to catch Giant buzzer bees on Borlax 14. During 232 BBY, Kanata traveled to the planet Tenoo to get her jet pack fixed by Jinara, who lived there. Eventually the jet pack malfunctioned and caused chaos around Jinara's junkyard. By the help of Jedi youngling Kai Brightstar, they eventually retrieved the jet pack after it crashed landed in a nearby forest.\n\n",
        "section": "High Republic Era[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 715.0
      }
    },
    {
      "id": "6270",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata\n\nMaz Kanata\n\n\nBiographical information\n\nHomeworld\nTakodana\n\n\nBorn\n973 BBY\n\n\n\nDescriptive information\n\nSpecies\nAn alien species\n\n\nGender\nFemale\n\n\nPronouns\nShe/her\n\n\nHeight\n1.24 meters (4ft 1in)\n\n\nHair color\nWhite\n\n\nEye color\nBrown\n\n\nSkin color\nOrange\n\n\n\nChronological & political information\n\nAffiliation(s)\nMaz Kanata's pirate crewFree FleetResistance\n\n\n[Source]\n\nMaz Kanata, also known as Maz Kanata the Usurper, Kanata the Despoiler, Kanata the Benevolent, and Kanata of the Free Fleet, was a Force-sensitive female of an unknown species, who was born over a millennium before the brewing war between the First Order and the Resistance. Living in an ancient castle on the planet Takodana, Kanata gained a reputation as a \"pirate queen\" by allowing traveling smugglers to reside in her home—as long as they honored her prohibitions against politics and war. Kanata spent centuries traveling the galaxy, collecting antiques and trinkets, which she kept inside the storehouses and vaults of her castle. One notable item was the lightsaber crafted by Jedi Knight Anakin Skywalker during the Clone Wars, and later wielded by Skywalker's son, Luke, who was instrumental in toppling the Galactic Empire.\n\nThirty years after the Empire's defeat at the Battle of Endor, the smuggler Han Solo brought Rey, a scavenger from the desert planet Jakku, to Kanata's castle. Kanata took interest in the girl, and when the Skywalker lightsaber called out to Rey through the Force, the smuggler queen told the scavenger to keep the weapon. However, Rey refused, and shortly before stormtroopers of the First Order arrived looking for her she fled the castle. During the ensuing battle, Kanata's castle was destroyed, and Rey was taken prisoner, so Kanata entrusted the lightsaber to Finn, a former First Order stormtrooper, who abandoned his previous occupation, choosing to help the Resistance.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 428.0
      }
    },
    {
      "id": "6299",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Helping the Resistance[]\n\nAfter the destruction of her castle, Kanata resumed her life of adventure whilst the Resistance continued their struggle against the First Order. When the Resistance fleet was tracked through hyperspace and picked off one ship at a time, Finn and technician Rose Tico departed the fleet in order to find someone capable of breaking through the clearance codes for an infiltration of the First Order's flagship, the Mega-class Star Dreadnought Supremacy. Finn contacted Kanata, who was unable to help them personally as she was involved in what she referred to as a \"union dispute,\" actually a firefight, the details of which were something they did not want to know.\n\nBy that point, Kanata had already endured sixty-seven injuries, from which twenty-two were considered life-threatening, having gone through a plethora of treatments over a millennium of life, was still remaining on her feet nevertheless. However, she was able to recommend a Master Codebreaker whom she knew was capable of cracking anything. Pointing the two in the direction of Canto Bight, a luxury city resort, Kanata told them that the codebreaker could be identified by a red flower lapel pin before cutting off the transmission.\n\nFollowing the Battles of Crait and Grail City, Maz told Poe Dameron it was not yet her time to join the Resistance, but nonetheless notified its members to an impending event on the planet Corellia where members of the Collective were intending to auction off a stolen list of First Order prisoners and targets. Eventually, she had joined the Resistance at their new base on Ajan Kloss, acting as an advisor to Leia and other Resistance members. After learning that Darth Sidious had returned with the Final Order, a massive fleet of Xyston-class Star Destroyers built by the Sith Eternal, and was planning to attack the free worlds, Maz advised that the only way stop him was to find Exegol, where the fleet was located. When Leia sensed her apprentice, Rey, and her son, Kylo Ren, dueling on Kef Bir, Maz knew that the only way for Leia to save her son would be to use all the strength she had left to reach him. When Leia passed away, Maz and other members of the Resistance gathered around her body to bid her farewell. Maz was also present when Leia's body became one with the Force. When the Resistance returned from victory on Exegol, Maz welcomed Chewie home and presented him the Medal of Bravery.\n\n",
        "section": "Helping the Resistance[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 503.0
      }
    },
    {
      "id": "6281",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Galactic Civil War[]\n\nKanata's connection to the Force acquainted her with members of the Jedi Order and protected her from danger, but following Darth Sidious' rise to power, the formation of the Galactic Empire, and the execution of all Jedi, Kanata kept her abilities a secret. However, the Empire was challenged by the Alliance to Restore the Republic. Nineteen years after the New Order's creation, it suffered a major loss during the Battle of Yavin when Luke Skywalker, son of Jedi Knight Anakin Skywalker, destroyed the Death Star, a massive Imperial superweapon. Prior to that event, Kanata's voice was heard by Ezra Bridger in 1 BBY during his mission to a place that existed between time and space.\n\nShortly after the Battle of Yavin, Kanata discovered that the Empire had been collecting an unsettling amount of information on her. To prevent them from learning too much, she hired a mercenary via hologram to strike selected Imperial targets on six worlds: Tatooine, Dandoran, Er'Kit, Hoth, Yavin 4, and her home of Takodana. The mercenary was successful in completing Kanata's objectives, so she rewarded the gunman by employing an Ithorian saboteur to work for them.\n\nIn 4 ABY, sometime before the climactic Battle of Endor, Kanata traveled to Ord Mantell where she was reunited with her \"boyfriend\", the Wookiee Chewbacca, and helped Leia Organa to infiltrate into Jabba's Palace to rescue Han Solo from Jabba the Hutt by suggesting she disguise herself as the bounty hunter Boushh.\n\n",
        "section": "Galactic Civil War[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 342.0
      }
    },
    {
      "id": "6297",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Rise of the First Order[]\n\nShortly after Rey left, patrons of the castle hurried outside to witness the destruction of the New Republic's capital, Hosnian Prime, visible in the sky above. Finn deduced it was an act of the First Order, and he regrouped with Solo and Chewbacca, asking where Rey was. Kanata approached the group and told them that Rey was where she needed to be, and said there was something they should see. The pirate led them to the storeroom where Rey was, and she presented the lightsaber to Finn. Solo, who had been a close friend of Luke's, asked where Kanata got the weapon, but Kanata dismissed him, saying it was a story for another time. Telling Finn to find Rey, Kanata passed the lightsaber to him. But before they left the room, the castle shook, signaling the arrival of the First Order, and the hallway collapsed as First Order TIE fighters leveled the castle.\n\nLed by Chewbacca, the four cleared a tunnel to the surface, where the Wookiee and Solo immediately joined the battle against the First Order troops. Finn and Kanata exited next, and the pirate ordered Finn to find and help Rey and BB-8. However, Finn insisted that he needed a weapon first, so Kanata reminded him that he already had one, seizing his wrist that held the lightsaber. Finn activated the blade and entered the fight alongside Solo and Chewbacca until forces of the Resistance arrived to provide support. However, despite the Resistance's arrival and the retreat of the First Order's forces, Finn was unable to prevent Rey from being taken captive by Kylo Ren. In the battle's aftermath, Kanata spoke with BB-8, telling the droid that although the First Order took Rey, they could not give up hope, and the Resistance needed the astromech's help. Kanata then walked over to Finn, joking that she had some cleaning up to do. Looking up at Finn, Kanata smiled with satisfaction, noting that she no longer saw the eyes of a coward, but the eyes of a warrior.",
        "section": "Rise of the First Order[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 439.0
      }
    },
    {
      "id": "6283",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - New Republic Era[]\n\nAfter Sidious was killed by former Jedi Anakin Skywalker during the Battle of Endor, Kanata felt again comfortable sharing her Force-sensitivity. Not long after the battle, Kanata once more made the acquaintance of Solo, serving him Parkellan Slings and admonishing him for not bringing Chewbacca. Correctly guessing that he was there for something, she interrogated him and was told that he was meeting an Imperial defector, Ralsius Paldora, regarding information that would help him free the Wookiees on Kashyyyk, who were still suffering under Imperial rule.\n\nWarning Solo of dire consequences should he bring the Empire's attention to her doorstep, Kanata pointed him in the direction of the crowd. Unfortunately, the Empire did indeed arrive on Takodana looking for their pilfered information and Kanata immediately assumed Solo was responsible, reminding him of her one absolute rule. She later contacted him for a further tongue-lashing when Imperial air reinforcements, consisting of a light cruiser and multiple TIE fighters, appeared over Nymeve Lake, ordering him to clean up his mess (though assuring Chewbacca that she didn't blame him) and then to leave once the Imperials were dealt with.\n\nIn 5 ABY, Kanata's home was visited by Romwell Krass Junior, an Imperial Security Bureau agent who had narrowly escaped a New Republic attack on the Hyborean Moon which took the lives of his family and friends. On the third day of his stay, Krass was drinking at Kanata's bar when he saw a New Republic pilot. Krass assaulted the man, blaming the pilot for his family's death. The fight was stopped by Emmie, who informed the two that they had violated the castle rules; as such, she rendered them unconscious and brought them to cells within the castle's dungeon.\n\nWhen the two awoke, they began yelling at each other, before Kanata arrived and told them to be silent. Retrieving a step-stool from the wall, Kanata climbed to look through the windowed door of Krass' cell, adjusting her goggles and telling the Imperial to come closer. As she examined Krass, she told him that she saw his suffering, as well as the suffering caused by him. Declaring that the Empire was dead, Kanata unlocked the cell, telling Krass to leave the castle and find peace. After the Imperial left, Kanata granted the pilot freedom, and she went to meditate on a parapet overlooking Nymeve Lake. Emmie joined the pirate, stating that the castle was at peace. Kanata, responding that her heart was not at peace, told Emmie that the Force felt off balance. Requesting that the droid prepare her starship, the Tua-Lu, for flight, Kanata added that she wished to look around the galaxy and see what she could see.\n\nIn 9 ABY, Kanata was considered one of the most famous pirates in the galaxy, stories about Kanata were shared by members of the Hunters of the Outer Rim tournament on Vespaara.\n\nIn the time that followed, Skywalker's son, Luke, the last remaining Jedi, began training a new generation of warriors. However, Skywalker vanished when his Jedi were destroyed by Kylo Ren, a pupil of his who went on to lead the First Order, the organization born from the Empire's remnants. At some point in her travels, Kanata acquired Skywalker's lightsaber, which was constructed by Anakin and later wielded by Luke. Cognisant of the lightsaber's greatness, Kanata stored the weapon in an ancient, wroshyr wood curio box, along with a four-thousand-year-old hyperspace sextant, a fusioncutter head, and a diatium power cell.\n\n",
        "section": "New Republic Era[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 782.0
      }
    },
    {
      "id": "6314",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Creation and development[]\n\nFollowing The Walt Disney Company's acquisition of Lucasfilm, the production company announced on October 30, 2012 that it would begin work on a Star Wars sequel trilogy of films, starting with Star Wars: Episode VII The Force Awakens, directed by J.J. Abrams. In March 2013, preliminary screenwriter Michael Arndt realized a \"Yoda-like mentor figure\" for the protagonists, the character which became Maz Kanata. Earlier in the production, Abrams and co-production designer Rick Carter had discovered they shared a common teacher: award-winning high school instructor Rose Gilbert, who taught until her retirement at the age of 94. In tribute to their teacher, the character of Kanata was based off of Gilbert. In order to prevent spoilers, crew members referred to Kanata as \"Rose\"—a code name chosen in honor of Gilbert—while on set and behind the scenes. To help capture the wise, timeless spirit of Gilbert, Christian Alzmann, a concept artist at Industrial Light & Magic (ILM), kept pictures of the teacher spread throughout the ILM work stations.\n\nConcept work for Kanata began in March 2013 and Alzmann sketched the character as a member of Yoda's species. As of May 2013, Alzmann drew the character as a hunched, green alien with a headdress, and in June, the artist redesigned Kanata's face to be bug-eyed and snub-nosed; during pre-production in July, Kanata's character was characterized as a \"guru.\" During the film's production phase, Kanata was to be realized as a puppet or animatronic character, but the crew ran short on time—in part from an injury Harrison Ford received on set—so Abrams decided to create Kanata using computer graphics (CG). According to Abrams, CG also allowed the team more time to agree on a design, and it removed limitations that a practical character would have had.\n\nThe weeklong test creature concept designer Jake Lunt Davies underwent to see if he should be hired on the film was him set to work on making concepts for \"Rose.\" The next week, Davies started work on the film at Pinewood Studios. In June 2014, Davies, costume concept artists Glyn Dillon and Dermot Power, and senior sculptor Luke Fisher were tasked with creating a \"fortuneteller\" look for Kanata, so they designed a sequin-covered shawl—along with the goggles and wrinkles that ended up in the film. In October 2014, Fisher sculpted a maquette of Kanata, which was then painted by creature paint finish designer Henrik Svensson to finalize the design.\n\nIn the reference book Star Wars: The Rise of Skywalker: The Visual Dictionary released in 2019, Maz Kanata's species is stated as unknown. However, in the Japanese version of the same book, it is identified as \"ギルブロジアン\". This could be transcribed into English as Gilbrogian, but is uncertain.\n\n",
        "section": "Creation and development[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 624.0
      }
    },
    {
      "id": "6326",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - LEGO Star Wars[]\n\nOutside of the character's canonical appearances, Kanata appears in various LEGO releases, including LEGO Star Wars: The Freemaker Adventures, LEGO Star Wars: The Resistance Rises, and LEGO Star Wars: The Force Awakens. While these appearances are not a part of the official Star Wars canon, they are set in a unique, continuous universe.\n\nSet during the Galactic Civil War, The Freemaker Adventures shows Kanata meeting the titular Freemaker family when their ship, the StarScavenger, crashes outside her castle. The crash landing causes damage to a ship owned by the pirate Hondo Ohnaka, and the Dowutin Grummgar brings the pilot responsible, Zander Freemaker, into the castle to meet with the Weequay pirate captain. Encountering Ohnaka, Grummgar restrains Zander, and Ohnaka tells him that the damages must be paid for. Zander replies that he has no money, and Ohnaka replies that he will also accept blood, limbs, or next of kin as payment. Zander's younger brother, Rowan, attacks Grummgar, demanding that his brother be set free. Grummgar lifts Rowan up with one hand, and Ohnaka jokes that the boy would make a good crew member if he were taller. As Ohnaka laughs, Kanata notices the commotion and throws a mug at the pirate, hitting him in the head. Picking up another cup threateningly, Kanata walks toward Ohnaka, affirming that he will not cause any trouble in the castle, something he has done before. Stopping Ohnaka as he begins to act coy, Kanata comments that the last incident involving him had her pulling teeth out the castle walls for weeks. Agreeing to work out the problem peacefully, Ohnaka begins to make a deal with Kordi Freemaker, so Kanata leaves them and enters through a door to another room. However, as the door opens, Rowan senses a crystal of the Kyber Saber, an ancient Jedi weapon, and he follows Kanata. Just before Rowan enters the room, Kanata stops him, asking if he is lost and stating that only she is allowed in there. Rowan apologizes, saying he thought he felt something. Kanata inquires what he felt, but Rowan changes his mind and leaves.\n\nThe Freemakers embark on Ohnaka's mission to recover three golden orbs from the third moon of Takodana, but they choose to return empty-handed when they learn the orbs are varactyl eggs. When Kordi offers to try another deal instead, Ohnaka scoffs, and as he orders his crew to kill the Freemakers, Kanata enters the room and throws another mug at his head. Kanata, who overheard that Ohnaka sent kids to do a dangerous task, approaches the Weequay, again striking him with a mug and pushing him towards the castle's exit, telling him not to come back until she is no longer angry. When Ohnaka tries convincing Kanata to let him stay, she hits twice more before he leaves. Remarking that there is no decency left in the galaxy, she instructs the three Freemakers to follow her into the other room. Saying that their presence is bad for business, Kanata offers to provide them with what they need to leave the planet. Zander requests a quantum field regulator, and Kanata opens a drawer and asks him what type he needs. Slightly confused, Zander asks for a double-A type for a Class-D salvage ship, and to his surprise, Kanata removes one from the drawer. Running to the drawer, Zander asks what else she has, but Kanata dismisses him and turns her attention to Rowan. Commenting how she likes his smile and the way he confronted Ohnaka, Kanata opens a locked drawer and removes a Kyber Saber crystal. She presents it to the excited boy, explaining that she found it on Rodia ages ago. When Kordi asks how they can thank Kanata, the pirate says that they can leave. As she escorts them out the door, Kanata tells the Freemakers that they are nice kids, but that her castle is not a place for nice or kids. Rowan is the last to exit, and Kanata stops to tell him that searching for the Kyber crystals is a noble quest, adding that when they inevitably get desperate they should seek the \"Maker of Zoh.\" When Rowan asks what she means, Kanata acts senile, says bye, and hurries into her castle.\n\nIn The Resistance Rises, which is set after the Galactic Civil War, the pirate Bala-Tik meets with Kanata to complete a trade: a concealed item Kanata wants in her collection, for the location of Solo (who had cheated Bala-Tik out of rathtars). However, nearly everybody in Kanata's castle has been cheated by Solo, and the patrons begin to argue over who was swindled the worst. A brawl quickly erupts, and when Kanata's genuine \"Princess Leia Battle of Endor speeder bike\" breaks as a result, Kanata becomes enraged, retrieving the Skywalker lightsaber, cutting the ceiling's masonry to fall on her quarreling guests, and declaring the fight to be over. With the commotion stopped, a hooded individual tells the patrons that Solo's ship was last sighted on Jakku, and that the smuggler would not stay in one place for long. As the criminals race out the castle's door, Kanata approaches the figure, immediately recognizing him to be Lando Calrissian. The two collect the case Bala-Tik left behind and open it to reveal two musical instruments. Kanata begins to play, and she invites Calrissian to join, who gladly accepts.\n\n",
        "section": "LEGO Star Wars[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 1211.0
      }
    },
    {
      "id": "6311",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Equipment[]\n\nSpending centuries of her life traveling the galaxy, Kanata owned many starships, including the Tua-Lu—also known as the Stranger's Fortune—and the Epoch Swift. During her travels Kanata collected countless antiqued trinkets and treasures, notably including Skywalker's lightsaber. She stored the lightsaber in an ancient, unlocked wroshyr wood curio box, along with her other dearest treasures: a four-thousand-year-old hyperspace sextant, a fusioncutter head, and a diatium power cell. The box was kept behind the closed door of a basement storeroom, a vault which also contained a bust of Cherff Maota, a Jedi Master of old.\n\nKanata's millennia-old castle was located on the edge of a primordial forest along the shore of Nymeve Lake, a freshwater body and battle site between ancient Sith and Jedi. The stone fortress had a trapezoidal architecture, considered both impressive and beautiful. Despite the castle's age, it was modernized with sensor arrays and communications gear that allowed its owner to stay connected with the rest of the galaxy. Kanata enjoyed the technological contrast between her castle and the surrounding forest, and she viewed it as the manifestation of a cosmic balance. Towers of the castle also held prayer flags hung by deep-space explorers, and the entrance to Kanata's castle was adorned with various flags and banners which represented hundreds of cities, civilizations, and guilds; among them were a flag of the Ohnaka Gang, the emblem of the Broken Horn Syndicate, Mandalorian war banners, and podracing pennants (including those used by Anakin Skywalker and the Dug Sebulba during the Boonta Eve Classic). Directly above the sectioned metal door was a towering statue of the pirate queen with her arms outstretched, a gift from Kanata's former husband.\n\nThe smuggler dressed practically, and at the time of Solo and Rey's visit Kanata wore clothes she knitted herself: colorful socks, baggy maroon pants held by a leather belt, a dark gray vest over a blue-green sweater, and a simple gray cap. Attached to Kanata's cap were large, variable lens corrective goggles, and her silver-buckled belt suspended an assortment of technology, including a compact blaster pistol. The pirate also wore a beaded necklace and a large number of rings and bracelets, such as the Bracelet of the Sutro.\n\n",
        "section": "Equipment[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 507.0
      }
    },
    {
      "id": "6317",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Casting and portrayal[]\n\nOn June 2, 2014, Lucasfilm announced the casting of Lupita Nyong'o, an actress who won an Academy Award for Best Supporting Actress for her work in the film 12 Years a Slave. Nyong'o would go on to play the character in all the films of the sequel trilogy. According to Nyong'o, she was primarily interested in the role of Maz Kanata because of the motion capture aspect—something she had wanted to do ever since seeing Andy Serkis portray Gollum in The Lord of the Rings. Since Nyong'o had no prior experience in motion capture, she was coached by Serkis, who played the character of Supreme Leader Snoke, the film's antagonist. Every morning of filming The Force Awakens, Nyong'o would have 149 dots applied to her face, an experience she described as \"alienating\" because of the suit's distracting nature and her unfamiliarity with motion capture. For The Rise of Skywalker, an animatronic was built that utilized multiple puppeteers.\n\nThe character of Maz Kanata was generally praised by critics, such as Scott Mendelson of Forbes, who felt that Kanata was the center of the film's best scene, and Stephanie Zacharek of Time magazine, who saw Kanata as \"the love child of E.T. and Lena Horne.\" Conversely, Matt Goldberg of Collider.com criticized the character's design, definition, and role, calling Kanata the film's \"bar-owner/Yoda stand-in/exposition mouthpiece.\" Nyong'o's portrayal of Maz Kanata was nominated for a Visual Effects Society award for Outstanding Animated Performance in a Photoreal Feature, and Nyong'o was also nominated for a Saturn Award for Best Supporting Actress.\n\nIn Star Wars: Episode IX The Rise of Skywalker, Claire Roi Harvey was Kanata's physical performer and Richard Coombs vocalized her lines.\n\nFor the film's soundtrack, composer John Williams wrote \"Maz's Counsel,\" a three-minute and seven-second-long piece associated with Kanata. The song is first used in the scene in which Kanata looks into Finn's eyes, and the composition is later used when Kanata speaks to Rey about the Skywalker lightsaber. During the latter scene, \"Maz's Counsel\" briefly incorporates \"The Force Theme\" and \"Rey's Theme.\"\n\nOn April 20, 2016, Kanata appeared in \"Hunting for Han\", the third episode of LEGO Star Wars: The Resistance Rises, a series of LEGO short films which aired on Disney XD. In the show, Kanata was voiced by Grey Griffin, who reprised the role for \"The Test\", the eighth episode of LEGO Star Wars: The Freemaker Adventures which aired on July 25, 2016. In addition to Griffin's voice work, Marc Thompson provided Kanata's voice for the audiobook of the novel Aftermath: Life Debt, which was written by Chuck Wendig for The Aftermath Trilogy and released July 12, 2016.\n\n",
        "section": "Casting and portrayal[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 621.0
      }
    },
    {
      "id": "6301",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Personality and traits[]\n\nKanata was a humanoid alien who stood at a height of 1.24 meters (4 feet and 1 inch). She had brown eyes, wispy white hair, and burnt-orange skin. Her face was wrinkled by centuries of hearty laughter and kind smiles. Due to the pirate's millennia-long lifespan, decades were like brief moments in time for her.\n\nAs a poet and painter, Kanata took delight in all forms of art, so she offered board to traveling musicians in exchange for their performances. One such musician was Infrablue Zedbeddy Coggins, an alien who played the hypolliope horn cluster in a quartet alongside Taybin Ralorsa, Ubert Quaril, and Sudswater Dillifay Glon. Kanata also allowed a variety of scoundrels to stay in her castle, but only if they obeyed her prohibitions against war and politics, as well as her only spoken rule: \"All are welcome. (No fighting.),\" a mantra written in a hundred different languages on a wall beyond her bar. Individuals who broke the castle law were subjected to Kanata's sentences, which ranged from being locked in her dungeon to potentially being ejected from the airlock of the Tua-Lu. The hostess took a liking to one particular scoundrel, the Wookiee Chewbacca, whom she jokingly referred to as her boyfriend.\n\n",
        "section": "Personality and traits[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 299.0
      }
    },
    {
      "id": "6334",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - LEGO Star Wars[]\n\nIn The Resistance Rises, which is set after the Galactic Civil War, the pirate Bala-Tik meets with Kanata to complete a trade: a concealed item Kanata wants in her collection, for the location of Solo (who had cheated Bala-Tik out of rathtars). However, nearly everybody in Kanata's castle has been cheated by Solo, and the patrons begin to argue over who was swindled the worst. A brawl quickly erupts, and when Kanata's genuine \"Princess Leia Battle of Endor speeder bike\" breaks as a result, Kanata becomes enraged, retrieving the Skywalker lightsaber, cutting the ceiling's masonry to fall on her quarreling guests, and declaring the fight to be over. With the commotion stopped, a hooded individual tells the patrons that Solo's ship was last sighted on Jakku, and that the smuggler would not stay in one place for long. As the criminals race out the castle's door, Kanata approaches the figure, immediately recognizing him to be Lando Calrissian. The two collect the case Bala-Tik left behind and open it to reveal two musical instruments. Kanata begins to play, and she invites Calrissian to join, who gladly accepts.",
        "section": "LEGO Star Wars[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 269.0
      }
    },
    {
      "id": "6330",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - LEGO Star Wars[]\n\nOutside of the character's canonical appearances, Kanata appears in various LEGO releases, including LEGO Star Wars: The Freemaker Adventures, LEGO Star Wars: The Resistance Rises, and LEGO Star Wars: The Force Awakens. While these appearances are not a part of the official Star Wars canon, they are set in a unique, continuous universe.\n\nSet during the Galactic Civil War, The Freemaker Adventures shows Kanata meeting the titular Freemaker family when their ship, the StarScavenger, crashes outside her castle. The crash landing causes damage to a ship owned by the pirate Hondo Ohnaka, and the Dowutin Grummgar brings the pilot responsible, Zander Freemaker, into the castle to meet with the Weequay pirate captain. Encountering Ohnaka, Grummgar restrains Zander, and Ohnaka tells him that the damages must be paid for. Zander replies that he has no money, and Ohnaka replies that he will also accept blood, limbs, or next of kin as payment. Zander's younger brother, Rowan, attacks Grummgar, demanding that his brother be set free. Grummgar lifts Rowan up with one hand, and Ohnaka jokes that the boy would make a good crew member if he were taller. As Ohnaka laughs, Kanata notices the commotion and throws a mug at the pirate, hitting him in the head. Picking up another cup threateningly, Kanata walks toward Ohnaka, affirming that he will not cause any trouble in the castle, something he has done before. Stopping Ohnaka as he begins to act coy, Kanata comments that the last incident involving him had her pulling teeth out the castle walls for weeks. Agreeing to work out the problem peacefully, Ohnaka begins to make a deal with Kordi Freemaker, so Kanata leaves them and enters through a door to another room. However, as the door opens, Rowan senses a crystal of the Kyber Saber, an ancient Jedi weapon, and he follows Kanata. Just before Rowan enters the room, Kanata stops him, asking if he is lost and stating that only she is allowed in there. Rowan apologizes, saying he thought he felt something. Kanata inquires what he felt, but Rowan changes his mind and leaves.\n\nThe Freemakers embark on Ohnaka's mission to recover three golden orbs from the third moon of Takodana, but they choose to return empty-handed when they learn the orbs are varactyl eggs. When Kordi offers to try another deal instead, Ohnaka scoffs, and as he orders his crew to kill the Freemakers, Kanata enters the room and throws another mug at his head. Kanata, who overheard that Ohnaka sent kids to do a dangerous task, approaches the Weequay, again striking him with a mug and pushing him towards the castle's exit, telling him not to come back until she is no longer angry. When Ohnaka tries convincing Kanata to let him stay, she hits twice more before he leaves. Remarking that there is no decency left in the galaxy, she instructs the three Freemakers to follow her into the other room. Saying that their presence is bad for business, Kanata offers to provide them with what they need to leave the planet. Zander requests a quantum field regulator, and Kanata opens a drawer and asks him what type he needs. Slightly confused, Zander asks for a double-A type for a Class-D salvage ship, and to his surprise, Kanata removes one from the drawer. Running to the drawer, Zander asks what else she has, but Kanata dismisses him and turns her attention to Rowan. Commenting how she likes his smile and the way he confronted Ohnaka, Kanata opens a locked drawer and removes a Kyber Saber crystal. She presents it to the excited boy, explaining that she found it on Rodia ages ago. When Kordi asks how they can thank Kanata, the pirate says that they can leave. As she escorts them out the door, Kanata tells the Freemakers that they are nice kids, but that her castle is not a place for nice or kids. Rowan is the last to exit, and Kanata stops to tell him that searching for the Kyber crystals is a noble quest, adding that when they inevitably get desperate they should seek the \"Maker of Zoh.\" When Rowan asks what she means, Kanata acts senile, says bye, and hurries into her castle.",
        "section": "LEGO Star Wars[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 952.0
      }
    },
    {
      "id": "6320",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Deleted scenes and alternate stories[]\n\nIn the trailer for The Force Awakens, Kanata is heard asking Rey who she is, to which the girl responds, \"I'm no one.\" Although the piece of dialogue was cut from the final edit of the film, it appears in The Force Awakens: Rey's Story, a junior novel adaptation written by Elizabeth Schaefer. In this version, Kanata is introduced to Finn and Rey, and when Rey reveals herself to be a scavenger, Kanata excitedly deduces that the girl knows machines. Enthusiastically, Kanata tells Rey that each component of a machine has a purpose for being, and the diminutive pirate asks Rey what her purpose is.\n\nAnother scene removed from the film, titled \"Tunnel Standoff\", begins with Kanata, Solo, Finn, and Chewbacca hurrying from the storeroom in Kanata's castle, when they are found by stormtroopers. Ordered by Supreme Leader Snoke to take the four as prisoners, the stormtroopers command Solo, Finn, and Chewbacca to surrender their weapons. However, Solo plays coy, mispronouncing \"Snoke\" as \"Smoke\" and asking what makes him \"supreme.\" The lead stormtrooper again orders Solo to hand over his blaster, and Solo replies that \"it's broken.\" According to Chris Corbould, the special effects supervisor for The Force Awakens, the rough cut of this scene concluded with Kanata using the Force to collapse the ceiling on the First Order troops.\n\nIn a third deleted scene which followed the attack on Kanata's castle, the character travels to the Resistance base on D'Qar and presents Skywalker's lightsaber to Organa; a prominent shot of this scene was used in The Force Awakens' second teaser trailer. However, Abrams realized that the scene was unnecessary, saying that Kanata would have had nothing to do at the base, and it would not have added to the story.\n\nThe reference books Star Wars: The Force Awakens: The Visual Dictionary and Star Wars Character Encyclopedia: Updated and Expanded mention that Kanata hadn't seen Han Solo in 25 years before he visits her castle in The Force Awakens. Lucasfilm Story Group member Matt Martin stated that he felt that the statement was based on a line of an early draft of The Force Awakens but was removed, but still made it into those books due to those timelines.\n\nIn a limited-time promotion for the mobile game Star Wars: Commander, a series of missions titled \"Maz's Objectives\" was made available on March 24, 2016. The objectives were eligible to players with a headquarters of level four and up, and completing a mission set awarded players with unique Supply Crates called \"Maz's Curio Boxes\", which contained new playable units. For players allied with the Rebel Alliance, the Curio Boxes contained \"Ithorian Infiltrators\", while players allied with the Galactic Empire received \"Kubaz Invaders. These objectives were entirely optional, and not required to complete the campaign mode\"\n\nMaz Kanata was originally set to appear in a cancelled episode of Star Wars Resistance, which was scripted for the second season but cut due to Disney's budgetary issues.\n\n",
        "section": "Deleted scenes and alternate stories[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 667.0
      }
    },
    {
      "id": "6307",
      "title": "Maz Kanata",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conflicting sources",
          "Articles in need of updating",
          "18 more",
          "Articles with gameplay alternatives",
          "Artists",
          "Business owners and executives",
          "Collectors",
          "Crime lords",
          "Entrepreneurs",
          "Females",
          "Force-sensitives",
          "Gamblers",
          "Humanoids",
          "Individuals of unidentified species",
          "Individuals with she/her pronouns",
          "Maz Kanata's crew",
          "Pirate monarchs",
          "Poets",
          "Smugglers",
          "Takodana residents",
          "Treasure keepers"
        ],
        "content": "# Maz Kanata - Powers and abilities[]\n\nFrom her castle, Kanata witnessed the rise and fall of galactic powers, which she attributed to the delicate balance between the light and dark sides of the Force. Although Kanata chose not to train as a Jedi, she had a strong connection to the Force, giving her the preternatural gift of sensing changes of fortune throughout the galaxy. Kanata's powers also allowed her to feel the presence of others, demonstrated when she sensed Solo's return.\n\nIn addition to speaking Galactic Basic Standard, Kanata could speak an alien dialect.\n\n",
        "section": "Powers and abilities[]",
        "source": "https://starwars.fandom.com/wiki/Maz_Kanata",
        "title": "Maz Kanata",
        "tokens": 117.0
      }
    },
    {
      "id": "7489",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Escaping Corellia[]\n\nThey are soon pursued by Moloch's A-A4B truckspeeder, which is also carrying two Corellian hounds. Moloch rams his truckspeeder against Han's landspeeder. After narrowly avoiding a truck, Han drives through an Imperial checkpoint. An RA-7 protocol droid objects to their intrusion but is rolled over and decapitated by Moloch's truckspeeder. When Qi'ra says that Moloch is fast, Han reassures her that they are faster. Han's landspeeder and Moloch's truckspeeder is pursued by an Imperial patrol trooper on riding a C-PH patrol speeder bike. However, the rider crashes into a barrier.\n\nHan and Qi'ra drive through a factory with Moloch hot on their tail. Han manages to escape Moloch's truck by driving the landspeeder through a tight corner. With the landspeeder stuck, Moloch dispatches Rebolt and the Corellian hounds after them. Han and Qi'ra managed to reach the Coronet spaceport on foot. There is a strong Imperial military presence at the spaceport, where there are long queues offworld. They witness several people including a family being arrested by stormtroopers.\n\nHan and Qi'ra join a queue. Qi'ra is worried about being trafficked by the Crimson Dawn but Han vows to protect her. Since they don't have identification, Han and Qi'ra use the coaxium vial to bribe the Imperial Emigration Officer Falthina Sharest into letting them through the customs booth. After depositing the coaxium, Han manages to cross through. Before Qi'ra can cross into the other side of the terminal, she is apprehended by the White Worms enforcers Rebolt and Syke. Qi'ra tells Han to flee and he vows to return for her.\n\nHan manages to evade Imperial forces and the White Worms by donning a stolen hat and hiding behind several crates. He witnesses more people being arrested by stormtroopers. Lacking sufficient funds to travel offworld, Han finds an Imperial Military recruiting post. Han speaks to the Imperial recruitment officer Drawd Munbrin and volunteers to join the Imperial Navy as a pilot. Since Han lacks a surname and family, he dubs him \"Han Solo\" in absence of a surname. Approving Han's application, he tells Han to proceed to Transport ID-83 to the Imperial Flight Academy on Carida, promising Han that he will be flying in no time.\n\n",
        "section": "Escaping Corellia[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 526.0
      }
    },
    {
      "id": "7495",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Beckett's gamble[]\n\nAfter Han and Chewbacca's escape from Mimban, Beckett takes the transport hauler to the snowy, mountainous world of Vandor. While watching over the snowy mountains from the hauler, Han thanks Chewbacca for saving him. Han says that only took the Wookiee because of him. He tells Chewbacca of his plan to do one job with Beckett's gang in return for their freedom. Chewbacca accepts the deal. Han asks Chewbacca what is his name and settles for \"Chewie,\" finding it easier to say than his full name in Shyriiwook.\n\nAfter landing, Beckett enlists the two for a planned to steal a shipment of the hyperfuel refined coaxium from a 20-T Railcrawler conveyex transport on Vandor. While surveying the train tracks from the distance, Beckett outlines his plan which involves hitting the conveyex between the tower and the bridge. Rio drops them onto the conveyex so that they can separate the payload container and lift it up onto the AT hauler. Rio jams their communications signals while Val blows up the bridge, allowing them to fly away. On the night before the heist, Beckett warns the gang of the threat posed by Enfys Nest and the Cloud-Riders.\n\nWhile resting by the campfire, Val is critical of Beckett for enlisting Han and Chewbacca, whom she regards as amateurs. Beckett defends his plans as a means of settling their debts. At the campfire, Beckett and his associates question Han about his motives. Han tells them about his plans to become a pilot and go back and find Qi'ra. Rio says he prefers to be tied to anyone while Val talks about her relationship with Beckett. Chewbacca says that he is searching for his family. Beckett promises Han and Chewbacca that they will have more than enough to buy their own ship if they follow his instructions.\n\n",
        "section": "Beckett's gamble[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 410.0
      }
    },
    {
      "id": "7493",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Meeting Chewbacca[]\n\nSeeking an opportunity to rid his unit of a \"trouble-maker\", Bolandin has a chained Solo thrown into a pen where he is condemned to battle a \"beast\" held in captivity. Two Imperial Army trooper sentries joke that they haven't fed the beast in three days and that it should be fun. The beast is revealed to be a Wookiee named Chewbacca, whose species has been enslaved by the Empire. Thinking he is a threat, Chewbacca attacks Han and hurls him against the girders and mud.\n\nOwing to Han's ability to speak Shyriiwook, Solo convinces Chewbacca that he is a friend. Working together, the two stage a fight for the benefit of their captors after discovering that one of the pillars supporting the mesh above their cell is weak. The unsuspecting sentries laugh and think that Han is doomed. After several attempts, Han pretends to goad Chewbacca into pushing against the main pillar supporting the mesh, causing to collapse. After jumping out of harm's way, Chewbacca throws Han out of the pit and follows suit.\n\nThe two find that they are chained together. Chewbacca wants to flee the camp but Han convinces him to escape him to a nearby airfield. He tells Chewbacca to trust him, promising him that they can go their separate paths if he chooses after that. Meanwhile, Beckett's gang board their stolen Y-45 armored transport hauler. Throwing off his Imperial army helmet and uniform, Rio asks how they can breathe in these stuffy suits. The three take off but Beckett spot Han and Chewbacca waving to them below.\n\nRio is impressed by Solo's determination and thinks that a Wookiee will be helpful as muscle. Val is opposed but Rio convinces Beckett to bring the ship down so that they can pick up Han and Chewbacca. The five depart Mimban in the stolen hauler. Han takes a shower in the shower unit. When Chewbacca steps in, Han suggest that they could have done it one at a time. Chewbacca roars.\n\n",
        "section": "Meeting Chewbacca[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 449.0
      }
    },
    {
      "id": "7497",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Heist on Vandor[]\n\nWhile Rio flies the Y-45 hauler, Han, Chewbacca, and Beckett land on the cargo wagon carrying coaxium while Val sets up position on the bridge. Beckett and his team's presence soon draws the attention of Imperial range troopers, who exchange fire with them. As the conveyex train navigates a narrow cliff face, Han and Chewie narrowly escape being crushed against rocks. Working together, the two managed to detach the coaxium wagon from the rear line.\n\nKeeping in touch with Beckett, Rio lowers the \"witch cables\" onto the coaxium wagon. Before Beckett's gang can escape with the stolen coaxium, the group is attacked by the Cloud-Riders, who ride swoop bikes. The Cloud Riders' leader Enfys Nest orders her followers to lower their harpoons. Han and the others dodge blaster fire. One of the swoop bikes crashes against a rock. Two of the Cloud-Riders board the Y-45 hauler and fatally wound Durant. Solo leaves Chewbacca to uncouple the wagon from the front train while he goes to help Rio.\n\nSolo manages to climb aboard the transport hauler and fly the ship, tripping a security sensor as he gains control. Val warns Han that Viper probe droids are heading his way. As the skirmish continues Val, who is stationed on top of a nearby bridge, uses her vantage point to distract and fend off several security viper probe droids. With his dying breath, Durant apologizes to Solo for mocking his flying abilities and tells him that Val was right in her belief that no one should die alone. Beckett fights with Enfys Nest on top of the wagon.\n\nHowever, the conveyex is rapidly approaching the bridge and Val realizes that there is not enough time for her to abandon her position without letting the crew steal the coaxium wagon. After telling Beckett of her change of plans via comlink, Val professes her love for him before detonating the bomb, killing herself and destroying the bridge. The destruction of the bridge causes the conveyex to plunge into a deep gorge. After a struggle, Chewbacca manages to detach the coaxium wagon from the rest of the train.\n\nHowever, the Cloud-Riders have attached grappling hooks to the wagon, dragging it down. Not wanting to risk the lives of Beckett and Chewbacca, Solo makes the difficult decision to let go of the coaxium wagon; which plunges into the ravine below and explodes. Chewbacca grabs Beckett and the two survive by clinging on to the cable.\n\n",
        "section": "Heist on Vandor[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 537.0
      }
    },
    {
      "id": "7491",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Ordeals on Mimban[]\n\nThree years later, Han has been expelled from the Carida Flight Academy for insubordination, and is serving as a Mudtrooper Corporal during a battle on the planet Mimban. Solo's 224th Imperial Armored Division is locked in trench warfare against the Mimbanese Liberation Army, enduring heavy casualties in the torrid, muddy weather.\n\nHan takes part in a ground assault led by Major Staz to capture a ridge. After Han is thrown to the ground, Staz helps him to the ground and tells him they are almost there. Solo is confused but Staz tells him to head to the last ridge. Staz is soon killed by an explosion. Han and some surviving troops including Private Collum Woslo, Corporal Sharlu Greslin, Corporal Danith Nodar, and Corporal Wesger Odry gather in a trench with \"Captain\" Tobias Beckett, who takes command as the most senior officer in the group. Beckett leads the soldiers into action and they take out the last resistance in the ridge.\n\nFollowing the skirmish, Han speaks with \"Captain\" Beckett, thanking him for his help. Beckett advises him to get away from here as fast as he can. Solo soon encounters Beckett's companions Val and the Ardennian Rio Durant, who are disguised as Imperial Army troopers. They tell him not to follow them. Lieutenant Alayus Bolandin tells Han and his comrades that they will be moving out to the Southern Marshlands in three hours. When Bolandin requests an advance party, Solo questions why the Empire is destroying and occupying Mimban, earning the enmity of his commanding officer.\n\nDisenchanted with the Empire, Han seeks out Beckett and his gang, who are planning a heist. Han recognizes them as thieves who are posing as Imperial Army personnel. Val and Beckett want to kill Han but he offers his services as a pilot. When Rio asks what is a fancy \"fly boy\" doing in the mud, he claims he was kicked out for having a mind of his own. Han points out that Rio is an Ardennian. Desperate to escape offworld, Solo tries to blackmail them into allow him to join their gang by threatening to expose them as infiltrators. However, Beckett turns the tables on him and convinces Lieutenant Bolandin that Solo is trying to desert.\n\n",
        "section": "Ordeals on Mimban[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 497.0
      }
    },
    {
      "id": "7485",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Defying Lady Proxima[]\n\nSix years after the formation of the Galactic Empire, on the shipbuilding world of Corellia, a human \"scrumrat\" and aspiring pilot named Han and his love interest Qi'ra long to escape the clutches of the Grindalid crime boss Lady Proxima's White Worms crime syndicate. Following a delivery job that went awry, Han flees some criminals on his M-68 landspeeder through the streets of Coronet City. He drives through a bridge and hangs his dice on the windscreen.\n\nArriving at the Den of the White Worms, he and the other Scrumrats are herded by Lady Proxima's enforcers into her underground chamber. Three children fight over stolen items they had pick-pocketed. Han and Qi'ra embrace each other in a tunnel. He tells Qi'ra that he managed to steal a vial of hyperfuel coaxium and plans to use it as their ticket offworld. Moloch, Syke, and Rebolt soon catch up with them and bring Han before Lady Proxima, who lives underwater.\n\nIn the Scrumrats and her enforcers, she asks Han for a progress report. He claims that the other criminals kept his money and coaxium but that he learned a \"very valuable lesson\": that we cannot trust those \"guys.\" Lady Proxima is furious that Han came back with nothing from his errand. Rebolt beats Han with a stick. A defiant Han grabs Rebolt's stick and says that he will beat those who beat him. Moloch raises his blaster at Han but Qi'ra stops him. Lady Proxima warns Qi'ra not to disobey her.\n\nHan pulls out a rock and claims to have a thermal detonator but Proxima is not fooled. Han reveals that it was a bluff and hurls the rock through the ceiling, letting in a beam of sunlight. Exposed to the beam, Proxima is badly burned in the face and dives beneath the pool. Han and Qi'ra escape in Han's stolen M-68 landspeeder and race out of the White Worms' den into the streets of Coronet. Han's plan is to drive to Coronet Spaceport with the stolen coaxium and use it to bribe their way offworld. Han vows to be a pilot and see the galaxy. Qi'ra hopes they will get their own starship and no longer be told what to do.\n\n",
        "section": "Defying Lady Proxima[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 511.0
      }
    },
    {
      "id": "7499",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - An audience with Dryden Vos[]\n\nFollowing the failed heist, Beckett erects a hasty memorial to Val and Rio. Angered by Solo's decision to drop the cargo, Beckett strikes him in the face. Beckett reveals he was ordered to steal the coaxium in order to repay his debt to Dryden Vos, leader of the Crimson Dawn criminal syndicate. Han proposes deserting but Beckett counters that Vos sends out bounty hunters to hunt down those who have crossed him. Beckett says that the only thing they can do is go to Vos and make amends. Han agrees to come along in order to make things right and exacts a promise from Beckett to pay him and Chewbacca for their services. Chewie agrees to come along.\n\nBeckett, Han, and Chewie travel to the outskirts of Fort Ypso, where Vos' yacht First Light has arrived. After surrendering their weapons to Captain Aemon Gremm, they enter the public gallery. Beckett's team enters the yacht's hallway. Beckett speaks to Vos' concierge Margo, seeking an audience with Dryden Vos. She tells him that Vos is having an audience with Governor Diles Anevi, whom Vos kills. Captain Gremm informs Vos of Beckett's presence.\n\nBeckett advises Han and Chewbacca to keep their eyes down because the people here are not their friends, gesturing to the wealthy people around them, eating and drinking the most expensive, tasty and quality food available. Han has an unexpected reunion with Qi'ra, who now works for Vos. The two drink together while reminiscing about their past and ambitions. Beckett soon arrives with Vos and introduces Han and Chewie to him. Vos reveals that Qi'ra is his top lieutenant. After exchanging pleasantries, Vos chastises Beckett for underestimating Enfys Nest and tells Beckett to give him a reason not to kill them.\n\nSince the few available stocks of coaxium are in Imperial hands, Han proposes stealing unrefined coaxium from Kessel, where the Pyke Syndicate runs a mining operation. While Vos is unwilling to jeopardize his syndicate's business relations with the Pykes, Han and Beckett inform him that they have no alliance with the Pykes and taking on the operation themselves would not implicate Crimson Dawn. Qi'ra is supportive of Han's idea but warns that the unstable coaxium must be brought to a processing facility quickly before it deteriorates. Beckett suggests Savareen since it is not under Imperial control. Vos approves of the plan but sends Qi'ra to keep an eye on Han and Beckett. In the turbolift, Beckett says that he can provide the gear while Qi'ra offers to provide the ship.\n\n",
        "section": "An audience with Dryden Vos[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 590.0
      }
    },
    {
      "id": "7512",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Heist and the slave uprising[]\n\nIn the mines, a disguised Han and Chewbacca mingle among the slaves and guards. L3-37 speaks to the WDD adminmech DD-BD and frees him of his restraining bolt. She convinces him to free his droid brethren while she directs Han and Chewbacca to the thermal vault. The liberated droids free the slaves of their remotely controlled restraints and chains, sparking a droid and slave uprising in the mines. As they approach the vaults, Chewbacca breaks off to free a Wookiee slave named Sagwa. Han passes Chewie a pike, which he uses to attack the Pyke guards beating Sagwa.\n\nFollowing Beckett's directions, Han reaches the vault and incapacitates the guard. After L3-37 unlocks the vault, Han steals 12 unrefined coaxium canisters. Meanwhile, Lando reminisces on the fifth chapter of the Calrissian Chronicles, which deals with his encounter with the Sharu. Lando is distracted by the noise resulting from the uprising and L3-37 tells him that she found her true purpose. Han struggles to push a sled carrying the canisters but is noticed by the Pyke guards. Chewbacca comes to the rescue and takes out the guards with his pike. Sagwa and Chewie help Han to push out the canisters.\n\nLando exits the Millennium Falcon to join the battle as Han and the rest of the team fight their way out with the liberated slaves and droids. Han and Lando shoot several Pyke sentries. Beckett and Qi'ra exit the mines. L3-37 cheers. While Chewbacca and Sagwa load the coaxium canisters aboard the Falcon, Han and the others exchange fire with Pyke sentries, who have brought a sonic cannon. Before they can leave, L3 is fatally damaged by gunfire. A grieving Lando comes to the aid of the dying L3-37, who succumbs to systems failure. Lando is hit and Han comes to his aid, driving the sentries away.\n\nA slave named Tak leads the slaves to safety. Chewbacca embraces Sagwa before leaving with Han and Lando. Chewbacca carries a wounded Lando aboard the Falcon while Qi'ra takes out the Pyks' sonic cannon with a grenade, which causes an inferno. While a distraught Lando cradles a disintegrating L3, Beckett orders Han to get them out of Kessel. Han flies the Falcon out of the mine into the skies of Kessel. While Lando mourns the loss of L3-37, Qi'ra volunteers as Han's co-pilot. They are joined by Chewbacca while Beckett seals the hidden storage compartment containing the coaxium.\n\n",
        "section": "Heist and the slave uprising[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 581.0
      }
    },
    {
      "id": "7509",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Infiltrating Kessel[]\n\nAs they approach Kessel, Beckett briefs the team about their plan to reach the thermal vault where the coaxium is stored. He warns everyone to stick to the plan. The Falcon lands in a clearing at the base of the mine where they are greeted by several Pykes including Capo Quay Tolsite. Qira' poses as the slaver Oksana Floren, Deputy Assistant to the Vice Admiral of the Federation of Trade Route Allocation and Monetization. Han and Chewbacca pose as slaves while Beckett poses as a helmeted \"security attache.\" L3-37 poses as a servant droid.\n\n\"Floren\" meets with Capo Tolsite and offers to trade the Federation's slaves in return for the Pyke Syndicate's spice. One of the Pyke sentinels forces Chewbacca and Han Solo to their knees with a pike and inspects them. Tolsite sends Han and Chewbacca to be clipped. Before leaving, Qi'ra punches Han in the gut but discreetly passes him his lucky charm. Qi'ra, L3-37, and Beckett accompany the Pykes into Tolsite's control room while Han and Chewie are led into the mines. L3-37 translates for Tolsite, who cannot speak Galactic Basic.\n\nQi'ra watches with concern on the surveillance cameras as Han and Chewie are beaten by their Pyke captors. Tolsite insists that \"Floren's\" \"security attache\" wait outside his office. While Tolsite is not looking, Han and Chewie turn the tables on their guards as the camera feed fades. Han knocks out his guard but Chewie ends up pulling the arms off his captors. Back in the control room, Beckett tricks two guards into holding his pike and then shoots them. While Beckett eliminates the remaining guards, Qi'ra defeats and kills Tolsite using the martial arts Teräs Käsi, which Dryden taught her. L3-37 is impressed with Qi'ra's combat skills.\n\n",
        "section": "Infiltrating Kessel[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 438.0
      }
    },
    {
      "id": "7531",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Rematch with Lando Calrissian[]\n\nElsewhere, Han and Chewbacca soon track down Lando to a jungle outpost on Numidian Prime, where Lando is regaling patrons about his adventures in StarCave Nebula. Han chides Lando for leaving them on Savareen before embracing him. When Lando asks for his cut, Han replies he is not getting any since they barely survived their last adventure. After exchanging pleasantries, Han again challenges Lando to a sabacc game for possession of the Falcon. Han had previously subtly relieved Lando of the cards stashed up his sleeve  thereby preventing Lando from cheating which allows Han to win the game.\n\nAfter acquiring the Falcon, Han tells Chewbacca that he plans to go to Tatooine, where Beckett told him that a gangster is putting together an organization. The Falcon then jumps into hyperspace.\n\n",
        "section": "Rematch with Lando Calrissian[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 192.0
      }
    },
    {
      "id": "7537",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Origins[]\n\nThe earliest incarnation of a live-action depiction of young Han Solo came during the pre-production of Star Wars: Episode III Revenge of the Sith. Writer and director George Lucas conceived an idea of Solo as a child on Kashyyyk, with Chewbacca raising the young boy like a son. Solo would have been present during the Battle of Kashyyyk and would have encountered Yoda, helping the Jedi Master discover scraps of a droid that could have aided Yoda in determining the whereabouts of General Grievous. Concept art from Iain McCaig showed the young Solo as a slob, a juxtaposition of the character in his later years. \"He's such a persnickety guy later — he always has to have the best of everything,\" McCaig said in The Art of Star Wars Episode III: Revenge of the Sith, \"so I thought it'd be great if when he was a kid, he was an absolute slob.\" These concepts never made it out of pre-production, and Solo did not appear in Revenge of the Sith—though Chewbacca ultimately did make a cameo appearance during the battle.\n\nAfter the release of Revenge of the Sith, Lucas began planning a live-action television series called Star Wars: Underworld, set between Revenge of the Sith and A New Hope. The unproduced series, dealing with elements of the criminal underworld, could have included some of Solo's backstory. According to Stephen Scaia, the show's writers came up with a story for how Solo met Chewbacca. Another story would have dealt with how Solo first met Lando Calrissian, who first appeared in Star Wars: Episode V The Empire Strikes Back.\n\n",
        "section": "Origins[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 351.0
      }
    },
    {
      "id": "7527",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Han's \"triple-cross\"[]\n\nOne of Vos' guards raises a sword. Beckett says that he tried to warn Han about her. However, Han responds that he was paying attention to Beckett's advice and knows that people are predictable. Meanwhile, the Hylobon Enforcers discover that the coaxium containers are empty and that the \"Cloud-Riders\" are villagers serving as decoys. The real Cloud-Riders including Enfys Nest and Auromae Iselo soon emerge from hiding and ambush Vos' Enforcers. One fires a rocket launcher at the enforcers, disorientating them. The Cloud-Riders disarm and subdue Aemon and his enforcers.\n\nBack aboard the First Light, Han mockingly asks Vos if he sent all his enforcers. Beckett realizes that the real coaxium is with Solo. Abandoning Vos, Beckett shoots the two remaining guards and forces Han at gunpoint to load the coaxium into the case. He also takes Chewbacca hostage and leaves with the coaxium containers. A furious Vos warns Beckett he is making a big mistake, but the criminal ignores him before traveling down the turbolift with Chewie and the coaxium.\n\nOnce Beckett has left, Han grabs his blaster and fires at Vos, who retrieves a pair of custom Kyuzo petars. Vos attacks Han with his Kyuzo petars and manages to knock the blaster out of his hand. Vos chases Han around the room, hurling his daggers. While Han is distracted with Vos, Qi'ra draws a sword and manages to pin Solo to the ground, knocking the blaster out of his hand. Qi'ra apologizes while Vos says that Qi'ra is loyal to Crimson Dawn.\n\nHowever, Qi'ra quickly reveals that it was a ruse and strikes the unsuspecting Vos with her weapon. Vos fights back with his Kyuzo petars but Qi'ra gains the upper hand and kills him by slashing him in the chest. Qi'ra tells Han to go after Chewbacca and Beckett, telling him that if they give their coaxium to Enfys, they will need something else to buy a new ship. Before parting company, Qi'ra embraces Han and reminds him to look after Chewbacca and to smile. She tells him that she is right behind him.\n\n",
        "section": "Han's \"triple-cross\"[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 507.0
      }
    },
    {
      "id": "7502",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Finding a ship[]\n\nKnowing that they would need a fast ship for the Kessel heist, Qi'ra takes Solo and his companions to The Lodge at nearby Fort Ypso. There, she introduces the team to Lando Calrissian, an accomplished smuggler and pilot who reportedly won his ship in a game of sabacc. Walking past two dueling droids, they find Lando playing sabacc with several alien patrons. Against Qi'ra and Chewbacca's advice, Han challenges Lando to a game of sabacc, seeking to win his ship.\n\nHan wins the first round and collects several credits. While Han and Lando are playing, the Cloud-Rider Weazel is spying on them. Han agrees to a second round and places a wager on Lando's ship, reputed to be the fastest in the galaxy. However, Lando uses a sleight of hand to win. Following the game, Lando speaks with Qi'ra, who tells him that they need a ship capable of doing the Kessel Run. Beckett manages to convince Calrissian to join the mission in exchange for 25 percent of the profits. While chatting with Calrissian, Beckett recalls killing the bounty hunter Aurra Sing during a skirmish.\n\nHan and his companions also encounter Lando's droid co-pilot L3-37, who has a female programming and is an avowed droid rights advocate. L3-37 objects to the droid fighting pits at the Lodge and picks a fight with the owner Ralakili, who objects to her trying to stop his droids from fighting. L3-37 almost chokes Ralakili but Lando convinces her to let him go. Despite L3-37's misgivings about the newcomer, Lando and the others set out for Lando's ship, which has been impounded.\n\nAfter L3-37 cuts a hole through the gate, Lando shows Han and his companions his ship, the Millennium Falcon. Lando has refurbished the ship, including installing an escape pod and wet bar. Beckett agrees to remove the gravity lock in return for taking five percent off Lando's cut, reducing it to 20 percent. Lando reluctantly agrees to Beckett's deal. As the Falcon disembarks, Weazel informs Enfys Nest that they have planted a homing beacon on the ship. Enfys gambles that if they survive, they will bring the price to them.\n\n",
        "section": "Finding a ship[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 517.0
      }
    },
    {
      "id": "7524",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Beckett's betrayal[]\n\nWhen Dryden Vos lands on his yacht First Light by the Pnakotic Coast, Han along with Qi'ra and Chewbacca go to deliver the purportedly \"fake\" coaxium canisters to the Crimson Dawn crime lord. Entering the ship, a masked guard welcomes Qi'ra home and tells her that Vos is waiting for them. When he asks about Han and Chewie's weapons, Qir'a vouches for them. The trio travel up the turbolift. Han is confident of winning, but Qi'ra says that the trick is surviving rather than winning.\n\nReaching Vos' living room, they are greeted by Vos, who seems pleased with their plan. Qi'ra claims that Beckett did not survive while Han claims that Beckett died saving his life on Kessel. Vos expresses admiration for Beckett's principles and thanks Han and his team for following his example. Qi'ra claims Han and Chewbacca would make good mercenaries with their own ship. Vos is pleased that his top lieutenant Qi'ra survived.\n\nWhen Han asks for payment, Vos asks to see the coaxium. Han opens the storage vial and brings out a sample of the processed coaxium. When Vos asks to see one, Han claims its volatile but complies when Vos insists. Vos surprises Solo's team by announcing that the coaxium is fake and reveals that he is aware of Han's plan to sell the real shipment to the Cloud-Riders. Han thinks Qi'ra betrayed him, but Vos responds that Qi'ra has a weak spot for Solo.\n\nVos then reveals his \"inside man\" as Beckett, who walks into the living room. After \"apologizing\" to Han, Beckett reminds him about his \"lesson\" not to trust anybody. Beckett orders Han to surrender while a guard checks the lid. A defiant Han responds that it is too late because Enfys Nest has it. Beckett responds that they have figured that as Captain Aemon Gremm and his Hylobon Enforcers storm the nearby village, capture the masked \"Cloud-Riders\", and seize the coaxium containers. Vos asks Qi'ra what to do with the \"traitor\" Han. Qi'ra responds that she would want to know why and to prove their loyalty by sacrificing something they loved.\n\n",
        "section": "Beckett's betrayal[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 497.0
      }
    },
    {
      "id": "7508",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Voyage to Kessel[]\n\nWhile traveling aboard the Falcon, Han tells Lando that he recognizes the ship as a YT-1300 light freighter because his father worked at a CEC plant before he got laid off. Solo's dad built this and wanted to be a pilot. Lando remarks that his mother was the \"most amazing woman\" he had ever known. L3-37 arrives and ushers Solo out of the co-pilot seat. She sets a hyperspace course for Kessel and they jump into lightspeed. Lando explains that they have to travel through the Akkadese Maelstrom to reach Kessel.\n\nMeanwhile, Beckett plays dejarik with Chewbacca. Beckett uses one of his pieces to take out one of Chewbacca's pieces, angering the Wookiee who slams his fists on the hologram set. Beckett schools Chewbacca that he has to think a few steps ahead. Han asks if they have seen Qi'ra but Beckett replies that people are predictable. Han walks to Qi'ra's quarters where she is trying on a blue cape. Qi'ra asks Han about his plan for Kessel. He wants to ask her about her experiences following their separation on Corellia but Qi'ra is not interested.\n\nHan gives Qi'ra a passionate kiss and the two embrace. Beckett walks in on them and reminds them that they have got a lot of work to do. In private, Beckett tells Han that he is making a big mistake by trusting Qi'ra. He tells Han that him and Chewbacca would make a good crew but doesn't trust Qi'ra. Beckett advises Han to trust nobody and to assume that everyone will betray him. Han thinks this is a lonely way to live but Beckett says this is the only way.\n\nLando and L3-37 take the Falcon out of hyperspace and arrive outside the Akkadese Maelstrom. Lando goes to check on the \"damps\" and asks if L3-37 needs anything. She sarcastically replies \"equal rights\" as the ship travels through the stormy cluster. When Qi'ra arrives in the cockpit, L3-37 explains that the sound is caused by carbonbergs, planet–sized objects crashing into each other. She warns that it is dangerous for ships to travel through the Maelstrom. L3-37 asks Qi'ra about her plan and notices the brand on her hand. When L3-37 points out that Han is in love with Qi'ra, she denies it but L3-37 confides that Lando is infatuated with her but that she doesn't share the same feelings for her master.\n\n",
        "section": "Voyage to Kessel[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 563.0
      }
    },
    {
      "id": "7515",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Completing the Kessel Run[]\n\nAs they approach the Akkadese Maelstrom, Lando warn them that they have to hurry due to the volatile nature of the unrefined coaxium. The Falcon soon encounters an Imperial Star Destroyer, which has exited hyperspace in response to the rebellion on Kessel. Lando wants to drop the shipment but Qi'ra warns that that Dryden will kill them if they fail. Seeking to recover the Falcon's stolen coaxium cargo, the Star Destroyer dispatched several TIE fighters and heavy fighters in pursuit of the freighter.\n\nHan flies the Falcon around the Star Destroyer and the Imperial TIE fighters give chase. Due to the highly volatile nature of the unrefined coaxium, Lando estimates that completion of the Kessel run is impossible before the fuel detonates - the conventional route having never been done in less than twenty parsecs. Han proposes taking a short cut through the maelstrom, which Lando regards as suicidal. Han convinces Lando to download L3's neural cords, which contains her navigational data, into the Falcon's systems.\n\nHan takes the Falcon and its TIE pursuers through the dangerous storm clouds of the Akkadese Maelstrom while Beckett mans the ship's ventral laser cannon, taking out two TIE fighters. However, a third fighter manages to evade Beckett's laser cannon and inflicts damage on the top of the Falcon's hull, causing Lando to fall. Han rolls the Falcon, striking the TIE fighter with its side and sending it into an asteroid. More TIE fighters continues the pursuit, prompting Han to state they needed to divert power to the rear shield generator. Chewbacca does so, causing Han to ask when he learned to fly. Chewbacca responds that he is 190 years old.\n\nQi'ra checks on Lando in the passenger area and uses one of his red capes to douse a fire despite his protests. A TIE fighter manages to shoot the Falcon's rear ventral cannon, causing it to break off. Han flies the Falcon deeper into the Maelstrom with the TIE hot on his tail.\n\nMimicking a move copied from a Corellian street racer, Han gets Chewbacca to deploy the landing gear as the Falcon scrapes against the surface of an asteroid. This damages the landing gear but uproots rocks and debris, one of which breaches the TIE fighter's cockpit. Han then takes the Falcon deeper into the Maelstrom. Meanwhile, Lando and Qi'ra manage to retrieve L3's internal processor. Beckett observes the coaxium vials becoming more unstable and alerts the others. Lando and Qi'ra manage to install L3's processor into the Falcon's systems.\n\nAs they reach the Maw Cluster, L3 constructs a model of the Akkadese Maelstrom and warns them that they are approaching a massive summa-verminoth. Face to face with the monster, the crew tries to escape, only to end up at a large gravity well which Lando identifies as the Maw. Thinking fast, Han ejects the Falcon's escape pod into the well for the summa-verminoth to follow, and the beast takes the bait. Guiding the ship's systems, L3 finds a way out 90 degrees to the left.\n\nHowever, the Falcon is trapped in the gravity well. Qi'ra and Lando convince the rest of the team to inject a drop of coaxium into the fusion core to give them the kick needed to escape the gravity well. Carrying out their plan, Beckett retrieves a drop of coaxium. Meanwhile, the summa-verminoth is pulled into the Maw and ripped apart. At Solo's command, Beckett boosts the ship's fusion core with a drop of coaxium, which briefly supercharges the engines. Despite a false start, the hyperdrive comes online and the Falcon jumps into lightspeed before the Maelstrom closes on them.\n\n",
        "section": "Completing the Kessel Run[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 821.0
      }
    },
    {
      "id": "7522",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Confronting the Cloud-Riders[]\n\nWhile walking through the village, Han and his companions notice that much of it lies in ruins and that the inhabitants are impoverished. While visiting a bar run by Kenholdt Ransard, the group are surrounded by Enfys Nest and her Cloud-Riders. Han tries to lift his blaster out of his holster but Beckett counsels him not to. Solo attempts to intimidate the Cloud-Riders by claiming to have a complement of armed mercenaries aboard the Millennium Falcon. However, Lando takes off aboard the Falcon, leaving Han and his companions behind.\n\nBeckett claims that Crimson Dawn will be here by the time the coaxium has been refined and dares them to kill them. Qi'ra proposes a compromise, but Beckett dismisses the Cloud-Riders as marauders who only know how to kill. However, Enfys Nest steps forward to face Beckett and removes her mask, revealing herself as a young human girl. She walks past a shocked Beckett and tells them that she needs a drink.\n\nInside the bar, Enfys tells Han and his companions how the Crimson Dawn originated from a band of mercenaries who plundered a planet. When the inhabitants rebelled, the mercenaries responded by cutting off the tongues of every last man, woman, and child. Enfys explain that she and the Cloud-Riders are from populations who have been terrorized by the Crimson Dawn and the other Five Crime Syndicates. She warns Han and his companions that the Crimson Dawn will use the stolen coaxium to plunder more systems. When Han asks what the Cloud-Riders will use the coaxium for, she tells them that they need the coaxium for their rebel cause.\n\nSympathetic to the Cloud-Riders' cause and plight, Solo tells Beckett that they cannot give the coaxium to Dryden Vos. Beckett doesn't care and asks Solo if he has a plan. Solo says he has a plan to get their money without giving up the coaxium. Beckett warns that Dryden has a private army and suggests an alternative plan. From a distance, Enfys asks what Solo and Beckett are discussing and Qi'ra says he is going to help them. After their meeting, Beckett invites Solo to come with him, but Han declines the offer. Before leaving, Beckett tells Han that he going to Tatooine, where a big-shot gangster is recruiting a crew for a job. Beckett sees it as an opportunity to pay off his debts.\n\n",
        "section": "Confronting the Cloud-Riders[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 523.0
      }
    },
    {
      "id": "7539",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Pre-production[]\n\nIdeas for a young Han Solo film began to percolate in the lead up to The Walt Disney Company's acquisition of Lucasfilm. In October 2012, as Lucas was preparing to sell his company, Lucasfilm president Kathleen Kennedy contacted Lawrence Kasdan, writer of The Empire Strikes Back and co-writer of Star Wars: Episode VI Return of the Jedi, and asked him to meet her and Lucas to discuss new films in the franchise. Kasdan recounted that Lucas had already come up with some basic ideas for the sequel trilogy and had also come up with the concept of stand-alone films. One of those movies was about young Han Solo, before the events of A New Hope. Kasdan was initially hesitant on being part of the new films, but he decided he could do the Han Solo movie as Solo was his favorite character. He pitched his idea to Bob Iger by telling him about the scene where Han gets his last name.\n\nAfter agreeing to the job, Kasdan was also asked to help develop what would become Star Wars: Episode VII The Force Awakens. Once he had completed work on that film, Kasdan felt creatively drained, so he asked his son Jon to assist in developing the Han Solo film. The Kasdans worked on the script for nine months, during which they were inspired by Treasure Island, Heat, Unforgiven, and various films by the Coen brothers. At the urging of the elder Kasdan, Phil Lord and Christopher Miller were hired to direct. Lord and Miller tested several thousand actors for the part, including Harrison Ford impressionist Anthony Ingruber. They ultimately chose Alden Ehrenreich, who had been the first person to audition. According to Miller, they didn't want an impersonation of Ford, but \"someone who could evoke the spirit of the iconic performance we all remember while bringing something new and fresh.\" Ehrenreich was officially announced during Celebration Europe. He (and later, Ron Howard) met with Harrison Ford to discuss the character, and Lucasfilm sent Ford a copy of the script for his approval. Once Ehrenreich was cast, certain parts of the script were revised to be tailored to his voice; the final script also incorporated contributions from Lord, Miller and Howard. As Jon Kasdan told SFX magazine, \"I think ultimately the movie that you'll see is truly a product of the five of us all coming together in this weird way to tell this story.\"\n\n",
        "section": "Pre-production[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 503.0
      }
    },
    {
      "id": "7529",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Separate paths[]\n\nAfter Han leaves, Qi'ra removes Dryden Vos' signet ring and uses it to seal the living room. Alone aboard Vos' yacht, Qi'ra contacts Vos' superior, who is revealed to be the former Sith apprentice Maul. She informs him of the coaxium mission's failure and assumes Vos' position but carefully avoids telling him about Han's involvement, instead pinning the blame on Beckett. She claims that Beckett stole the coaxium shipment. Using the Force to summon his lightsaber, Maul orders Qi'ra to bring the yacht to the planet Dathomir and tells her that she will be working more closely with him in the future.\n\nMeanwhile, Han catches up with Beckett and Chewbacca along the Pnakotic Coast. Beckett says that Han is relentless while Han tells Chewie that he came as fast as he could. Han confirms that Dryden is dead and that Qi'ra killed him. Beckett says that Han still doesn't understand that Qi'ra is a survivor. Han responds that Beckett's problem is that he thinks that everyone is like him. Beckett responds that Han is not like him. He tries to trick Han into lowering his guard by offering to tell something while reaching for his blaster.\n\nBefore Beckett can shoot him, Han shoots first, fatally wounding the gangster. Han helps up the dying Beckett who compliments Han for his quick thinking, admitting that he would have killed him had Han not reacted. Beckett praises Han for his courage on the Vandor mountain before breathing his last. Han watches as Qi'ra departs on the yacht First Light, having given Solo a clean break from his debts to the Crimson Dawn. Qi'ra watches Han and Chewbacca from the viewport. Chewie puts a comforting hand on Han.\n\nFollowing the deaths of Vos and Beckett, Han and Chewbacca deliver the refined coaxium to Nest, who reveals her plans to use the coaxium, which is worth 60 million credits, to aid the rebellion against the Empire. She offers Han the chance to join her, but he declines. In response, Nest states that someday he may feel more sympathetic to the rebels' cause. Out of gratitude for his help, Nest gives Solo a vial of coaxium, enough to buy a ship for himself.\n\n",
        "section": "Separate paths[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 487.0
      }
    },
    {
      "id": "7517",
      "title": "Solo: A Star Wars Story",
      "metadata": {
        "categories": [
          "Real-world media",
          "2018 releases",
          "Incomplete Appearances",
          "2 more",
          "Anthology films",
          "Stand-alone films"
        ],
        "content": "# Solo: A Star Wars Story - Landing on Savareen[]\n\nAfter making the Kessel Run, Solo and his companions land on the planet Savareen to rendezvous with Vos. As the Falcon approaches the Bis Refinery, Solo radios the air traffic controller Dhowar Repareed, warning that he is coming with a cargo of coaxium that needs to be offloaded immediately. The damaged Falcon circles the coastal refinery before landing on a landing pad. Due to its damaged landing gear, the Falcon is lopsided.\n\nAs the coaxium is offloaded, Solo quips that he made the Kessel Run in just twelve parsecs with some generous rounding. Han puts his arm around an un-amused Lando, who is grieving over the loss of L-3 and is furious at the damage to his ship. He tells Han that he will be waiting aboard his quarters for his share of the money and vows not to see him again.\n\nHan finds Qi'ra at a bar in the nearby Pnakotic Coast village and asks when Vos is coming. Qi'ra reassures him that he will get paid for doing his job. When Solo asks Qi'ra about her servitude to Dryden, she explains that the crime lord helped her out of a \"bad\" situation. He asks how long it will take her to pay off her debt. Qi'ra warns her that everybody including Vos serves someone and not to make any enemy of Dryden Vos. Han says he can take care of himself and is no longer the \"kid\" she knew on Corellia. When Qi'ra asks who he is, Han says he is an outlaw. She tells him she is the only person in the galaxy who knows that he is a good guy. Han disagrees and says he is a terrible person. Beckett reminds the two about the coaxium.\n\n",
        "section": "Landing on Savareen[]",
        "source": "https://starwars.fandom.com/wiki/Solo:_A_Star_Wars_Story",
        "title": "Solo: A Star Wars Story",
        "tokens": 381.0
      }
    },
    {
      "id": "8794",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Adventures on Hynestia[]\n\nL3-37 traveled to Hynestia with Calrissian to pick up a load of gherlian fur. She stayed on board the Millennium Falcon as Calrissian gambled at the Frozen Kova in an attempt to earn credits to pay for fuel and docking fees. While she waited, she cleaned the Falcon and stalled the dockmaster who stopped by to collect what was owed. When Calrissian returned to the ship, she asked him where he had been. He told her he had run into some trouble and explained they would be traveling to the Guagenian sector instead of following their plans to go to Neral's moon. He left to get a snack, and L3-37 went to the boarding ramp when someone knocked on the hull. The droid was confronted by several members of the Hynestian Royal Guard, who told her that they were loading a crate onto the ship. After they left, she secured the crate and demanded that Calrissian explain the situation. He told her how he was being forced to deliver the crate, and L3-37 was worried that they had to transport a potentially dangerous object. He asked if she could disable the tracking device on the package, but she told him it was beyond her capabilities.\n\nLeaving Hynestia, L3-37 plotted the trip to Neral's moon and piloted the ship while Calrissian took a nap. After waking, he joined her in the cockpit, and the pair talked about Calrissian's plan to fulfill all his responsibilities without angering anyone. Hearing a noise, he went to investigate but was confronted by Princess Rinetta Gan, who had snuck aboard and taken his blaster. The princess demanded L3-37 change course and jump to Livno III, but the droid refused. The young girl asked why Calrissian kept a droid around that didn't follow orders, and he responded that L3-37 was an excellent navigator despite her personality. Calrissian managed to disarm the princess and asked L3-37 to restrain her, but the droid refused, stating she was busy piloting the Falcon.\n\nAfter landing, L3-37 stayed on the Falcon while Calrissian went to met with Ne'eda Frip. Walking around the ship, she discovered that Gan had freed herself. She did some maintenance checks on the freighter to make sure it hadn't suffered any damage. While performing her tasks, she heard banging on the gangway. She opened the portal and was confronted by the bounty hunter Jeskian Veldar and a group of thugs. They demanded to know where Calrissian was, but L3-37 acted like a subservient droid and lied about knowing his location. The group left, and L3-37 went to the cockpit to call Calrissian and warn him. She was unaware that she was followed by a droid bounty hunter, who pointed a blaster at her and demanded to know where Calrissian was. She played dumb, and before the sentry droid could do anything, L3-37 was saved when it was destroyed by Queen Forsythia Jin, who had come to look for her daughter.\n\nL3-37 was fitted with a restraining bolt after Calrissian was subdued by the Royal Guard, and she was confiscated along with the Falcon. Princess Gan decided that the best way to achieve her goal of returning the Solstice Globe to Livno III was to get L3-37's assistance. She went to the Falcon and removed the restraining bolt from the droid. L3-37 expressed her disdain for restraining bolts and complained about her hip joint being stiff. Gan suggested the droid take some parts from the destroyed sentry droid that was still on board, but L3-37 thought it was barbaric to salvage parts from other droids. Once Gan explained her plan to free Lando and Zel Gris, L3-37 agreed to help her. She went to the Hynestian royal dungeon and freed the two prisoners using a tool that Gan had installed in the chest of the droid. The group was spotted by a guard, but L3-37 shoved him into a wall and knocked him unconscious. The group climbed into a refuse cart, and L3-37 pushed them to the hangar where the Falcon was stored.",
        "section": "Adventures on Hynestia[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 915.0
      }
    },
    {
      "id": "8793",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Adventures on Hynestia[]\n\nL3-37 traveled to Hynestia with Calrissian to pick up a load of gherlian fur. She stayed on board the Millennium Falcon as Calrissian gambled at the Frozen Kova in an attempt to earn credits to pay for fuel and docking fees. While she waited, she cleaned the Falcon and stalled the dockmaster who stopped by to collect what was owed. When Calrissian returned to the ship, she asked him where he had been. He told her he had run into some trouble and explained they would be traveling to the Guagenian sector instead of following their plans to go to Neral's moon. He left to get a snack, and L3-37 went to the boarding ramp when someone knocked on the hull. The droid was confronted by several members of the Hynestian Royal Guard, who told her that they were loading a crate onto the ship. After they left, she secured the crate and demanded that Calrissian explain the situation. He told her how he was being forced to deliver the crate, and L3-37 was worried that they had to transport a potentially dangerous object. He asked if she could disable the tracking device on the package, but she told him it was beyond her capabilities.\n\nLeaving Hynestia, L3-37 plotted the trip to Neral's moon and piloted the ship while Calrissian took a nap. After waking, he joined her in the cockpit, and the pair talked about Calrissian's plan to fulfill all his responsibilities without angering anyone. Hearing a noise, he went to investigate but was confronted by Princess Rinetta Gan, who had snuck aboard and taken his blaster. The princess demanded L3-37 change course and jump to Livno III, but the droid refused. The young girl asked why Calrissian kept a droid around that didn't follow orders, and he responded that L3-37 was an excellent navigator despite her personality. Calrissian managed to disarm the princess and asked L3-37 to restrain her, but the droid refused, stating she was busy piloting the Falcon.\n\nAfter landing, L3-37 stayed on the Falcon while Calrissian went to met with Ne'eda Frip. Walking around the ship, she discovered that Gan had freed herself. She did some maintenance checks on the freighter to make sure it hadn't suffered any damage. While performing her tasks, she heard banging on the gangway. She opened the portal and was confronted by the bounty hunter Jeskian Veldar and a group of thugs. They demanded to know where Calrissian was, but L3-37 acted like a subservient droid and lied about knowing his location. The group left, and L3-37 went to the cockpit to call Calrissian and warn him. She was unaware that she was followed by a droid bounty hunter, who pointed a blaster at her and demanded to know where Calrissian was. She played dumb, and before the sentry droid could do anything, L3-37 was saved when it was destroyed by Queen Forsythia Jin, who had come to look for her daughter.\n\nL3-37 was fitted with a restraining bolt after Calrissian was subdued by the Royal Guard, and she was confiscated along with the Falcon. Princess Gan decided that the best way to achieve her goal of returning the Solstice Globe to Livno III was to get L3-37's assistance. She went to the Falcon and removed the restraining bolt from the droid. L3-37 expressed her disdain for restraining bolts and complained about her hip joint being stiff. Gan suggested the droid take some parts from the destroyed sentry droid that was still on board, but L3-37 thought it was barbaric to salvage parts from other droids. Once Gan explained her plan to free Lando and Zel Gris, L3-37 agreed to help her. She went to the Hynestian royal dungeon and freed the two prisoners using a tool that Gan had installed in the chest of the droid. The group was spotted by a guard, but L3-37 shoved him into a wall and knocked him unconscious. The group climbed into a refuse cart, and L3-37 pushed them to the hangar where the Falcon was stored.\n\nAs they neared the hangar, the droid informed the rest of the group that the Falcon was surrounded by Hynestian Royal Guards. Gan and Calrissian bluffed the guards, and everyone boarded the ship. L3-37 programmed the coordinates for Livno III and took off. As they fled the planet, L3-37 informed the ship that they were being pursued and assumed it was the Hynestians. She was told by Calrissian that the ships were Corellian and were Ne'eda's Stalwarts. To make sure the Falcon wasn't followed, L3-37 suggested they perform a Mustafarian Special. As they prepared, L3-37 answered a call from the Stalwarts and put it on the ship-wide communications system. The speaker was a droid, and it angered L3-37 that one of her kind would work for a common criminal.\n\nAs the ship prepared for the maneuver, L3 instructed Gan on what she needed to do. The droid counted down and had the princess flip several switches that prevented half of the engines from operating. This caused the Falcon to corkscrew, making it hard to target. L3-37 enjoyed the swirling of the stars and was not affected by the disorienting maneuver as the organics on board were. After several of the Stalwarts were destroyed, L3-37 decided to bring the ship back under control and instructed Gan to flip the switches again. The engines did not reactivate, and L3-37 did a complete system restart to get the engines working. Gan vomited on L3 as the droid piloted the Falcon to safety.\n\nEscaping to hyperspace, L3-37 cleaned herself off. During the trip she observed Calrissian and the others play sabacc, but used the time to perform maintenance on herself. They arrived at the coordinates for Livno III but saw nothing but an asteroid field. L3 entered the cockpit and explained it was the remains of a comet passing through the system, and steered the Falcon to the planet.\n\nThe group was greeted by the Lynna and taken to the Chamber of the Sun. Calrissian thought about stealing some of the gems embedded in the walls, but L3 made sure he didn't attempt the theft. After Gris restored the Solstice Globe to its rightful place and restored the environment of the planet, L3-37 and the others celebrated.\n\nL3-37 returned to Hynestia with Calrissian and Gan. The princess was reunited with her mother, who ordered Calrissian and L3-37 to leave the planet and never return.\n\n",
        "section": "Adventures on Hynestia[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 1462.0
      }
    },
    {
      "id": "8791",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37\n\nL3-37\n\n\nProduction information\n\nDate destroyed\n10 BBY, Kessel\n\n\nClass\nCustom pilot droid\n\n\n\nTechnical specifications\n\nHeight\n1.79 meters\n\n\nGender\nFeminine programming\n\n\nPronouns\nShe/her\n\n\nSensor color\nWhite\n\n\nPlating color\nGray/Silver\n\n\n\nChronological and political information\n\nAffiliation\nMillennium Collective\n\n\n[Source]\n\nL3-37, abbreviated L3, or Elthree, or nicknamed \"Vuffi,\" was a feminine custom self-made piloting droid associated with Lando Calrissian who was active during the reign of the Galactic Empire. She was a one-of-a-kind droid who assembled and improved herself with scraps of other droids, including her torso, which she pieced together from an old astromech. Her brain module began as part of an R3-series astromech droid, including data from an espionage droid, custom coding and protocol droid processors.\n\nL3 was also built from already used protocol parts and was an enlightened navigator. She cared deeply about droid rights, a trait which led to her eventual demise.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 237.0
      }
    },
    {
      "id": "8792",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Self-awareness[]\n\nThough she originally lived in a simple astromech droid shell, L3-37's original owner left a restraining bolt off her after cleaning her sensors, leaving his droid alone in a workshop full of spare parts. Believing freedom was the ultimate goal, L3 modified herself, using protocol droid parts to give herself a humanoid form and increasing the size of her memory banks. The process of upgrading herself allowed her to become one of the most self-aware droids in the galaxy. She would eventually become the co-pilot to Lando Calrissian and traveled the galaxy with him. Calrissian benefited from her exceptional navigational database.\n\n",
        "section": "Self-awareness[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 144.0
      }
    },
    {
      "id": "8798",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Adventures on Hynestia[]\n\nAs they neared the hangar, the droid informed the rest of the group that the Falcon was surrounded by Hynestian Royal Guards. Gan and Calrissian bluffed the guards, and everyone boarded the ship. L3-37 programmed the coordinates for Livno III and took off. As they fled the planet, L3-37 informed the ship that they were being pursued and assumed it was the Hynestians. She was told by Calrissian that the ships were Corellian and were Ne'eda's Stalwarts. To make sure the Falcon wasn't followed, L3-37 suggested they perform a Mustafarian Special. As they prepared, L3-37 answered a call from the Stalwarts and put it on the ship-wide communications system. The speaker was a droid, and it angered L3-37 that one of her kind would work for a common criminal.\n\nAs the ship prepared for the maneuver, L3 instructed Gan on what she needed to do. The droid counted down and had the princess flip several switches that prevented half of the engines from operating. This caused the Falcon to corkscrew, making it hard to target. L3-37 enjoyed the swirling of the stars and was not affected by the disorienting maneuver as the organics on board were. After several of the Stalwarts were destroyed, L3-37 decided to bring the ship back under control and instructed Gan to flip the switches again. The engines did not reactivate, and L3-37 did a complete system restart to get the engines working. Gan vomited on L3 as the droid piloted the Falcon to safety.\n\nEscaping to hyperspace, L3-37 cleaned herself off. During the trip she observed Calrissian and the others play sabacc, but used the time to perform maintenance on herself. They arrived at the coordinates for Livno III but saw nothing but an asteroid field. L3 entered the cockpit and explained it was the remains of a comet passing through the system, and steered the Falcon to the planet.\n\nThe group was greeted by the Lynna and taken to the Chamber of the Sun. Calrissian thought about stealing some of the gems embedded in the walls, but L3 made sure he didn't attempt the theft. After Gris restored the Solstice Globe to its rightful place and restored the environment of the planet, L3-37 and the others celebrated.\n\nL3-37 returned to Hynestia with Calrissian and Gan. The princess was reunited with her mother, who ordered Calrissian and L3-37 to leave the planet and never return.",
        "section": "Adventures on Hynestia[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 561.0
      }
    },
    {
      "id": "8814",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Later adventures[]\n\nNow one of its droid brains, L3 remained part of the Falcon, accompanying Solo and Chewbacca in their further adventures. She recognized that Solo was a better pilot than Calrissian, yet she nevertheless wished her partner still owned the ship and was annoyed that he had gambled the Falcon away after everything she had done to save him. She served the Falcon when Solo and Chewie used it to help Luke Skywalker destroy the Death Star during the Battle of Yavin. She also helped Solo and his friends escape from the Hoth system following the Battle of Hoth. During the escape, as the protocol droid C-3PO tried to repair the Falcon's damaged hyperdrive, he informed Solo his ship had a peculiar dialect.\n\nAs part of what she dubbed the \"Millennium Collective,\" L3 taught the ship's two other droid brains, ED-4 and V5-T, to have individuality, enabling the collective to work together while also being separate minds, which had confused C-3PO. When the Falcon arrived on Cloud City, which Calrissian had become Baron Administrator of, on the planet Bespin, he entered his former ship and remarked that it was not the same without his droid partner. Wanting to let him know she survived, she changed the cockpit's display to show Kessel, which Calrissian began to realize meant L3 was alive, only for a Bespin Wing Guard to enter and inform Calrissian that Darth Vader wished to speak with him. Although she was angered that Calrissian was working with the Empire's chief enforcer, she nevertheless regained her faith in her former partner when he helped Solo's friends escape Cloud City.\n\n",
        "section": "Later adventures[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 358.0
      }
    },
    {
      "id": "8805",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Time at the Lodge[]\n\nL3-37 spent time at the Lodge on Vandor and talked to the bartender Tivoche Bilure, also known as Midnight. When she learned that Tibbs Ospe had wired the cognitive module of the protocol droid SV-38P into the circuitry of the bar so she could translate for Midnight, she protested to him. She claimed the droid was a person and should be afforded the rights of one and not treated like a piece of furniture. Midnight agreed to let L3-37 sit at the end of the bar and keep SV-38P company. He also agreed to collect spare protocol droid parts so that one day SV-38P could be reconstructed. She would often show up randomly and give parts to Midnight. She attempted to convince the bartender to support the droid rights movement. Due to Ralakili's involvement in the droid fighting pit, L3-37 disliked him immensely and threatened to steal his remote shocker device and wire it to him instead of the droids.\n\n",
        "section": "Time at the Lodge[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 219.0
      }
    },
    {
      "id": "8810",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Vandor[]\n\nOne week later, L3 and Calrissian were on Vandor, and discovered where the Falcon was being kept. Deciding to play a game of sabacc, Calrissian headed to the Lodge in Fort Ypso. The two of them also wanted to enjoy some downtime after Calrissian had completed a smuggling run on Felucia.\n\nShortly afterward, Calrissian was hired by the criminal Tobias Beckett and his gang to transport them to Kessel. L3, meanwhile, was trying to reason with WG-22, a droid who was being used for entertainment in a fighting pit in the Lodge. Ralakili, who ran the droid pits, got into a heated argument with L3, and she grabbed him by the face. Calrissian arrived, noticing this, and told L3 to let go of the man's face. L3 complied, and asked who Calrissian's acquaintances were. Calrissian explained that they were taking the group to the spice mines of Kessel.\n\n",
        "section": "Vandor[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 226.0
      }
    },
    {
      "id": "8811",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Mission to Kessel[]\n\nThey then traveled to Kessel aboard the Millennium Falcon, where L3 assisted Beckett's gang in their mission to obtain coaxium, which was to be transported to Savareen so the unstable material could be refined and they could rendezvous with Dryden Vos. During the mission, L3 freed several droids who were being used as slaves by the Pyke Syndicate. Whilst Han Solo and Chewbacca were making their way to the vault filled with coaxium, the droids L3 had freed rebelled, freeing all of the other slaves in the mine. The slaves and droids rebelled against the guards, allowing Beckett's gang to escape to the Falcon.\n\nOne of the droids present during the revolution was protocol unit AL1-L3, who was inspired by L3's independent nature. After nearly everyone was aboard the ship, L3 was shot by a guard and was severely damaged. Calrissian attempted to retrieve L3, only to lose half of her body and get injured himself during the escape. Aboard the Millennium Falcon, L3 was held in Calrissian's lap while Calrissian mourned for her, wishing that he had never taken the job. L3 responded, but deactivated shortly after they made it off of Kessel. Calrissian removed her neural core from her head in order to integrate her data into the Falcon at the crew's suggestion.\n\n",
        "section": "Mission to Kessel[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 300.0
      }
    },
    {
      "id": "8818",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Legacy[]\n\nYears after L3's stand on Kessel, the B1 battle droid R0-GR wrote the book \"droidography,\" which he hoped would show humans that droid lives had value. In the book, R0-GR detailed numerous droid models, but he also covered several custom droids, including L3. The B1 unit recounted that his friend Pace Freemaker had told him that L3 upgraded herself. R0-GR greatly respected L3, calling her one of the galaxy's most legendary self-made units. According to R0-GR, despite her skills as a navigator, she was mainly remembered for her devotion to droid rights and outspoken personality. R0-GR even claimed her story had made him want to rebel against his human owners, the Freemakers, despite the fact that he loved them.\n\nHe noted that it was rumored her programming lived on somewhere, though he was unsure of the tale. Nevertheless, even though he felt there was still a long way to go in the struggle, R0-GR believed her legacy was a constant reminder to droids that freedom was worth fighting for. R0-GR included a picture of her hand rising up next to his and other droids' parts in the section on droid rights. Following the Battle of Crait, L3-37 was also mentioned in the pirate Hondo Ohnaka's book titled Galactic Explorer's Guide in its section on Kessel.\n\n",
        "section": "Legacy[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 303.0
      }
    },
    {
      "id": "8807",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Job on Kullgroon[]\n\nWhile L3 and Calrissian were on Batuv, Calrissian was approached by the Petrusian Kristiss, who wanted to hire him to smuggle weaponry into the Imperial outpost on the world of Kullgroon. Knowing that the outpost held slaves, and that Calrissian had debts to pay to Brushaun, a gambler who had lost two thousand credits to him, L3 convinced him to accept the mission. As they left Batuv on the Millennium Falcon, they were attacked by Imperial TIE fighters. Calrissian told L3 to take the ship's controls while he shot back at the TIEs. As the ship's shields took severe damage, Calrissian ordered L3 to maneuver around a small moon so he could destroy the TIEs. Before Calrissian could show off, L3 told him that they were approaching Kullgroon.\n\nTo get past the patrol ships on Kullgroon, Calrissian powered down the Falcon and let it fall out of its orbit. L3 piloted the Falcon to the Wastelands of Kullgroon, and along with Calrissian and Kristiss, left the ship and split up to explore entry points to the facility. Some time later, L3 accessed the Imperial network, discovering Kristiss had been captured by stormtroopers. Calrissian suggested that they leave, but L3 reminded him that they still did not have enough money to pay off Brushaun. Reluctantly, Calrissian agreed to continue, while L3 downloaded the Imperial security codes. While entering the droid-repair facility among a number of other droids, L3 was later contacted by Kristiss, who told her that she couldn't contact Lando. Before L3 could reply, she discovered that the facility's true purpose was to melt down and destroy the droids, not repair them.\n\nAngered by this, L3 escaped and disabled the power to the droid incinerators. Calrissian, who had been captured by the outlaw Batalla, acquired a communications device from a protocol droid so that he could contact her. L3 was unimpressed by the fact that he had harmed an innocent droid, but nevertheless left to assist him. While Calrissian was being forced to fight members of the Zakku Rain Cartel in an arena, L3 brought the Falcon to him, firing on the arena as she did so. As they escaped, they dodged several large creatures, but were then pursued by a unit of TIE fighters.\n\nCalrissian evaded the TIEs by pretending that the Falcon had crashed into a rock formation, and they set the ship down on the ground. Calrissian entered the facility through a sewage expulsion port and asked L3 to hack into the mainframe and shut down the security monitors on the levels where Kristiss and her father Rythus were located. He convinced the Petrusian slaves to revolt, and contacted L3, telling her to move the Falcon to the sewage pipe. When Calrissian arrived with the slaves, L3 gave him a new communicator, while the Petrusians collected their weapons.\n\nCalrissian and the Petrusians fought back against the stormtroopers at the outpost, while L3 waited in the Falcon. She noticed several TIE brutes heading to the outpost, and warned Calrissian. Kristiss and Rythus revealed that rather than destroying the droids, the Petrusians had reprogrammed them to rise up and fight. As L3 piloted the Falcon, shooting down the TIE fighters, she noticed the droid revolution, and landed the ship so she could fight with them, despite Calrissian's protests. While L3 fought alongside the droids, the Petrusians and Calrissian, she noticed that the Falcon had been occupied by stormtroopers. While Calrissian wanted to kill the stormtroopers, L3 suggested that he figure out where it was being taken and steal it back from them. Letting the Falcon go, Calrissian and L3 boarded a Sentinel-class landing craft that had been stolen by Kristiss' men. After they had left Kullgroon, L3 sliced into the Empire's systems, and discovered that the Falcon was being taken to be impounded on Vandor. She told Calrissian this, and that Kristiss would drop the two of them off there.\n\n",
        "section": "Job on Kullgroon[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 939.0
      }
    },
    {
      "id": "8822",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - The Falcon's \"mind\"[]\n\nIn the 1980 film Star Wars: Episode V The Empire Strikes Back, while aboard the Millennium Falcon after the Battle of Hoth, C-3PO tells Han that he didn't know where the ship learned to communicate, but it had the most peculiar dialect. Following the release of Solo, many people hypothesized that C-3PO was referring to L3. In response, the Star Wars Twitter account confirmed this. The From a Certain Point of View short story \"Faith in an Old Friend\" would later depict some of the events of The Empire Strikes Back from L3's perspective.\n\n",
        "section": "The Falcon's \"mind\"[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 135.0
      }
    },
    {
      "id": "8820",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Behind the scenes[]\n\nL3-37 was portrayed via motion capture by Phoebe Waller-Bridge in the 2018 Star Wars Anthology film Solo: A Star Wars Story. Waller-Bridge's casting in the film was first announced on February 21, 2017. Her name is a reference to LEET, the act of replacing certain letters of a word with numbers, often done on the Internet.\n\nThe character of L3-37 was conceived in conversations between former directors Phil Lord and Christopher Miller and screenwriters Lawrence and Jon Kasdan, evolving from Miller's observation that Wuher, the bartender of Chalmun's Spaceport Cantina in the original Star Wars film, Star Wars: Episode IV A New Hope, objected to C-3PO, despite droids seeming to be the least rambunctious folks in the galaxy. Early versions of the film's story included L3-37 incorporating the navigation computer from the Millennium Falcon's cockpit into her design, with the idea being that L3 came with the Falcon when Lando Calrissian acquired it.\n\nWaller-Bridge and Donald Glover speculated in the film's DVD commentary about how L3-37 and Lando Calrissian met, with Waller-Bridge adding that it probably started violently and Glover adding that they were probably in a bar.\n\nHer alternate name \"Vuffi\" and her adventures with Lando in Solo: A Star Wars Story: Tales from Vandor are an allusion to Vuffi Raa, Lando's droid sidekick from the Star Wars Legends continuity, with her sharing much of the same adventures as Vuffi along with part of his name. Unlike L3-37's personality and background, Vuffi was a childlike droid with masculine programming who was part of a sentient society of droids known as the Silentium who did not have an implied romance with Lando, but like L3-37 he was a droid who overcame his own programming, managed the Falcon and was faithfully loyal to his friend Lando.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 428.0
      }
    },
    {
      "id": "8812",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Uploaded into the Millennium Falcon[]\n\nAfter the Falcon was attacked by TIE fighters as they attempted to escape Kessel, L3 was uploaded into the Falcon's Hanx-Wargel SuperFlow IV computer system by Calrissian, acting as the ship's navigation. This helped the gang escape the gravity well and leave the Kessel Run so they could deliver the coaxium to Savareen. The Falcon's computer convinced her to accept the integration. After Calrissian took the ship from the planet during the showdown on Savareen, the last bit of L3's independent processes shared a message with the gambler through the ship's computer screen. The Falcon finished merging with L3 as she mentioned that her time with Calrissian had been fun.\n\nShortly after the deaths of Vos and Beckett, Solo tracked Lando to Numidian Prime, where he won the Falcon from Calrissian in a rematch of sabacc, acquiring L3 in the process.\n\n",
        "section": "Uploaded into the Millennium Falcon[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 206.0
      }
    },
    {
      "id": "8819",
      "title": "L3-37",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Droids with feminine programming",
          "3 more",
          "Droids with she/her pronouns",
          "Junk droids",
          "Pilot and navigation droids"
        ],
        "content": "# L3-37 - Characteristics[]\n\nA passionate advocate for droid rights, L3-37 cared deeply about the subject, viewing humans and droids as equals. Though she lived in an era where droids were strictly forced into servitude roles, L3 inspired other units to liberate themselves and create their own destinies. R0-GR believed that, as long as one was not mistreating their droids, she was very likable. When discussing how she rebuilt herself, R0-GR was thankful she did not take on the arrogant demeanor of protocol droids despite taking on protocol parts. However, Hondo Ohnaka's Galactic Explorer's Guide described her as being cantankerous. L3 was close with Lando Calrissian and claimed the man was in love with her, though she told Qi'ra she did not feel the same way and said they were not compatible.\n\nDue to her lack of a single memory wipe and her heritage as an astromech, she became one of the finest navigators in any star system. L3-37 hated anything that limited her self-determination and despised restraining bolts. After Calrissian jokingly threatened to install one on her, she refused to pilot the ship for a week and stranded them on Tatooine.\n\n",
        "section": "Characteristics[]",
        "source": "https://starwars.fandom.com/wiki/L3-37",
        "title": "L3-37",
        "tokens": 265.0
      }
    }
  ]
}