{
  "cluster_id": 28,
  "size": 210,
  "vectors": [
    {
      "id": "1109",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Merchandise and tie-ins ‡[]\n\nIn April 2019, Lucasfilm launched a Galaxy's Edge publishing campaign, which included a Marvel comic series and the novels Galaxy's Edge: Black Spire, A Crash of Fate and Myths & Fables. Galaxy's Edge has been featured in three episodes of Star Wars Galaxy of Adventures: \"Millennium Falcon - Smugglers Run,\" \"Black Spire Outpost,\" \"Rise of the Resistance.\" A Galaxy's Edge-themed content pack was released for The Sims in September 2020. The Art of Star Wars: Galaxy's Edge was released in Spring 2021. A Hasbro toy line was produced. A LEGO set of the Intersystem Transport Ship was also released; A special code will allow you to use the ship in LEGO Star Wars: The Skywalker Saga.\n\nOriginally, certain merchandise was meant to be sold exclusively inside Galaxy's Edge. However, due to a drop in attendance as a result of park closures and travel restrictions caused by the COVID-19 pandemic, the Disney parks began releasing Galaxy's Edge merchandise outside of the land itself. A variety of merchandise became available at Target stores beginning August 30, 2020. That September, merchandise also became available at Disneyland's WonderGround Gallery and at Walt Disney World's Magic Kingdom Emporium, as well as online and internationally via shopDisney.com.\n\n",
        "section": "Merchandise and tie-ins ‡[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 287.0
      }
    },
    {
      "id": "1103",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nOn January 11, 2018, the Star Wars Launch Bay attraction at Disneyland included a piece of the full model of the upcoming attraction that was unveiled at D23, marking it the second Disney theme park to include part of the scale model, the first being Disney's Hollywood Studios. A short preview video was released on May 22. On May 24, 2019 the Disneyland website and mobile app updated park maps to include, and confirm, the layout of Galaxy's Edge. The Disney Parks Blog revealed new park guide books including the new land.",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 124.0
      }
    },
    {
      "id": "1101",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge\n\nStar Wars: Galaxy's Edge\n\nProduction information\n\nPremiere date\nMay 31, 2019\n\n\n[Source]\n\nStar Wars: Galaxy's Edge is a themed land developed by The Walt Disney Company. It is set in an outpost on the planet Batuu. Until 2022, the events portrayed there took place only between the films The Last Jedi and The Rise of Skywalker. Since 2022, characters from other times are portrayed as well. John Williams composed new music for Galaxy's Edge.\n\nIt opened in phases in parks in the United States, with all of the land except for the Rise of the Resistance attraction opened on May 31, 2019 at Disneyland, and on August 29, 2019 at Disney's Hollywood Studios at Walt Disney World. Rise of the Resistance opened December 5, 2019 at the latter, and January 17, 2020 at the former. A smaller version of the land was announced for Walt Disney Studios Park in Disneyland Paris Resort, but has yet to be built.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 218.0
      }
    },
    {
      "id": "1153",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy\n\nStar Wars Bestiary, Vol. 1: Creatures of the Galaxy\n\nAttribution information\n\nAuthor(s)\nS.T. Bende\n\n\nIllustrator(s)\nIris Compiet\n\n\n\nPublication information\n\nPublisher\nInsight Editions\n\n\nPublication date\nOctober 19, 2024 (Early release)November 5, 2024\n\n\nPages\n208\n\n\nISBN\n9798886630985\n\n\n[Source]\n\nStar Wars Bestiary, Vol. 1: Creatures of the Galaxy is a reference book written by S.T. Bende and illustrated by Iris Compiet that was published by Insight Editions on November 5, 2024. The first of two planned volumes, it covers non-sentient species in the Star Wars galaxy. The book also saw an early release at New York Comic Con 2024.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 188.0
      }
    },
    {
      "id": "1154",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy - Official summary[]\n\nExplore the creatures of Star Wars in the first of two books, this one featuring beautiful illustrations of the wondrous non-sentient species from a galaxy far, far away.\n\nFrom Naboo to Hoth, Tatooine to Kashyyyk, and beyond, Star Wars is packed with otherworldly species and monstrous creatures. Dive into the lives, habitats, and behaviors of the non-sentient inhabitants from across the galaxy through original, detailed illustrations and insightful text, to include wampas, banthas, porgs, the fearsome Mythosaur, and so much more. This is a must-have comprehensive compendium for any Star Wars fan who wants a closer look at the fascinating lifeforms from the beloved franchise.\n\nALL-NEW ART: Experience Star Wars in a new way through stunning, original artwork from acclaimed artist Iris Compiet (The Dark Crystal Bestiary: The Definitive Guide to the Creatures of Thra, and Labyrinth: Bestiary - A Definitive Guide to the Creatures of the Goblin King's Realm), featuring your favorite creatures and their habitats.\n\nDISCOVER CREATURES FROM ACROSS THE GALAXY: This book includes an in-depth look at the myriad species from the Star Wars galaxy and their habitats, covering creatures from the films, shows, comics, novels, and more.\n\nAN IDEAL GIFT: A perfect gift for the Star Wars fans of all ages!\n\nAN EPIC ADDITION TO YOUR STAR WARS LIBRARY: A gorgeous volume filled with incredible artwork, Star Wars Bestiary, Vol. 1: Non-sentient Species is an exhaustive exploration of the fantastical creatures of this much-loved galaxy.\n\n",
        "section": "Official summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 364.0
      }
    },
    {
      "id": "1113",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3\n\nGalaxy's Edge 3\n\nAttribution information\n\nWriter\nEthan Sacks\n\n\nPenciller\nWill Sliney\n\n\nInker\nWill Sliney\n\n\nLetterer\nTravis Lanham\n\n\nColorist\nDono Sánchez-AlmaraProtobunker\n\n\nCover artist\nTommy Lee Edwards\n\n\nEditor\nMark Paniccia\n\n\n\nPublication information\n\nPublisher\nMarvel Comics\n\n\nPublication date\nJune 26, 2019\n\n\nPages\n23\n\n\nUPC\n759606093557\n\n\n\nChronological information\n\nTimeline\n34 ABYc. 14 BBY (Flashbacks)\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\nIssue number\n3\n\n\nPreceded by\nGalaxy's Edge 2\n\n\nFollowed by\nGalaxy's Edge 4\n\n\n[Source]\n\nGalaxy's Edge 3 is the third issue of the canon comic book miniseries Star Wars: Galaxy's Edge, which ties in to the theme park of the same name. The issue was written by Ethan Sacks, illustrated by Will Sliney, and published on June 26, 2019 by Marvel Comics.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 235.0
      }
    },
    {
      "id": "1107",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Opening ‡[]\n\nGalaxy's Edge received extensive press coverage in February 2019, after select journalists were given a tour of the Disneyland version. During this time, the cast members' costumes were unveiled. On April 13, Galaxy's Edge featured in a panel at Celebration Chicago. During the panel, Mark Hamill appeared via pre-recorded video to announce a Twitter sweepstakes to win a trip to the attraction.\n\nThe land opened on May 31, 2019 at Disneyland. This followed opening ceremonies on May 29, in which Disney CEO Bob Iger was accompanied by George Lucas, Mark Hamill, Harrison Ford, and Billy Dee Williams, with Ford dedicating Millennium Falcon: Smuggler's Run to the late Peter Mayhew. Initial attendance fell significantly below expectations, which Iger attributed to an increase of ticket and hotel prices, a fear of overcrowding, and the fact that Rise of the Resistance had yet to open. Senior EVP and CFO Christine McCarthy also cited lower passholders attendance due to crowd control policies. Several Galaxy's Edge-themed panels were held at Disney's D23 Expo on August 23. The land opened on August 29, 2019 at Disney's Hollywood Studios at Walt Disney World. As before, there was an opening ceremony on the previous day.\n\nFrom September 24-30, a plethora of Galaxy's Edge tie-ins aired on Disney's TV programming on ABC, Freeform, Disney Channel, and ESPN—including the two-hour special Star Wars: Galaxy's Edge – Adventure Awaits on September 29. On November 28, ABC's Magical Holiday Celebration included Portugal. The Man performing at Galaxy's Edge—the first musical act to perform at the land. The land was later covered in episodes of Disney+'s The Imagineering Story and One Day At Disney.\n\nRise of the Resistance opened on December 5, 2019 at Walt Disney World, accompanied by another press tour. It opened on January 17, 2020 at Disneyland. A smaller version of Galaxy's Edge will also open sometime after 2021 at Walt Disney Studios Park at Disneyland Paris Resort. However, as of August 2022, this is now uncertain following the COVID-19 pandemic.\n\nOn May 27, 2022, it was revealed that characters from different timelines will appear as well, such as Boba Fett and Fennec Shand. Characters from different stories and timelines won't intersect with other characters or stories that would not be appropriate for them in their given timeline.\n\nOn July 27, 2022, the Batuu Bounty Hunters game debuted at Walt Disney World. Using the newly introduced MagicBand+ and the Datapad app, guests take jobs locating bounties for the Bounty Hunters' Guild and Batuu's guildmaster Raga Bua.\n\n",
        "section": "Opening ‡[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 579.0
      }
    },
    {
      "id": "1105",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Layout[]\n\nGalaxy's Edge is set on Black Spire Outpost on Batuu, a planet on the edge of the Outer Rim Territories (just before Wild Space). The time period is between the events of The Last Jedi and The Rise of Skywalker. It was designed to feel like a real world, blending seamlessly into the park and having no obvious ride markers. Guests encounter three types of cast members: First Order, Resistance and villagers. Visitors are able to use an app called Star Wars: Datapad to aid in navigating the land; features include \"hacking\" (to interact with door panels or droids), \"scanning\" (to inspect cargo), \"translation\" (to decode all the Aurebesh signs throughout the attraction), \"tuning\" (to listen in to secret communications), and \"Outpost Control\" (a game in which visitors choose First Order or Resistance).\n\nThe park features two attractions: Millennium Falcon: Smuggler's Run (which puts guests behind the controls of the Millennium Falcon) and Star Wars: Rise of the Resistance (which throws guests into the middle of a battle between the First Order and the Resistance). The official names for the attractions were announced November 17, 2018 at the Destination D event. The Target-exclusive Blu-ray for Solo: A Star Wars Story includes a featurette called \"The Millennium Falcon: From Page to Park,\" which details how the Millennium Falcon ride was developed for Galaxy's Edge.\n\nOga's Cantina is a small dining establishment that serves Star Wars–themed food and drink. Coca-Cola products are available at the attraction, with special in-universe Aurebesh designs. Various shops throughout Galaxy's Edge sell in-universe items; in developing these vendors, Disney Imagineers visited Istanbul and Morocco, and looked at old concept art from the Lucasfilm Archives. Visitors can choose to build their own lightsabers at Savi's Workshop, with the option to either make custom lightsabers or choose pre-established designs.\n\n",
        "section": "Layout[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 412.0
      }
    },
    {
      "id": "1102",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nIn total, Galaxy's Edge took over six years from concept to final unveiling. Disney CEO Robert Iger first announced it at the D23 Expo on August 15, 2015, stating that the company would be building a Star Wars–themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres, making them the largest single-land expansions in the company's history. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019.\n\nAccording to J. Daniel Jenkins, a former Disney Imagineer who helped design Galaxy's Edge, an early concept for the park would have set it in select locations from Episodes I–VI. This evolved into the original planet Batuu once Iger viewed the first footage from The Force Awakens and became confident in the prospects of the sequel trilogy. Fellow Imagineer Scott Trowbridge explained the reasoning: \"The answer really is we know those places and we know those stories that happen there and we know that we're not in them. Black Spire Outpost is an opportunity that's designed from the very get go to be a place that invites exploration and discovery. A place that invites us to become a character in the world of Star Wars. And to the extent that we want to, to participate in the stories of Star Wars.\" At one point, the Imagineers also considered building two entirely different Star Wars lands instead of two of the same concept.\n\nDuring the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Imagineer Asa Kalama stated that what they were building would be canonical. It was later revealed to take place after The Last Jedi through promotional material for the book series Flight of the Falcon. During development, the attraction had as many as 1,100 Disney employees working on the project. By early 2019, this had dropped to 600.\n\nIn the lead-up to the annual D23 Expo, the Disney Parks Blog unveiled a logo for the event \"Walt Disney Parks and Resorts: A Galaxy of Stories,\" which would debut on July 14–16. The event gave guests a glimpse of the locations, starships, creatures, and droids that would populate the outpost that would act as a setting for the park, and unveiled a detailed model for the 14-acre theme park that would debut in 2019, alongside artwork and media showcasing its development. On December 16, 2017, during the parks' Galactic Nights event, more information about the ride and its development process was unveiled to the public via Lucasfilm vice president Doug Chiang as well as Imagineers Chris Beatty, Robin Reardon, and Scott Trowbridge. In particular, it was revealed via construction photos that development had recently \"topped out\" after the highest construction point was in place. It was also revealed that, among other things, there would be a toy shop with concept art unveiled, with Beatty explaining that the inspiration for its design was from marketplaces in Morocco, and that, fitting with its design inspiration, all the wares are handmade arts and crafts similar to those found in Moroccan marketplaces. In addition, the water fountains would have a unique design. (He later revealed that the overall look of the park was inspired by Petrified Forest National Park.) Much of the production work was handled by the same Pinewood Studios artists who worked on the films.\n\nChiang also revealed that they were building X-wing models for the theme park and differentiated them from the movie models. Some concept art also showcased the Millennium Falcon portion of the attraction, including an entirely new location composed of overgrowth in a sewer-like area. A set of trading cards were also unveiled to the public, which revealed some new details about the ride, in particular confirming that BB-8 and Kylo Ren would be present in the ride, as well as hinting at a droid character called \"R3X\" that was later revealed to be RX-24 from the original Star Tours ride. The same cards also had map pieces that revealed some locations on Batuu, in particular the Surabat River Valley, Docking Bay 9, Merchant Row, and Black Spire Station, would be present in the ride and gave some details about the location and a translation key for an Aurebesh poem on the borders of some cards. Some of the props designed for the land were subsequently used in other Star Wars media, including Star Wars Jedi: Fallen Order and The Mandalorian,",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 966.0
      }
    },
    {
      "id": "1114",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Publisher's summary[]\n\nTHE JEDHA CONNECTION! During the height of the EMPIRE, DOK-ONDAR hired an unlikely team to pull off an impossible score — to steal a relic out of the occupied HOLY CITY OF JEDHA. With FIRST ORDER troops now blanketing the BLACK SPIRE OUTPOST on BATUU, history may finally be catching up to the notorious procurer of the unprocurable. Guest starring fan favorite Outer Rim pirate HONDO OHNAKA! Based on Star Wars: Galaxy's Edge, the new themed land coming this year to Disney Land and Walt Disney World.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 132.0
      }
    },
    {
      "id": "1155",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy - Media[]\n\nISBN 9798886630985; November 5, 2024; Insight Editions\n\n",
        "section": "Media[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 40.0
      }
    },
    {
      "id": "1261",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Hardcover[]\n\nA charming, informative guide to the droids of a galaxy far, far away\n\nThis Star Wars encyclopedia with a twist showcases a world of droids in closeup detail. Arranged from biggest to smallest, the droids of the galaxy are revealed with stunning photography and gorgeous illustrations. The evocative descriptions will delight children and let them discover amazing droid facts, such as how R2-D2 goes down stairs and why GNK droids make a \"gonk gonk\" noise!\n\nEach page features fun droid facts and detailed closeup photographs for children to pore over, including firm favorites such as C-3PO and BB-8, as well more unusual ones such as Professor Huyang, the midwife droid, and the laundry droid.\n\nWith foil on the cover and gilded edges, Star Wars Extraordinary Droids is a perfect gift for children who can't get enough of a galaxy far, far away. The book covers droids big and small, kind and scary, and will be a treasured favorite book.\n\n",
        "section": "Hardcover[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 225.0
      }
    },
    {
      "id": "1262",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Kindle edition[]\n\nFind the droids you know and love and discover new favorites along the way.\n\nThis Star Wars guide with a twist showcases a world of droids in close-up detail. Arranged from smallest to biggest, more than 50 droids of the galaxy are revealed with stunning photography and gorgeous artwork. The evocative descriptions will delight children and let them discover amazing droid facts, such as what tools R2-D2 uses and why GNK droids make a \"gonk gonk\" noise! Each page features fun droid facts and detailed close-up photographs for children to pore over, including firm favorites such as C-3PO and BB-8 as well as more unusual ones such as Professor Huyang, police droids, tiny probe droids, and new The Rise of Skywalker droid D-O.\n\nStar Wars Extraordinary Droids is a perfect gift for children who can't get enough of a galaxy far, far away. The book covers droids small (quiet, little mouse droids) and big (vulture droid starfighters), kind (memoir-writing PZ-4CO) and scary (droidekas), and will be a treasured favorite book to keep.\n\n",
        "section": "Kindle edition[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 256.0
      }
    },
    {
      "id": "1264",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Editions[]\n\nISBN 9781465490063; April 7, 2020; DK children; US hardcover\nISBN 9780744024654; April 7, 2020; DK Children; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 58.0
      }
    },
    {
      "id": "1260",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids\n\nStar Wars: Extraordinary Droids\n\nAttribution information\n\nAuthor(s)\nSimon Beecroft\n\n\n\nPublication information\n\nPublisher\nDK Children\n\n\nPublication date\nApril 7, 2020\n\n\nType\nHardcover\n\n\nPages\n128\n\n\nISBN\n9781465490063\n\n\n[Source]\n\nStar Wars: Extraordinary Droids is a children's reference book that covers various droids within the Star Wars saga, including BB-8. It was written by Simon Beecroft and published in hardcover format by DK Children on April 7, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 125.0
      }
    },
    {
      "id": "1353",
      "title": "Star Wars: Droidography",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2018 releases",
          "2 more",
          "Incomplete Appearances",
          "Canon reference books"
        ],
        "content": "# Star Wars: Droidography - Editions[]\n\nISBN 9780062862198; November 6, 2018; HarperFestival; US hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Droidography",
        "title": "Star Wars: Droidography",
        "tokens": 36.0
      }
    },
    {
      "id": "1387",
      "title": "Star Wars: Tales from the Galaxy's Edge – Last Call",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "7 more",
          "Articles with multiple issues",
          "2021 releases",
          "Game stubs",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge – Last Call\n\nStar Wars: Tales fromthe Galaxy's Edge – Last Call\n\nProduction information\n\nDeveloper(s)\nILMxLAB\n\n\nRelease date\nSeptember 15, 2021\n\n\n\nChronological information\n\nTimeline\n34 ABYc. 220 BBY (The Sacred Garden)3 ABY (The Bounty of Boggs Triff)\n\n\nPrevious\nStar Wars: Tales from the Galaxy's Edge\n\n\n[Source]\n\nStar Wars: Tales from the Galaxy's Edge – Last Call, previously titled Star Wars: Tales from the Galaxy's Edge – Part II, is an action-adventure VR experience created by ILMxLAB in collaboration with Oculus Quest which was released in September 15, 2021. The experience connects to Star Wars: Galaxy's Edge. An enhanced edition of the game released on PlayStation VR on February 22, 2023.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge_–_Last_Call",
        "title": "Star Wars: Tales from the Galaxy's Edge – Last Call",
        "tokens": 184.0
      }
    },
    {
      "id": "1352",
      "title": "Star Wars: Droidography",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2018 releases",
          "2 more",
          "Incomplete Appearances",
          "Canon reference books"
        ],
        "content": "# Star Wars: Droidography - Publisher's summary[]\n\nDroids have always been at the heart of Star Wars, from the classic adventures of C-3PO and R2-D2 to the valiant exploits of BB-8 in the latest episodes of the saga.\n\nDroidography is the ultimate in-universe guide to these lovable characters with insider info on their function and role in the Star Wars universe.\n\nCovering every known model of droid, including free-rolling astromechs, Protocol units, KX-series security models, and even bounty hunter droids, the book is filled with fascinating facts and insights that show just how crucial droids are to every faction in the galaxy, from the Rebellion to the First Order.\n\nWith thrilling original illustrations and amazing special features including lift-the-flaps, textures, and more, Star Wars: Droidography is guaranteed to thrill the saga's legions of young fans.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Droidography",
        "title": "Star Wars: Droidography",
        "tokens": 189.0
      }
    },
    {
      "id": "1350",
      "title": "Star Wars: Droidography",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2018 releases",
          "2 more",
          "Incomplete Appearances",
          "Canon reference books"
        ],
        "content": "# Star Wars: Droidography\n\nStar Wars: Droidography\n\nAttribution information\n\nAuthor(s)\nMarc Sumerak\n\n\nIllustrator(s)\nJoel HustakMassimo TravagliniArianna Sabella\n\n\n\nPublication information\n\nPublisher\nHarperFestival\n\n\nPublication date\nNovember 6, 2018\n\n\nType\nHardcover\n\n\nPages\n32\n\n\nDimensions\n10 x 12 inches\n\n\nISBN\n9780062862198\n\n\n[Source]\n\nStar Wars: Droidography is a reference book written by Marc Sumerak. The book is told from the point of view of the battle droid R0-GR from LEGO Star Wars: The Freemaker Adventures. It was published by HarperFestival on November 6, 2018.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Droidography",
        "title": "Star Wars: Droidography",
        "tokens": 157.0
      }
    },
    {
      "id": "1322",
      "title": "Blom Groffitch",
      "metadata": {
        "categories": [
          "Canon articles",
          "Batuu residents",
          "Entertainers",
          "3 more",
          "Individuals of unspecified gender",
          "Individuals of unspecified species",
          "Individuals with unspecified pronouns"
        ],
        "content": "# Blom Groffitch - Behind the scenes[]\n\nBlom Froffitch was first created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Blom_Groffitch",
        "title": "Blom Groffitch",
        "tokens": 44.0
      }
    },
    {
      "id": "1497",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu\n\nStar Wars: Galaxy's Edge:Traveler's Guide to Batuu\n\nAttribution information\n\nAuthor(s)\nCole Horton\n\n\nIllustrator(s)\nChris TrevasChris Reiff\n\n\nEditor(s)\nDelia GreveMeredith Mennitt\n\n\n\nPublication information\n\nPublisher\nbecker&mayer!\n\n\nPublication date\nJune 23, 2020 (digital)July 21, 2020\n\n\nPages\n144\n\n\nISBN\n9780760366745\n\n\n[Source]\n\nStar Wars: Galaxy's Edge: Traveler's Guide to Batuu is a reference book written by Cole Horton and published by becker&mayer!. The book was released digitally on June 23, 2020, and the physical hardcover version was released on July 21, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 173.0
      }
    },
    {
      "id": "1498",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Publisher's summary[]\n\nWelcome to Batuu, a trading post at the edge of the galaxy where smugglers, bounty hunters, and rogue adventurers swap stories, food, and goods. Like any good tourist, you're going to need a guide book to lead you through your visit. Here is your official guide.\n\nIn 2019, Disney opened a new Star Wars addition to their parks: The planet Batuu. Star Wars fans now have access to an authentic, in-world experience unlike anything they have ever seen before! This official guide to Batuu is written completely in-world, as if you are a visitor from another part of the galaxy, looking for recommendations on where to eat, sleep, and what to do during your trip to this planet. The guide also provides itineraries and descriptions of weekend trips \"Beyond Batuu\"; getaways to nearby planets and environs.\n\nThe guide features:\n\nFull-color illustrations and maps\nOriginal content from Lucasfilm\nAn in-world experience like no other\n\nWhether strolling in The Galaxy's Edge 15-acre park or simply being an armchair traveler, this immersive guide will delight any Star Wars fan.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 248.0
      }
    },
    {
      "id": "1568",
      "title": "Life on the Edge: Arrival at Black Spire Outpost",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2019 articles and stories",
          "2 more",
          "Magazine article stubs",
          "Star Wars Insider 192 articles"
        ],
        "content": "# Life on the Edge: Arrival at Black Spire Outpost\n\nLife on the Edge\n\nAttribution information\n\nAuthor(s)\nTricia Barr\n\n\nEditor(s)\nChristopher Cooper\n\n\n\nPublication information\n\nPublisher\nTitan Magazines\n\n\nRelease date\nSeptember 10, 2019\n\n\nPages\n6\n\n\nPublished in\nStar Wars Insider 192\n\n\n[Source]\n\n\n\"Life on the Edge\" is a feature in Star Wars Insider 192 written by Tricia Barr. It is an invented story for the character T'Bar Ricair on a visit to Black Spire Outpost.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Life_on_the_Edge:_Arrival_at_Black_Spire_Outpost",
        "title": "Life on the Edge: Arrival at Black Spire Outpost",
        "tokens": 116.0
      }
    },
    {
      "id": "1570",
      "title": "Black Spire Station",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu stores"
        ],
        "content": "# Black Spire Station - Behind the scenes[]\n\nBlack Spire Station was first unveiled during the December 16, 2017 \"Galactic Nights\" session as part of the map side of several Star Wars: Galaxy's Edge-themed trading cards that were intended to promote the ride. The map cards contained locations for the planet Batuu, as well as a poem in Aurebesh along the border of the card. In Black Spire Station's case, the poem line was \"THOSE BROKEN AND TOSSED\". According to the Walt Disney World news page, Black Spire Station is the place where droid parts could be purchased. The catwalk above the station is a location where Rey, Chewbacca, Vi Moradi or First Order stormtroopers may speak to visitors. Rey and Kylo Ren fought a lightsaber duel on the catwalk during the media event on the opening day of Star Wars: Rise of the Resistance at Hollywood Studios. The Disneyland version of the catwalk was the site of another duel between Rey and Kylo Ren at the conclusion of the Blaze Your Path special event for Make-A-Wish children on 11 September 2024.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Station",
        "title": "Black Spire Station",
        "tokens": 238.0
      }
    },
    {
      "id": "1500",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Editions[]\n\nISBN 9780760366745; June 23, 2020; becker&mayer!; US hardcover\nISBN 9780760366745; Voyageur Press; UK hardcover\nISBN 9781797236339; April 29, 2025; Chronicle Books; US Hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 84.0
      }
    },
    {
      "id": "1519",
      "title": "Black Spire Outpost (toy line)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Stubs",
          "Incomplete Appearances",
          "Disney toy lines"
        ],
        "content": "# Black Spire Outpost (toy line)\n\nBlack Spire Outpost (toy line)\n\nPublication information\n\nPublisher\nThe Walt Disney Company\n\n\nRelease date\n2019\n\n\n[Source]\n\nBlack Spire Outpost is the name for the toy line and merchandise line sold at much of Star Wars: Galaxy's Edge, based on the name of the fictional outpost Galaxy's Edge is located in. These products are sold in various locations in the themed area including Toydarian Toymaker and Resistance Supply. The items are branded with the name \"Black Spire Outpost\" printed in Aurebesh letters on the brown and orange packaging.\n\nOther product lines are dedicated to some specific shops such as Droid Depot, Dok-Ondar's Den of Antiquities, and the Creature Stall.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost_%28toy_line%29",
        "title": "Black Spire Outpost (toy line)",
        "tokens": 159.0
      }
    },
    {
      "id": "1678",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Behind the scenes[]\n\nThe Walt Disney Parks and Resorts panel at the D23 Expo on July 16, 2017 announced Dok-Ondar as a character that would make appearances in the upcoming theme-park land Star Wars: Galaxy's Edge. The themed lands were opened in 2019, first at Disneyland in Anaheim, California and then at Walt Disney World in Orlando, Florida.\n\nDok-Ondar takes the form of an animatronic that cast-member attendants can interact with, asking how much it will take to part with certain items. A bust of Dok-Ondar was later present during Celebration Chicago.\n\nWithin the Star Wars canon, Dok-Ondar was first mentioned in the 2018 Star Wars Anthology film Solo: A Star Wars Story.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 163.0
      }
    },
    {
      "id": "1629",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu - Behind the scenes[]\n\nThe Traveler's Guide to Batuu appeared in the form of its real-world equivalent, Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. It was written by Cole Horton, in the guise of in-universe character Eloc Throno. The book serves as a guide to Disney Parks' Star Wars: Galaxy's Edge.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 85.0
      }
    },
    {
      "id": "1636",
      "title": "Black Spire",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu locations",
          "Individual trees"
        ],
        "content": "# Black Spire - Behind the scenes[]\n\nBlack Spire was named on trading cards available at Disney's December 16, 2017 \"Galactic Nights\" session, which covered locations for the upcoming Star Wars: Galaxy's Edge attraction. It shared a card with Docking Bay 7. Although the map card containing it lacked an Aurebesh phrase itself, the other map cards, in particular those relating to the cantina, Smuggler's Alley, ancient ruins and Saka Homestead, alluded to the landmark via their respective Aurebesh phrases.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire",
        "title": "Black Spire",
        "tokens": 116.0
      }
    },
    {
      "id": "1631",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu - Behind the scenes[]\n\nThe Traveler's Guide to Batuu appeared in the form of its real-world equivalent, Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. It was written by Cole Horton, in the guise of in-universe character Eloc Throno. The book serves as a guide to Disney Parks' Star Wars: Galaxy's Edge.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 85.0
      }
    },
    {
      "id": "1675",
      "title": "Black Spire Outfitters",
      "metadata": {
        "categories": [
          "Canon articles",
          "Structure stubs",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Black Spire Outfitters - Behind the scenes[]\n\nBlack Spire Outfitters is a clothing store inside Star Wars: Galaxy's Edge at Disneyland Park and Disney's Hollywood Studios.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outfitters",
        "title": "Black Spire Outfitters",
        "tokens": 39.0
      }
    },
    {
      "id": "1620",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - Behind the scenes[]\n\nAt the D23 Expo on August 15, 2015, The Walt Disney Company CEO Bob Iger first announced that the company would be building a Star Wars-themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres in size, making them the largest single land expansions in company history. The two attractions announced for the land included a ride that puts guests behind the controls of the Millennium Falcon and a ride that throws guests into the middle of a battle between the First Order and the Resistance. it was also announced that the lands' setting would be on a yet-to-be-seen planet on the edge of the Outer Rim Territories, just before Wild Space. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019. During the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Asa Kalama of Walt Disney Imagineering stated that what they were building would be canonical.\n\nDuring Galactic Nights, a set of promotional trading cards were issued that hinted at what would be found at the attraction regarding Black Spire Outpost. The front of the cards depicted certain scenes of what was likely to occur, such as an encounter with Kylo Ren, bargaining with Dok-Ondar, and Hondo and Chewbacca agreeing to a deal, among others. The back of each card depicted part of a nine-panel map depicting the various locales of the outpost as well as some details about the specific locations. Eight of the cards had a phrase in Aurebesh describing the location which, thanks to Twitter user Nick Tierce, was revealed to say in full \"At the edge of the galaxy so far away, black was the spire that called me to stay, a beacon for drifters forgotten and lost, the spire summoned those broken and tossed, come stay here forever or just pass on through, the spirit of the black spire will forever change you\".\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 446.0
      }
    },
    {
      "id": "1691",
      "title": "Black Spire: Return to a Shattered Planet",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles that need plot summary",
          "2020 articles and stories",
          "2 more",
          "Canon short stories",
          "Short stories published with novels"
        ],
        "content": "# Black Spire: Return to a Shattered Planet\n\n\"Black Spire:Return to a Shattered Planet\"\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\n\nPublication information\n\nPublisher\nDel Rey\n\n\nRelease date\nJune 30, 2020\n\n\nPublished in\nGalaxy's Edge: Black Spire\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\n[Source]\n\n\n\"Black Spire: Return to a Shattered Planet\" is a short story by Delilah S. Dawson that was published in the paperback of Galaxy's Edge: Black Spire on June 30, 2020. It features Vi Moradi, Chewbacca, Kriki, and Pook as they travel to Parnassos to rescue Siv and Torbi.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Black_Spire:_Return_to_a_Shattered_Planet",
        "title": "Black Spire: Return to a Shattered Planet",
        "tokens": 160.0
      }
    },
    {
      "id": "1661",
      "title": "The Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 articles and stories",
          "Myths & Fables"
        ],
        "content": "# The Black Spire\n\n\"The Black Spire\"\n\nAttribution information\n\nAuthor(s)\nGeorge Mann\n\n\nIllustrator(s)\nGrant Griffin\n\n\n\nPublication information\n\nPublisher\nDisney–Lucasfilm Press\n\n\nRelease date\nAugust 6, 2019\n\n\nPublished in\nMyths & Fables\n\n\nPages\n16\n\n\n\nChronology\n\nPreceded by\n\"The Wanderer\"\n\n\nFollowed by\n\"Gaze of Stone\"\n\n\n[Source]\n\n\n\"The Black Spire\" is a short story that was published in Myths & Fables. The story was authored by George Mann, illustrated by Grant Griffin, and published on August 6, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/The_Black_Spire",
        "title": "The Black Spire",
        "tokens": 131.0
      }
    },
    {
      "id": "1640",
      "title": "Black Spire Outpost Obelisk",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Outpost Obelisk - Behind the scenes[]\n\nThe Black Spire Outpost Obelisk was created as a piece of scenery for Star Wars: Galaxy's Edge, which opened to guests at Disneyland on May 31, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost_Obelisk",
        "title": "Black Spire Outpost Obelisk",
        "tokens": 54.0
      }
    },
    {
      "id": "1688",
      "title": "Black Spire Day",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Black Spire Day - Behind the scenes[]\n\nBlack Spire Day was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It is the in-universe name for celebrations held at Disney parks on \"Star Wars Day\" (May the Fourth).\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Day",
        "title": "Black Spire Day",
        "tokens": 65.0
      }
    },
    {
      "id": "1627",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu\n\nTraveler's Guide to Batuu\n\n\nAttribution information\n\nAuthor(s)\nEloc Throno\n\n\n\nPublication information\n\nRelease date\n34 ABY\n\n\nType\nTravel guide\n\n\n[Source]\n\n\nThe Traveler's Guide to Batuu, subtitled \"Black Spire Outpost and Beyond,\" was a travel guide for the planet Batuu written by galactic explorer Eloc Throno. Throno was extremely fond of the planet and updated the guide more than once.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 105.0
      }
    },
    {
      "id": "1792",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide\n\nStar Wars:The Galactic Explorer's Guide\n\nAttribution information\n\nAuthor(s)\nJason Fry\n\n\n\nPublication information\n\nPublisher\nCarlton Books Limited\n\n\nPublication date\nNovember 14, 2019 (UK)December 20, 2019 (US)\n\n\nType\nHardcover\n\n\nPages\n144\n\n\nDimensions\n8.2×10.6 inches\n\n\nWeight\n1.7 pounds\n\n\nISBN\n9781847961020\n\n\n[Source]\n\nStar Wars: The Galactic Explorer's Guide is a canon reference book that is presented as an in-universe guide for traveling across the Star Wars galaxy. The book is supplemented by the Star Wars AR Book Holoscanner app, which reveals secret contents hidden within the pages. It was written by Jason Fry and first published by Carlton Books Limited for the United Kingdom on November 14, 2019. The book was published in the United States on December 20, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 196.0
      }
    },
    {
      "id": "1704",
      "title": "Black Spire Ruins",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Ruins - Behind the scenes[]\n\nThe Black Spire Ruins on Batuu were revealed in concept art and as part of the Star Wars: Galaxy's Edge model revealed by Disney during the theme park area's development and construction, with Doug Chiang giving some details about it in his interview. This area was believed to be the location of the entrance for Star Wars: Rise of the Resistance and later promotional material confirmed it. It was also present on a trading card titled \"NEW RECRUITS RENDEZVOUS AT THE ANCIENT RUINS\" issued at the Galactic Nights event on December 16, 2017 that gave details about the ride and revealed that the location acted as a staging area for the Resistance, including BB-8.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Ruins",
        "title": "Black Spire Ruins",
        "tokens": 157.0
      }
    },
    {
      "id": "1795",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide - Editions[]\n\nISBN 9781847961020; November 14, 2019; Carlton Books Limited; Hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 36.0
      }
    },
    {
      "id": "1794",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide - Publisher's summary[]\n\nThis fact-packed book-plus-app is an interactive guide to key planets from the Star Wars galaxy. It contains plenty of information, photographs, and diagrams on the page, and the latest Augmented Reality technology brings many interactive elements to enhance the reading experience.\n\nThe traveler's guide to some of the key planets, places, and events from the Star Wars galaxy is a unique tool and a fun reference work. Observe, wonder, and engage with these amazing elements and immerse yourself fully into the galaxy that's far, far away.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 121.0
      }
    },
    {
      "id": "1719",
      "title": "Black Spire Ruins",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Ruins - Behind the scenes[]\n\nThe Black Spire Ruins on Batuu were revealed in concept art and as part of the Star Wars: Galaxy's Edge model revealed by Disney during the theme park area's development and construction, with Doug Chiang giving some details about it in his interview. This area was believed to be the location of the entrance for Star Wars: Rise of the Resistance and later promotional material confirmed it. It was also present on a trading card titled \"NEW RECRUITS RENDEZVOUS AT THE ANCIENT RUINS\" issued at the Galactic Nights event on December 16, 2017 that gave details about the ride and revealed that the location acted as a staging area for the Resistance, including BB-8.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Ruins",
        "title": "Black Spire Ruins",
        "tokens": 157.0
      }
    },
    {
      "id": "1768",
      "title": "Star Wars: Tales from the Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles in need of cleanup",
          "Articles with an excess of redlinks",
          "7 more",
          "Articles with multiple issues",
          "2020 releases",
          "Incomplete Credits",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge\n\nStar Wars:Tales from the Galaxy's Edge\n\nProduction information\n\nDeveloper(s)\nILMxLAB\n\n\nPublisher(s)\nDisney Interactive\n\n\nRelease date\nNovember 19, 2020\n\n\n\nAttribution information\n\nComposer(s)\nBear McCrearyDanny PiccioneJoseph Trapanese\n\n\n\nChronological information\n\nTimeline\n34 ABYBetween 233 BBY and 232 BBY (Temple of Darkness)\n\n\nNext\nStar Wars: Tales from the Galaxy's Edge – Last Call\n\n\n[Source]\n\nStar Wars: Tales from the Galaxy's Edge is an action-adventure VR experience created by ILMxLAB in collaboration with Oculus Quest that was released in 2020. The experience connects to Star Wars: Galaxy's Edge that involves Batuu. It is set between the events of Episode VIII The Last Jedi and Episode IX The Rise of Skywalker and involve Black Spire Outpost.\n\nDifferently from previous VR products by ILMxLAB, Star Wars: Tales from the Galaxy's Edge transitions to storyLIVING, where players are inside a world making consequential choices that drive their experience forward, rather than the previous format of storytelling. As such, it gives players the opportunity to live their own action-packed adventure and explore parts of the galaxy. The original story features new and returning characters with multiple styles of gameplay and difficulty settings in order to accommodate a wide range of players. An enhanced edition of the game released on PlayStation VR2 on February 22, 2023.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
        "title": "Star Wars: Tales from the Galaxy's Edge",
        "tokens": 307.0
      }
    },
    {
      "id": "1824",
      "title": "Pirate's Price",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon middle-grade novels",
          "Flight of the Falcon"
        ],
        "content": "# Pirate's Price - Editions[]\n\nISBN 9781368041515; January 8, 2019; Disney–Lucasfilm Press; US hardcover\nISBN 9781368043823; January 8, 2019; Disney–Lucasfilm Press; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Pirate%27s_Price",
        "title": "Pirate's Price",
        "tokens": 62.0
      }
    },
    {
      "id": "1895",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook) - Editions[]\n\nISBN 9780593150504; August 27, 2019; Random House Audio; Compact disc\nISBN 9780593150511; August 27, 2019; Random House Audio; Digital audiobook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 64.0
      }
    },
    {
      "id": "1887",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook)\n\nGalaxy's Edge: Black Spire\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\nNarrator(s)\nJanuary LaVoy\n\n\nProducer(s)\nNick Martorelli(Executive producer)Kevin Thomsen\n\n\nDirector(s)\nKevin Thomsen\n\n\nCover artist(s)\nDarren Tan(Cover art)Scott Biel(Cover design)\n\n\n\nPublication information\n\nPublisher\nRandom House Audio\n\n\nRelease date\nAugust 27, 2019\n\n\nMedia type\nCompact discDigital audiobook\n\n\nRun time\n12 hours 57 minutes(777 minutes)\n\n\nDiscs\n11\n\n\nISBN\n9780593150504\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\nPreceded by\nPhasma\n\n\n[Source]\n\nGalaxy's Edge: Black Spire is the unabridged audio version of the canon novel of the same name, written by Delilah S. Dawson. The audiobook was performed by January LaVoy and was released by Random House Audio on August 27, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 227.0
      }
    },
    {
      "id": "1890",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook) - Publisher's summary[]\n\nWalk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy's Edge, the upcoming expansion to the Disney Parks experience!\n\nAfter devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy's edge.\n\nA planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help.\n\nTo survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 323.0
      }
    },
    {
      "id": "1892",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook) - Development[]\n\nThe audiobook was performed by January LaVoy and was released by Random House Audio on August 27, 2019 as a digital audiobook and an eleven compact disc set. It was produced and directed by Kevin Thomsen with Nick Martorelli serving as executive producer.\n\n",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 73.0
      }
    },
    {
      "id": "1816",
      "title": "Pirate's Price",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon middle-grade novels",
          "Flight of the Falcon"
        ],
        "content": "# Pirate's Price\n\nPirate's Price\n\nAttribution information\n\nAuthor(s)\nLou Anders\n\n\nCover artist\nAnnie Wu (Cover illustration)Leigh Zieske (Design)Jason Wojtowicz (Design)\n\n\nIllustrator\nAnnie Wu\n\n\n\nPublication information\n\nPublisher\nDisney–Lucasfilm Press\n\n\nRelease date\nJanuary 8, 2019\n\n\nMedia type\nHardcovereBookAudiobook\n\n\nPages\n240\n\n\nISBN\n9781368041515\n\n\n\nChronology\n\nTimeline\n34 ABY (Frame, Part Three)10 BBY (Part One)Before Star Wars: The Force Awakens (Part Two)\n\n\nSeries\nFlight of the Falcon\n\n\n[Source]\n\nPirate's Price is a canon junior novel written by Lou Anders and illustrated by Annie Wu. The book was published on January 8, 2019 by Disney–Lucasfilm Press. Part of the Flight of the Falcon series, Pirate's Price is set after the events of Star Wars: The Last Jedi, and it features Hondo Ohnaka telling stories about his encounters with Han Solo, Chewbacca, and the Millennium Falcon.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Pirate%27s_Price",
        "title": "Pirate's Price",
        "tokens": 232.0
      }
    },
    {
      "id": "1953",
      "title": "Star Wars: Datapad",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "4 more",
          "Game stubs",
          "Incomplete Appearances",
          "Mobile games",
          "Real-world attractions"
        ],
        "content": "# Star Wars: Datapad\n\nStar Wars: Datapad\n\nProduction information\n\nRelease date\nMay 31, 2019\n\n\n[Source]\n\nStar Wars: Datapad, named after the in-universe datapad, is a mobile game found within the Play Disney Parks app that allows guests of Star Wars: Galaxy's Edge to interact with attractions and features in the theme park area at Disneyland and Disney's Hollywood Studios at Walt Disney World. Most features will only work when the user is within Black Spire Outpost. The game was first released as part of a May 24th, 2019 update to the Disneyland section of the app, days prior to the opening of that park's Galaxy's Edge area on May 31st.\n\nFeatures of Datapad include \"hacking\" (to interact with door panels or droids), \"scanning\" (to inspect cargo), \"translation\" (to decode all the Aurebesh signs throughout Galaxy's Edge), \"tuning\" (to listen into secret communications), and \"Outpost Control\" (a game in which visitors choose First Order or Resistance). As users play and explore they will unlock a variety of outfits, equipment, star maps, schematics, droid data, transmissions, and titles. They can also earn credits by completing jobs and gain reputation with the First Order, Resistance, and \"scoundrel\" factions.\n\nA variation of the Datapad app for guests of the Star Wars: Galactic Starcruiser hotel experience was later released, also a part of Play Disney. The Datapad also works in conjunction with the MagicBand+ based \"Star Wars: Batuu Bounty Hunters\" interactive experience exclusive to the Disney's Hollywood Studios version of Star Wars: Galaxy's Edge where the scanner will reveal your quarry.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Datapad",
        "title": "Star Wars: Datapad",
        "tokens": 365.0
      }
    },
    {
      "id": "1947",
      "title": "Star Wars: Galaxy's Edge (media project)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge (media project)\n\nStar Wars: Galaxy's Edge\n\nAttribution information\n\nAuthor(s)\nZoraida CórdovaDelilah S. DawsonGeorge MannEthan SacksChelsea Monroe-CasselMarc Sumerak\n\n\nIllustrator(s)\nGrant GriffinWill Sliney\n\n\n\nPublication information\n\nPublisher\nBecker&mayer!Del ReyDisney–Lucasfilm PressElectronic ArtsILMxLABInsight EditionsIDW PublishingMarvel ComicsWalt Disney Records\n\n\nFirst book published\nApril 24, 2019\n\n\nMedia type\nNovelsComicsReference booksTV Series episodesVideo gamesSoundtracks\n\n\n\nChronology\n\nTimeline\nBetween 34 ABY and 35 ABY\n\n\n[Source]\n\nStar Wars: Galaxy's Edge is a multimedia project consisting of books and comics that center around the Star Wars: Galaxy's Edge theme park. Several of the books take place during the same timeframe as the publishing campaign for Star Wars: Episode IX The Rise of Skywalker, which was developed alongside the ones for The Rise of Skywalker.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge_(media_project)",
        "title": "Star Wars: Galaxy's Edge (media project)",
        "tokens": 215.0
      }
    },
    {
      "id": "2074",
      "title": "A Crash of Fate",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon young-adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# A Crash of Fate - Editions[]\n\nISBN 9781368048538; August 6, 2019; Disney–Lucasfilm Press; US hardcover\nISBN 9781368050685; August 6, 2019; Disney–Lucasfilm Press; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/A_Crash_of_Fate",
        "title": "A Crash of Fate",
        "tokens": 63.0
      }
    },
    {
      "id": "2061",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook\n\nStar Wars: Galaxy's Edge:The Official Black Spire Outpost Cookbook\n\nAttribution information\n\nAuthor(s)\nChelsea Monroe-CasselMarc Sumerak\n\n\nIllustrator(s)\nJoel Hustak\n\n\nEditor(s)\nChris Prince\n\n\n\nPublication information\n\nPublisher\nInsight Editions\n\n\nPublication date\nNovember 5, 2019\n\n\nType\nHardcover\n\n\nPages\n208\n\n\nDimensions\n8 × 10 inches\n\n\nISBN\n9781683837985\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\n[Source]\n\nStar Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook written by Chelsea Monroe-Cassel and Marc Sumerak was published as part of the Star Wars: Galaxy's Edge media project by Insight Editions on November 5, 2019. It was illustrated with art by Joel Hustak and photography by Ted Thomas.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 189.0
      }
    },
    {
      "id": "2072",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nOn January 11, 2018, the Star Wars Launch Bay attraction at Disneyland included a piece of the full model of the upcoming attraction that was unveiled at D23, marking it the second Disney theme park to include part of the scale model, the first being Disney's Hollywood Studios. A short preview video was released on May 22. On May 24, 2019 the Disneyland website and mobile app updated park maps to include, and confirm, the layout of Galaxy's Edge. The Disney Parks Blog revealed new park guide books including the new land.",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 124.0
      }
    },
    {
      "id": "2078",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Merchandise and tie-ins ‡[]\n\nIn April 2019, Lucasfilm launched a Galaxy's Edge publishing campaign, which included a Marvel comic series and the novels Galaxy's Edge: Black Spire, A Crash of Fate and Myths & Fables. Galaxy's Edge has been featured in three episodes of Star Wars Galaxy of Adventures: \"Millennium Falcon - Smugglers Run,\" \"Black Spire Outpost,\" \"Rise of the Resistance.\" A Galaxy's Edge-themed content pack was released for The Sims in September 2020. The Art of Star Wars: Galaxy's Edge was released in Spring 2021. A Hasbro toy line was produced. A LEGO set of the Intersystem Transport Ship was also released; A special code will allow you to use the ship in LEGO Star Wars: The Skywalker Saga.\n\nOriginally, certain merchandise was meant to be sold exclusively inside Galaxy's Edge. However, due to a drop in attendance as a result of park closures and travel restrictions caused by the COVID-19 pandemic, the Disney parks began releasing Galaxy's Edge merchandise outside of the land itself. A variety of merchandise became available at Target stores beginning August 30, 2020. That September, merchandise also became available at Disneyland's WonderGround Gallery and at Walt Disney World's Magic Kingdom Emporium, as well as online and internationally via shopDisney.com.\n\n",
        "section": "Merchandise and tie-ins ‡[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 287.0
      }
    },
    {
      "id": "2042",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Editions[]\n\nISBN 9780593128381; August 27, 2019; Del Rey; US hardcover\nISBN 9780593157114; August 27, 2019; Del Rey; US hardcover, Barnes & Noble Exclusive Edition\nISBN 9780593128398; August 27, 2019; Del Rey; US eBook\nISBN 9780593157107; August 27, 2019; Del Rey; US hardcover, Signed Edition\nISBN 9780593159033; June 30, 2020; Del Rey; US mass market paperback\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 137.0
      }
    },
    {
      "id": "2034",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Publisher's summary[]\n\nWalk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy's Edge, the upcoming expansion to the Disney Parks experience!\n\nAfter devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy's edge.\n\nA planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help.\n\nTo survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 319.0
      }
    },
    {
      "id": "2066",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Editions[]\n\nISBN 9781683837985; November 5, 2019; Insight Editions; US hardcover\nISBN 9781647225360; October 26, 2021; Insight Editions; US hardcover; Gift Set Edition\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 73.0
      }
    },
    {
      "id": "2068",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nIn total, Galaxy's Edge took over six years from concept to final unveiling. Disney CEO Robert Iger first announced it at the D23 Expo on August 15, 2015, stating that the company would be building a Star Wars–themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres, making them the largest single-land expansions in the company's history. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019.\n\nAccording to J. Daniel Jenkins, a former Disney Imagineer who helped design Galaxy's Edge, an early concept for the park would have set it in select locations from Episodes I–VI. This evolved into the original planet Batuu once Iger viewed the first footage from The Force Awakens and became confident in the prospects of the sequel trilogy. Fellow Imagineer Scott Trowbridge explained the reasoning: \"The answer really is we know those places and we know those stories that happen there and we know that we're not in them. Black Spire Outpost is an opportunity that's designed from the very get go to be a place that invites exploration and discovery. A place that invites us to become a character in the world of Star Wars. And to the extent that we want to, to participate in the stories of Star Wars.\" At one point, the Imagineers also considered building two entirely different Star Wars lands instead of two of the same concept.\n\nDuring the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Imagineer Asa Kalama stated that what they were building would be canonical. It was later revealed to take place after The Last Jedi through promotional material for the book series Flight of the Falcon. During development, the attraction had as many as 1,100 Disney employees working on the project. By early 2019, this had dropped to 600.\n\nIn the lead-up to the annual D23 Expo, the Disney Parks Blog unveiled a logo for the event \"Walt Disney Parks and Resorts: A Galaxy of Stories,\" which would debut on July 14–16. The event gave guests a glimpse of the locations, starships, creatures, and droids that would populate the outpost that would act as a setting for the park, and unveiled a detailed model for the 14-acre theme park that would debut in 2019, alongside artwork and media showcasing its development. On December 16, 2017, during the parks' Galactic Nights event, more information about the ride and its development process was unveiled to the public via Lucasfilm vice president Doug Chiang as well as Imagineers Chris Beatty, Robin Reardon, and Scott Trowbridge. In particular, it was revealed via construction photos that development had recently \"topped out\" after the highest construction point was in place. It was also revealed that, among other things, there would be a toy shop with concept art unveiled, with Beatty explaining that the inspiration for its design was from marketplaces in Morocco, and that, fitting with its design inspiration, all the wares are handmade arts and crafts similar to those found in Moroccan marketplaces. In addition, the water fountains would have a unique design. (He later revealed that the overall look of the park was inspired by Petrified Forest National Park.) Much of the production work was handled by the same Pinewood Studios artists who worked on the films.\n\nChiang also revealed that they were building X-wing models for the theme park and differentiated them from the movie models. Some concept art also showcased the Millennium Falcon portion of the attraction, including an entirely new location composed of overgrowth in a sewer-like area. A set of trading cards were also unveiled to the public, which revealed some new details about the ride, in particular confirming that BB-8 and Kylo Ren would be present in the ride, as well as hinting at a droid character called \"R3X\" that was later revealed to be RX-24 from the original Star Tours ride. The same cards also had map pieces that revealed some locations on Batuu, in particular the Surabat River Valley, Docking Bay 9, Merchant Row, and Black Spire Station, would be present in the ride and gave some details about the location and a translation key for an Aurebesh poem on the borders of some cards. Some of the props designed for the land were subsequently used in other Star Wars media, including Star Wars Jedi: Fallen Order and The Mandalorian,\n\nOn January 11, 2018, the Star Wars Launch Bay attraction at Disneyland included a piece of the full model of the upcoming attraction that was unveiled at D23, marking it the second Disney theme park to include part of the scale model, the first being Disney's Hollywood Studios. A short preview video was released on May 22. On May 24, 2019 the Disneyland website and mobile app updated park maps to include, and confirm, the layout of Galaxy's Edge. The Disney Parks Blog revealed new park guide books including the new land.\n\n",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 1079.0
      }
    },
    {
      "id": "2064",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Gift Set Edition[]\n\nInspired by the cuisine from the exciting Star Wars: Galaxy's Edge themed parks at Walt Disney World and Disneyland, the Star Wars: Galaxy's Edge Cookbook Gift Set is the ultimate source for creating out-of-this-world meals and treats from a galaxy far, far away.\n\nJoin intergalactic gourmet chef Strono \"Cookie\" Tuggs for a mouthwatering journey into the cuisine of Black Spire Outpost and beyond.\n\nFrom the swamps of Dagobah to the forests of Endor to the deserts of Jakku, chef extraordinaire Strono \"Cookie\" Tuggs has traveled light-years to compile the galaxy's most delicious recipes into this unique volume. Also included in the set is an exclusive Star Wars: Galaxy's Edge apron with adjustable straps and a large front pocket.\n\nThis comprehensive cookbook gift set is a hyperspace route to the tastiest treats in the galaxy, bringing a little taste of Black Spire Outpost right into your own home.\n\nOVER 70 RECIPES: Journey to the streets of Black Spire Outpost and discover delectable delicacies such as Braised Shaak Roast, Nerf Kebabs, Mustafarian Lava Buns, Huttese Slime Pods, Spicy Mandalorian Stew, and much more.\n\nHIGH-QUALITY APRON: Includes a one-of-a-kind Galaxy's Edge-inspired apron with adjustable straps and a large front pocket.\n\nCOMPLETE YOUR COLLECTION: This gift set is part of Insight Editions' line of bestselling Star Wars products, including Star Wars: Secrets of the Jedi, Star Wars: Knitting the Galaxy, Star Wars: The Lightsaber Collection, and Star Wars: The Ultimate Pop-Up Galaxy, as well as the upcoming Star Wars: Galactic Baking and Star Wars: Secrets of the Sith.\n\n",
        "section": "Gift Set Edition[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 388.0
      }
    },
    {
      "id": "2067",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge\n\nStar Wars: Galaxy's Edge\n\nProduction information\n\nPremiere date\nMay 31, 2019\n\n\n[Source]\n\nStar Wars: Galaxy's Edge is a themed land developed by The Walt Disney Company. It is set in an outpost on the planet Batuu. Until 2022, the events portrayed there took place only between the films The Last Jedi and The Rise of Skywalker. Since 2022, characters from other times are portrayed as well. John Williams composed new music for Galaxy's Edge.\n\nIt opened in phases in parks in the United States, with all of the land except for the Rise of the Resistance attraction opened on May 31, 2019 at Disneyland, and on August 29, 2019 at Disney's Hollywood Studios at Walt Disney World. Rise of the Resistance opened December 5, 2019 at the latter, and January 17, 2020 at the former. A smaller version of the land was announced for Walt Disney Studios Park in Disneyland Paris Resort, but has yet to be built.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 218.0
      }
    },
    {
      "id": "2062",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Original release[]\n\nInspired by the cuisine from the exciting new Star Wars: Galaxy's Edge themed lands at Walt Disney World and Disneyland, the Star Wars: Galaxy's Edge Cookbook is the ultimate source for creating out-of-this-world meals and treats all the way from Black Spire Outpost.\n\nThis exciting new cookbook is inspired by the cuisine from Disney's hugely anticipated theme park expansion, Star Wars: Galaxy's Edge. Based on the delicious delicacies found in Black Spire Outpost on the planet Batuu, this cookbook provides Star Wars fans with a wealth of delicious intergalactic recipes. Engaging, fun, and informative, Star Wars: Galaxy's Edge Cookbook is the definitive guide to the delectable cuisines of a galaxy far, far away.\n\n",
        "section": "Original release[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 170.0
      }
    },
    {
      "id": "2076",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Layout[]\n\nGalaxy's Edge is set on Black Spire Outpost on Batuu, a planet on the edge of the Outer Rim Territories (just before Wild Space). The time period is between the events of The Last Jedi and The Rise of Skywalker. It was designed to feel like a real world, blending seamlessly into the park and having no obvious ride markers. Guests encounter three types of cast members: First Order, Resistance and villagers. Visitors are able to use an app called Star Wars: Datapad to aid in navigating the land; features include \"hacking\" (to interact with door panels or droids), \"scanning\" (to inspect cargo), \"translation\" (to decode all the Aurebesh signs throughout the attraction), \"tuning\" (to listen in to secret communications), and \"Outpost Control\" (a game in which visitors choose First Order or Resistance).\n\nThe park features two attractions: Millennium Falcon: Smuggler's Run (which puts guests behind the controls of the Millennium Falcon) and Star Wars: Rise of the Resistance (which throws guests into the middle of a battle between the First Order and the Resistance). The official names for the attractions were announced November 17, 2018 at the Destination D event. The Target-exclusive Blu-ray for Solo: A Star Wars Story includes a featurette called \"The Millennium Falcon: From Page to Park,\" which details how the Millennium Falcon ride was developed for Galaxy's Edge.\n\nOga's Cantina is a small dining establishment that serves Star Wars–themed food and drink. Coca-Cola products are available at the attraction, with special in-universe Aurebesh designs. Various shops throughout Galaxy's Edge sell in-universe items; in developing these vendors, Disney Imagineers visited Istanbul and Morocco, and looked at old concept art from the Lucasfilm Archives. Visitors can choose to build their own lightsabers at Savi's Workshop, with the option to either make custom lightsabers or choose pre-established designs.\n\n",
        "section": "Layout[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 412.0
      }
    },
    {
      "id": "2077",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Opening ‡[]\n\nGalaxy's Edge received extensive press coverage in February 2019, after select journalists were given a tour of the Disneyland version. During this time, the cast members' costumes were unveiled. On April 13, Galaxy's Edge featured in a panel at Celebration Chicago. During the panel, Mark Hamill appeared via pre-recorded video to announce a Twitter sweepstakes to win a trip to the attraction.\n\nThe land opened on May 31, 2019 at Disneyland. This followed opening ceremonies on May 29, in which Disney CEO Bob Iger was accompanied by George Lucas, Mark Hamill, Harrison Ford, and Billy Dee Williams, with Ford dedicating Millennium Falcon: Smuggler's Run to the late Peter Mayhew. Initial attendance fell significantly below expectations, which Iger attributed to an increase of ticket and hotel prices, a fear of overcrowding, and the fact that Rise of the Resistance had yet to open. Senior EVP and CFO Christine McCarthy also cited lower passholders attendance due to crowd control policies. Several Galaxy's Edge-themed panels were held at Disney's D23 Expo on August 23. The land opened on August 29, 2019 at Disney's Hollywood Studios at Walt Disney World. As before, there was an opening ceremony on the previous day.\n\nFrom September 24-30, a plethora of Galaxy's Edge tie-ins aired on Disney's TV programming on ABC, Freeform, Disney Channel, and ESPN—including the two-hour special Star Wars: Galaxy's Edge – Adventure Awaits on September 29. On November 28, ABC's Magical Holiday Celebration included Portugal. The Man performing at Galaxy's Edge—the first musical act to perform at the land. The land was later covered in episodes of Disney+'s The Imagineering Story and One Day At Disney.\n\nRise of the Resistance opened on December 5, 2019 at Walt Disney World, accompanied by another press tour. It opened on January 17, 2020 at Disneyland. A smaller version of Galaxy's Edge will also open sometime after 2021 at Walt Disney Studios Park at Disneyland Paris Resort. However, as of August 2022, this is now uncertain following the COVID-19 pandemic.\n\nOn May 27, 2022, it was revealed that characters from different timelines will appear as well, such as Boba Fett and Fennec Shand. Characters from different stories and timelines won't intersect with other characters or stories that would not be appropriate for them in their given timeline.\n\nOn July 27, 2022, the Batuu Bounty Hunters game debuted at Walt Disney World. Using the newly introduced MagicBand+ and the Datapad app, guests take jobs locating bounties for the Bounty Hunters' Guild and Batuu's guildmaster Raga Bua.\n\n",
        "section": "Opening ‡[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 579.0
      }
    },
    {
      "id": "2069",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nIn total, Galaxy's Edge took over six years from concept to final unveiling. Disney CEO Robert Iger first announced it at the D23 Expo on August 15, 2015, stating that the company would be building a Star Wars–themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres, making them the largest single-land expansions in the company's history. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019.\n\nAccording to J. Daniel Jenkins, a former Disney Imagineer who helped design Galaxy's Edge, an early concept for the park would have set it in select locations from Episodes I–VI. This evolved into the original planet Batuu once Iger viewed the first footage from The Force Awakens and became confident in the prospects of the sequel trilogy. Fellow Imagineer Scott Trowbridge explained the reasoning: \"The answer really is we know those places and we know those stories that happen there and we know that we're not in them. Black Spire Outpost is an opportunity that's designed from the very get go to be a place that invites exploration and discovery. A place that invites us to become a character in the world of Star Wars. And to the extent that we want to, to participate in the stories of Star Wars.\" At one point, the Imagineers also considered building two entirely different Star Wars lands instead of two of the same concept.\n\nDuring the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Imagineer Asa Kalama stated that what they were building would be canonical. It was later revealed to take place after The Last Jedi through promotional material for the book series Flight of the Falcon. During development, the attraction had as many as 1,100 Disney employees working on the project. By early 2019, this had dropped to 600.\n\nIn the lead-up to the annual D23 Expo, the Disney Parks Blog unveiled a logo for the event \"Walt Disney Parks and Resorts: A Galaxy of Stories,\" which would debut on July 14–16. The event gave guests a glimpse of the locations, starships, creatures, and droids that would populate the outpost that would act as a setting for the park, and unveiled a detailed model for the 14-acre theme park that would debut in 2019, alongside artwork and media showcasing its development. On December 16, 2017, during the parks' Galactic Nights event, more information about the ride and its development process was unveiled to the public via Lucasfilm vice president Doug Chiang as well as Imagineers Chris Beatty, Robin Reardon, and Scott Trowbridge. In particular, it was revealed via construction photos that development had recently \"topped out\" after the highest construction point was in place. It was also revealed that, among other things, there would be a toy shop with concept art unveiled, with Beatty explaining that the inspiration for its design was from marketplaces in Morocco, and that, fitting with its design inspiration, all the wares are handmade arts and crafts similar to those found in Moroccan marketplaces. In addition, the water fountains would have a unique design. (He later revealed that the overall look of the park was inspired by Petrified Forest National Park.) Much of the production work was handled by the same Pinewood Studios artists who worked on the films.\n\nChiang also revealed that they were building X-wing models for the theme park and differentiated them from the movie models. Some concept art also showcased the Millennium Falcon portion of the attraction, including an entirely new location composed of overgrowth in a sewer-like area. A set of trading cards were also unveiled to the public, which revealed some new details about the ride, in particular confirming that BB-8 and Kylo Ren would be present in the ride, as well as hinting at a droid character called \"R3X\" that was later revealed to be RX-24 from the original Star Tours ride. The same cards also had map pieces that revealed some locations on Batuu, in particular the Surabat River Valley, Docking Bay 9, Merchant Row, and Black Spire Station, would be present in the ride and gave some details about the location and a translation key for an Aurebesh poem on the borders of some cards. Some of the props designed for the land were subsequently used in other Star Wars media, including Star Wars Jedi: Fallen Order and The Mandalorian,",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 966.0
      }
    },
    {
      "id": "2032",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire\n\nGalaxy's Edge: Black Spire\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\nCover artist\nDarren Tan (Cover art)Scott Biel (Cover design)Elizabeth A. D. Eno (Book design)Jim C. Hines (Author photo)\n\n\n\nPublication information\n\nPublisher\nDel Rey\n\n\nRelease date\nAugust 27, 2019 (Hardcover, eBook)\n\n\nRerelease date(s)\nJune 30, 2020 (Paperback)\n\n\nMedia type\nHardcoverPaperbackeBookAudiobook\n\n\nPages\n400\n\n\nISBN\n9780593128381\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\n[Source]\n\nGalaxy's Edge: Black Spire is a canon novel written by Delilah S. Dawson. It is part of the Star Wars: Galaxy's Edge media project, and it was first published on August 27, 2019 by Del Rey. An audiobook version was also released.\n\nSet after Dawson's previous Star Wars novel, Phasma, Galaxy's Edge: Black Spire begins during the events of the film Star Wars: Episode VII The Force Awakens. The rest of the story is set four months later, between Star Wars: Episode VIII The Last Jedi and Star Wars: Episode IX The Rise of Skywalker, and prior to the Star Wars: Galaxy's Edge theme park experience.\n\nThe short story \"Black Spire: Return to a Shattered Planet\" was included in the paperback edition of the book.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 322.0
      }
    },
    {
      "id": "2102",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Publisher's summary[]\n\nTHE JEDHA CONNECTION! During the height of the EMPIRE, DOK-ONDAR hired an unlikely team to pull off an impossible score — to steal a relic out of the occupied HOLY CITY OF JEDHA. With FIRST ORDER troops now blanketing the BLACK SPIRE OUTPOST on BATUU, history may finally be catching up to the notorious procurer of the unprocurable. Guest starring fan favorite Outer Rim pirate HONDO OHNAKA! Based on Star Wars: Galaxy's Edge, the new themed land coming this year to Disney Land and Walt Disney World.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 132.0
      }
    },
    {
      "id": "2190",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids\n\nStar Wars: Extraordinary Droids\n\nAttribution information\n\nAuthor(s)\nSimon Beecroft\n\n\n\nPublication information\n\nPublisher\nDK Children\n\n\nPublication date\nApril 7, 2020\n\n\nType\nHardcover\n\n\nPages\n128\n\n\nISBN\n9781465490063\n\n\n[Source]\n\nStar Wars: Extraordinary Droids is a children's reference book that covers various droids within the Star Wars saga, including BB-8. It was written by Simon Beecroft and published in hardcover format by DK Children on April 7, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 125.0
      }
    },
    {
      "id": "2101",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3\n\nGalaxy's Edge 3\n\nAttribution information\n\nWriter\nEthan Sacks\n\n\nPenciller\nWill Sliney\n\n\nInker\nWill Sliney\n\n\nLetterer\nTravis Lanham\n\n\nColorist\nDono Sánchez-AlmaraProtobunker\n\n\nCover artist\nTommy Lee Edwards\n\n\nEditor\nMark Paniccia\n\n\n\nPublication information\n\nPublisher\nMarvel Comics\n\n\nPublication date\nJune 26, 2019\n\n\nPages\n23\n\n\nUPC\n759606093557\n\n\n\nChronological information\n\nTimeline\n34 ABYc. 14 BBY (Flashbacks)\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\nIssue number\n3\n\n\nPreceded by\nGalaxy's Edge 2\n\n\nFollowed by\nGalaxy's Edge 4\n\n\n[Source]\n\nGalaxy's Edge 3 is the third issue of the canon comic book miniseries Star Wars: Galaxy's Edge, which ties in to the theme park of the same name. The issue was written by Ethan Sacks, illustrated by Will Sliney, and published on June 26, 2019 by Marvel Comics.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 235.0
      }
    },
    {
      "id": "2194",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Editions[]\n\nISBN 9781465490063; April 7, 2020; DK children; US hardcover\nISBN 9780744024654; April 7, 2020; DK Children; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 58.0
      }
    },
    {
      "id": "2191",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Hardcover[]\n\nA charming, informative guide to the droids of a galaxy far, far away\n\nThis Star Wars encyclopedia with a twist showcases a world of droids in closeup detail. Arranged from biggest to smallest, the droids of the galaxy are revealed with stunning photography and gorgeous illustrations. The evocative descriptions will delight children and let them discover amazing droid facts, such as how R2-D2 goes down stairs and why GNK droids make a \"gonk gonk\" noise!\n\nEach page features fun droid facts and detailed closeup photographs for children to pore over, including firm favorites such as C-3PO and BB-8, as well more unusual ones such as Professor Huyang, the midwife droid, and the laundry droid.\n\nWith foil on the cover and gilded edges, Star Wars Extraordinary Droids is a perfect gift for children who can't get enough of a galaxy far, far away. The book covers droids big and small, kind and scary, and will be a treasured favorite book.\n\n",
        "section": "Hardcover[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 225.0
      }
    },
    {
      "id": "2192",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Kindle edition[]\n\nFind the droids you know and love and discover new favorites along the way.\n\nThis Star Wars guide with a twist showcases a world of droids in close-up detail. Arranged from smallest to biggest, more than 50 droids of the galaxy are revealed with stunning photography and gorgeous artwork. The evocative descriptions will delight children and let them discover amazing droid facts, such as what tools R2-D2 uses and why GNK droids make a \"gonk gonk\" noise! Each page features fun droid facts and detailed close-up photographs for children to pore over, including firm favorites such as C-3PO and BB-8 as well as more unusual ones such as Professor Huyang, police droids, tiny probe droids, and new The Rise of Skywalker droid D-O.\n\nStar Wars Extraordinary Droids is a perfect gift for children who can't get enough of a galaxy far, far away. The book covers droids small (quiet, little mouse droids) and big (vulture droid starfighters), kind (memoir-writing PZ-4CO) and scary (droidekas), and will be a treasured favorite book to keep.\n\n",
        "section": "Kindle edition[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 256.0
      }
    },
    {
      "id": "2266",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy\n\nStar Wars Bestiary, Vol. 1: Creatures of the Galaxy\n\nAttribution information\n\nAuthor(s)\nS.T. Bende\n\n\nIllustrator(s)\nIris Compiet\n\n\n\nPublication information\n\nPublisher\nInsight Editions\n\n\nPublication date\nOctober 19, 2024 (Early release)November 5, 2024\n\n\nPages\n208\n\n\nISBN\n9798886630985\n\n\n[Source]\n\nStar Wars Bestiary, Vol. 1: Creatures of the Galaxy is a reference book written by S.T. Bende and illustrated by Iris Compiet that was published by Insight Editions on November 5, 2024. The first of two planned volumes, it covers non-sentient species in the Star Wars galaxy. The book also saw an early release at New York Comic Con 2024.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 188.0
      }
    },
    {
      "id": "2257",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide\n\nStar Wars:The Galactic Explorer's Guide\n\nAttribution information\n\nAuthor(s)\nJason Fry\n\n\n\nPublication information\n\nPublisher\nCarlton Books Limited\n\n\nPublication date\nNovember 14, 2019 (UK)December 20, 2019 (US)\n\n\nType\nHardcover\n\n\nPages\n144\n\n\nDimensions\n8.2×10.6 inches\n\n\nWeight\n1.7 pounds\n\n\nISBN\n9781847961020\n\n\n[Source]\n\nStar Wars: The Galactic Explorer's Guide is a canon reference book that is presented as an in-universe guide for traveling across the Star Wars galaxy. The book is supplemented by the Star Wars AR Book Holoscanner app, which reveals secret contents hidden within the pages. It was written by Jason Fry and first published by Carlton Books Limited for the United Kingdom on November 14, 2019. The book was published in the United States on December 20, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 196.0
      }
    },
    {
      "id": "2286",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook\n\nStar Wars: Galaxy's Edge:The Official Black Spire Outpost Cookbook\n\nAttribution information\n\nAuthor(s)\nChelsea Monroe-CasselMarc Sumerak\n\n\nIllustrator(s)\nJoel Hustak\n\n\nEditor(s)\nChris Prince\n\n\n\nPublication information\n\nPublisher\nInsight Editions\n\n\nPublication date\nNovember 5, 2019\n\n\nType\nHardcover\n\n\nPages\n208\n\n\nDimensions\n8 × 10 inches\n\n\nISBN\n9781683837985\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\n[Source]\n\nStar Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook written by Chelsea Monroe-Cassel and Marc Sumerak was published as part of the Star Wars: Galaxy's Edge media project by Insight Editions on November 5, 2019. It was illustrated with art by Joel Hustak and photography by Ted Thomas.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 189.0
      }
    },
    {
      "id": "2267",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy - Official summary[]\n\nExplore the creatures of Star Wars in the first of two books, this one featuring beautiful illustrations of the wondrous non-sentient species from a galaxy far, far away.\n\nFrom Naboo to Hoth, Tatooine to Kashyyyk, and beyond, Star Wars is packed with otherworldly species and monstrous creatures. Dive into the lives, habitats, and behaviors of the non-sentient inhabitants from across the galaxy through original, detailed illustrations and insightful text, to include wampas, banthas, porgs, the fearsome Mythosaur, and so much more. This is a must-have comprehensive compendium for any Star Wars fan who wants a closer look at the fascinating lifeforms from the beloved franchise.\n\nALL-NEW ART: Experience Star Wars in a new way through stunning, original artwork from acclaimed artist Iris Compiet (The Dark Crystal Bestiary: The Definitive Guide to the Creatures of Thra, and Labyrinth: Bestiary - A Definitive Guide to the Creatures of the Goblin King's Realm), featuring your favorite creatures and their habitats.\n\nDISCOVER CREATURES FROM ACROSS THE GALAXY: This book includes an in-depth look at the myriad species from the Star Wars galaxy and their habitats, covering creatures from the films, shows, comics, novels, and more.\n\nAN IDEAL GIFT: A perfect gift for the Star Wars fans of all ages!\n\nAN EPIC ADDITION TO YOUR STAR WARS LIBRARY: A gorgeous volume filled with incredible artwork, Star Wars Bestiary, Vol. 1: Non-sentient Species is an exhaustive exploration of the fantastical creatures of this much-loved galaxy.\n\n",
        "section": "Official summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 364.0
      }
    },
    {
      "id": "2258",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide - Publisher's summary[]\n\nThis fact-packed book-plus-app is an interactive guide to key planets from the Star Wars galaxy. It contains plenty of information, photographs, and diagrams on the page, and the latest Augmented Reality technology brings many interactive elements to enhance the reading experience.\n\nThe traveler's guide to some of the key planets, places, and events from the Star Wars galaxy is a unique tool and a fun reference work. Observe, wonder, and engage with these amazing elements and immerse yourself fully into the galaxy that's far, far away.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 121.0
      }
    },
    {
      "id": "2289",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Editions[]\n\nISBN 9781683837985; November 5, 2019; Insight Editions; US hardcover\nISBN 9781647225360; October 26, 2021; Insight Editions; US hardcover; Gift Set Edition\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 73.0
      }
    },
    {
      "id": "2288",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Gift Set Edition[]\n\nInspired by the cuisine from the exciting Star Wars: Galaxy's Edge themed parks at Walt Disney World and Disneyland, the Star Wars: Galaxy's Edge Cookbook Gift Set is the ultimate source for creating out-of-this-world meals and treats from a galaxy far, far away.\n\nJoin intergalactic gourmet chef Strono \"Cookie\" Tuggs for a mouthwatering journey into the cuisine of Black Spire Outpost and beyond.\n\nFrom the swamps of Dagobah to the forests of Endor to the deserts of Jakku, chef extraordinaire Strono \"Cookie\" Tuggs has traveled light-years to compile the galaxy's most delicious recipes into this unique volume. Also included in the set is an exclusive Star Wars: Galaxy's Edge apron with adjustable straps and a large front pocket.\n\nThis comprehensive cookbook gift set is a hyperspace route to the tastiest treats in the galaxy, bringing a little taste of Black Spire Outpost right into your own home.\n\nOVER 70 RECIPES: Journey to the streets of Black Spire Outpost and discover delectable delicacies such as Braised Shaak Roast, Nerf Kebabs, Mustafarian Lava Buns, Huttese Slime Pods, Spicy Mandalorian Stew, and much more.\n\nHIGH-QUALITY APRON: Includes a one-of-a-kind Galaxy's Edge-inspired apron with adjustable straps and a large front pocket.\n\nCOMPLETE YOUR COLLECTION: This gift set is part of Insight Editions' line of bestselling Star Wars products, including Star Wars: Secrets of the Jedi, Star Wars: Knitting the Galaxy, Star Wars: The Lightsaber Collection, and Star Wars: The Ultimate Pop-Up Galaxy, as well as the upcoming Star Wars: Galactic Baking and Star Wars: Secrets of the Sith.\n\n",
        "section": "Gift Set Edition[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 388.0
      }
    },
    {
      "id": "2259",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide - Editions[]\n\nISBN 9781847961020; November 14, 2019; Carlton Books Limited; Hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 36.0
      }
    },
    {
      "id": "2270",
      "title": "Star Wars: Galaxy's Edge (media project)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge (media project)\n\nStar Wars: Galaxy's Edge\n\nAttribution information\n\nAuthor(s)\nZoraida CórdovaDelilah S. DawsonGeorge MannEthan SacksChelsea Monroe-CasselMarc Sumerak\n\n\nIllustrator(s)\nGrant GriffinWill Sliney\n\n\n\nPublication information\n\nPublisher\nBecker&mayer!Del ReyDisney–Lucasfilm PressElectronic ArtsILMxLABInsight EditionsIDW PublishingMarvel ComicsWalt Disney Records\n\n\nFirst book published\nApril 24, 2019\n\n\nMedia type\nNovelsComicsReference booksTV Series episodesVideo gamesSoundtracks\n\n\n\nChronology\n\nTimeline\nBetween 34 ABY and 35 ABY\n\n\n[Source]\n\nStar Wars: Galaxy's Edge is a multimedia project consisting of books and comics that center around the Star Wars: Galaxy's Edge theme park. Several of the books take place during the same timeframe as the publishing campaign for Star Wars: Episode IX The Rise of Skywalker, which was developed alongside the ones for The Rise of Skywalker.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge_(media_project)",
        "title": "Star Wars: Galaxy's Edge (media project)",
        "tokens": 215.0
      }
    },
    {
      "id": "2268",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy - Media[]\n\nISBN 9798886630985; November 5, 2024; Insight Editions\n\n",
        "section": "Media[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 40.0
      }
    },
    {
      "id": "2287",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Original release[]\n\nInspired by the cuisine from the exciting new Star Wars: Galaxy's Edge themed lands at Walt Disney World and Disneyland, the Star Wars: Galaxy's Edge Cookbook is the ultimate source for creating out-of-this-world meals and treats all the way from Black Spire Outpost.\n\nThis exciting new cookbook is inspired by the cuisine from Disney's hugely anticipated theme park expansion, Star Wars: Galaxy's Edge. Based on the delicious delicacies found in Black Spire Outpost on the planet Batuu, this cookbook provides Star Wars fans with a wealth of delicious intergalactic recipes. Engaging, fun, and informative, Star Wars: Galaxy's Edge Cookbook is the definitive guide to the delectable cuisines of a galaxy far, far away.\n\n",
        "section": "Original release[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 170.0
      }
    },
    {
      "id": "2361",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu - Behind the scenes[]\n\nThe Traveler's Guide to Batuu appeared in the form of its real-world equivalent, Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. It was written by Cole Horton, in the guise of in-universe character Eloc Throno. The book serves as a guide to Disney Parks' Star Wars: Galaxy's Edge.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 85.0
      }
    },
    {
      "id": "2395",
      "title": "The Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 articles and stories",
          "Myths & Fables"
        ],
        "content": "# The Black Spire\n\n\"The Black Spire\"\n\nAttribution information\n\nAuthor(s)\nGeorge Mann\n\n\nIllustrator(s)\nGrant Griffin\n\n\n\nPublication information\n\nPublisher\nDisney–Lucasfilm Press\n\n\nRelease date\nAugust 6, 2019\n\n\nPublished in\nMyths & Fables\n\n\nPages\n16\n\n\n\nChronology\n\nPreceded by\n\"The Wanderer\"\n\n\nFollowed by\n\"Gaze of Stone\"\n\n\n[Source]\n\n\n\"The Black Spire\" is a short story that was published in Myths & Fables. The story was authored by George Mann, illustrated by Grant Griffin, and published on August 6, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/The_Black_Spire",
        "title": "The Black Spire",
        "tokens": 131.0
      }
    },
    {
      "id": "2371",
      "title": "Black Spire Outpost Obelisk",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Outpost Obelisk - Behind the scenes[]\n\nThe Black Spire Outpost Obelisk was created as a piece of scenery for Star Wars: Galaxy's Edge, which opened to guests at Disneyland on May 31, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost_Obelisk",
        "title": "Black Spire Outpost Obelisk",
        "tokens": 54.0
      }
    },
    {
      "id": "2359",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu - Behind the scenes[]\n\nThe Traveler's Guide to Batuu appeared in the form of its real-world equivalent, Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. It was written by Cole Horton, in the guise of in-universe character Eloc Throno. The book serves as a guide to Disney Parks' Star Wars: Galaxy's Edge.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 85.0
      }
    },
    {
      "id": "2357",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu\n\nTraveler's Guide to Batuu\n\n\nAttribution information\n\nAuthor(s)\nEloc Throno\n\n\n\nPublication information\n\nRelease date\n34 ABY\n\n\nType\nTravel guide\n\n\n[Source]\n\n\nThe Traveler's Guide to Batuu, subtitled \"Black Spire Outpost and Beyond,\" was a travel guide for the planet Batuu written by galactic explorer Eloc Throno. Throno was extremely fond of the planet and updated the guide more than once.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 105.0
      }
    },
    {
      "id": "2367",
      "title": "Black Spire",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu locations",
          "Individual trees"
        ],
        "content": "# Black Spire - Behind the scenes[]\n\nBlack Spire was named on trading cards available at Disney's December 16, 2017 \"Galactic Nights\" session, which covered locations for the upcoming Star Wars: Galaxy's Edge attraction. It shared a card with Docking Bay 7. Although the map card containing it lacked an Aurebesh phrase itself, the other map cards, in particular those relating to the cantina, Smuggler's Alley, ancient ruins and Saka Homestead, alluded to the landmark via their respective Aurebesh phrases.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire",
        "title": "Black Spire",
        "tokens": 116.0
      }
    },
    {
      "id": "2314",
      "title": "Life on the Edge: Arrival at Black Spire Outpost",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2019 articles and stories",
          "2 more",
          "Magazine article stubs",
          "Star Wars Insider 192 articles"
        ],
        "content": "# Life on the Edge: Arrival at Black Spire Outpost\n\nLife on the Edge\n\nAttribution information\n\nAuthor(s)\nTricia Barr\n\n\nEditor(s)\nChristopher Cooper\n\n\n\nPublication information\n\nPublisher\nTitan Magazines\n\n\nRelease date\nSeptember 10, 2019\n\n\nPages\n6\n\n\nPublished in\nStar Wars Insider 192\n\n\n[Source]\n\n\n\"Life on the Edge\" is a feature in Star Wars Insider 192 written by Tricia Barr. It is an invented story for the character T'Bar Ricair on a visit to Black Spire Outpost.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Life_on_the_Edge:_Arrival_at_Black_Spire_Outpost",
        "title": "Life on the Edge: Arrival at Black Spire Outpost",
        "tokens": 116.0
      }
    },
    {
      "id": "2320",
      "title": "Black Spire Station",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu stores"
        ],
        "content": "# Black Spire Station - Behind the scenes[]\n\nBlack Spire Station was first unveiled during the December 16, 2017 \"Galactic Nights\" session as part of the map side of several Star Wars: Galaxy's Edge-themed trading cards that were intended to promote the ride. The map cards contained locations for the planet Batuu, as well as a poem in Aurebesh along the border of the card. In Black Spire Station's case, the poem line was \"THOSE BROKEN AND TOSSED\". According to the Walt Disney World news page, Black Spire Station is the place where droid parts could be purchased. The catwalk above the station is a location where Rey, Chewbacca, Vi Moradi or First Order stormtroopers may speak to visitors. Rey and Kylo Ren fought a lightsaber duel on the catwalk during the media event on the opening day of Star Wars: Rise of the Resistance at Hollywood Studios. The Disneyland version of the catwalk was the site of another duel between Rey and Kylo Ren at the conclusion of the Blaze Your Path special event for Make-A-Wish children on 11 September 2024.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Station",
        "title": "Black Spire Station",
        "tokens": 238.0
      }
    },
    {
      "id": "2425",
      "title": "Black Spire Day",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Black Spire Day - Behind the scenes[]\n\nBlack Spire Day was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It is the in-universe name for celebrations held at Disney parks on \"Star Wars Day\" (May the Fourth).\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Day",
        "title": "Black Spire Day",
        "tokens": 65.0
      }
    },
    {
      "id": "2412",
      "title": "Black Spire Outfitters",
      "metadata": {
        "categories": [
          "Canon articles",
          "Structure stubs",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Black Spire Outfitters - Behind the scenes[]\n\nBlack Spire Outfitters is a clothing store inside Star Wars: Galaxy's Edge at Disneyland Park and Disney's Hollywood Studios.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outfitters",
        "title": "Black Spire Outfitters",
        "tokens": 39.0
      }
    },
    {
      "id": "2414",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Behind the scenes[]\n\nThe Walt Disney Parks and Resorts panel at the D23 Expo on July 16, 2017 announced Dok-Ondar as a character that would make appearances in the upcoming theme-park land Star Wars: Galaxy's Edge. The themed lands were opened in 2019, first at Disneyland in Anaheim, California and then at Walt Disney World in Orlando, Florida.\n\nDok-Ondar takes the form of an animatronic that cast-member attendants can interact with, asking how much it will take to part with certain items. A bust of Dok-Ondar was later present during Celebration Chicago.\n\nWithin the Star Wars canon, Dok-Ondar was first mentioned in the 2018 Star Wars Anthology film Solo: A Star Wars Story.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 163.0
      }
    },
    {
      "id": "2428",
      "title": "Black Spire: Return to a Shattered Planet",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles that need plot summary",
          "2020 articles and stories",
          "2 more",
          "Canon short stories",
          "Short stories published with novels"
        ],
        "content": "# Black Spire: Return to a Shattered Planet\n\n\"Black Spire:Return to a Shattered Planet\"\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\n\nPublication information\n\nPublisher\nDel Rey\n\n\nRelease date\nJune 30, 2020\n\n\nPublished in\nGalaxy's Edge: Black Spire\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\n[Source]\n\n\n\"Black Spire: Return to a Shattered Planet\" is a short story by Delilah S. Dawson that was published in the paperback of Galaxy's Edge: Black Spire on June 30, 2020. It features Vi Moradi, Chewbacca, Kriki, and Pook as they travel to Parnassos to rescue Siv and Torbi.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Black_Spire:_Return_to_a_Shattered_Planet",
        "title": "Black Spire: Return to a Shattered Planet",
        "tokens": 160.0
      }
    },
    {
      "id": "2514",
      "title": "Star Wars: Tales from the Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles in need of cleanup",
          "Articles with an excess of redlinks",
          "7 more",
          "Articles with multiple issues",
          "2020 releases",
          "Incomplete Credits",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge\n\nStar Wars:Tales from the Galaxy's Edge\n\nProduction information\n\nDeveloper(s)\nILMxLAB\n\n\nPublisher(s)\nDisney Interactive\n\n\nRelease date\nNovember 19, 2020\n\n\n\nAttribution information\n\nComposer(s)\nBear McCrearyDanny PiccioneJoseph Trapanese\n\n\n\nChronological information\n\nTimeline\n34 ABYBetween 233 BBY and 232 BBY (Temple of Darkness)\n\n\nNext\nStar Wars: Tales from the Galaxy's Edge – Last Call\n\n\n[Source]\n\nStar Wars: Tales from the Galaxy's Edge is an action-adventure VR experience created by ILMxLAB in collaboration with Oculus Quest that was released in 2020. The experience connects to Star Wars: Galaxy's Edge that involves Batuu. It is set between the events of Episode VIII The Last Jedi and Episode IX The Rise of Skywalker and involve Black Spire Outpost.\n\nDifferently from previous VR products by ILMxLAB, Star Wars: Tales from the Galaxy's Edge transitions to storyLIVING, where players are inside a world making consequential choices that drive their experience forward, rather than the previous format of storytelling. As such, it gives players the opportunity to live their own action-packed adventure and explore parts of the galaxy. The original story features new and returning characters with multiple styles of gameplay and difficulty settings in order to accommodate a wide range of players. An enhanced edition of the game released on PlayStation VR2 on February 22, 2023.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
        "title": "Star Wars: Tales from the Galaxy's Edge",
        "tokens": 307.0
      }
    },
    {
      "id": "2605",
      "title": "Star Wars: Tales from the Galaxy's Edge – Last Call",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "7 more",
          "Articles with multiple issues",
          "2021 releases",
          "Game stubs",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge – Last Call\n\nStar Wars: Tales fromthe Galaxy's Edge – Last Call\n\nProduction information\n\nDeveloper(s)\nILMxLAB\n\n\nRelease date\nSeptember 15, 2021\n\n\n\nChronological information\n\nTimeline\n34 ABYc. 220 BBY (The Sacred Garden)3 ABY (The Bounty of Boggs Triff)\n\n\nPrevious\nStar Wars: Tales from the Galaxy's Edge\n\n\n[Source]\n\nStar Wars: Tales from the Galaxy's Edge – Last Call, previously titled Star Wars: Tales from the Galaxy's Edge – Part II, is an action-adventure VR experience created by ILMxLAB in collaboration with Oculus Quest which was released in September 15, 2021. The experience connects to Star Wars: Galaxy's Edge. An enhanced edition of the game released on PlayStation VR on February 22, 2023.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge_–_Last_Call",
        "title": "Star Wars: Tales from the Galaxy's Edge – Last Call",
        "tokens": 184.0
      }
    },
    {
      "id": "2763",
      "title": "Star Wars: Datapad",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "4 more",
          "Game stubs",
          "Incomplete Appearances",
          "Mobile games",
          "Real-world attractions"
        ],
        "content": "# Star Wars: Datapad\n\nStar Wars: Datapad\n\nProduction information\n\nRelease date\nMay 31, 2019\n\n\n[Source]\n\nStar Wars: Datapad, named after the in-universe datapad, is a mobile game found within the Play Disney Parks app that allows guests of Star Wars: Galaxy's Edge to interact with attractions and features in the theme park area at Disneyland and Disney's Hollywood Studios at Walt Disney World. Most features will only work when the user is within Black Spire Outpost. The game was first released as part of a May 24th, 2019 update to the Disneyland section of the app, days prior to the opening of that park's Galaxy's Edge area on May 31st.\n\nFeatures of Datapad include \"hacking\" (to interact with door panels or droids), \"scanning\" (to inspect cargo), \"translation\" (to decode all the Aurebesh signs throughout Galaxy's Edge), \"tuning\" (to listen into secret communications), and \"Outpost Control\" (a game in which visitors choose First Order or Resistance). As users play and explore they will unlock a variety of outfits, equipment, star maps, schematics, droid data, transmissions, and titles. They can also earn credits by completing jobs and gain reputation with the First Order, Resistance, and \"scoundrel\" factions.\n\nA variation of the Datapad app for guests of the Star Wars: Galactic Starcruiser hotel experience was later released, also a part of Play Disney. The Datapad also works in conjunction with the MagicBand+ based \"Star Wars: Batuu Bounty Hunters\" interactive experience exclusive to the Disney's Hollywood Studios version of Star Wars: Galaxy's Edge where the scanner will reveal your quarry.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Datapad",
        "title": "Star Wars: Datapad",
        "tokens": 365.0
      }
    },
    {
      "id": "2797",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge\n\nStar Wars: Galaxy's Edge\n\nProduction information\n\nPremiere date\nMay 31, 2019\n\n\n[Source]\n\nStar Wars: Galaxy's Edge is a themed land developed by The Walt Disney Company. It is set in an outpost on the planet Batuu. Until 2022, the events portrayed there took place only between the films The Last Jedi and The Rise of Skywalker. Since 2022, characters from other times are portrayed as well. John Williams composed new music for Galaxy's Edge.\n\nIt opened in phases in parks in the United States, with all of the land except for the Rise of the Resistance attraction opened on May 31, 2019 at Disneyland, and on August 29, 2019 at Disney's Hollywood Studios at Walt Disney World. Rise of the Resistance opened December 5, 2019 at the latter, and January 17, 2020 at the former. A smaller version of the land was announced for Walt Disney Studios Park in Disneyland Paris Resort, but has yet to be built.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 218.0
      }
    },
    {
      "id": "2721",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Editions[]\n\nISBN 9780760366745; June 23, 2020; becker&mayer!; US hardcover\nISBN 9780760366745; Voyageur Press; UK hardcover\nISBN 9781797236339; April 29, 2025; Chronicle Books; US Hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 84.0
      }
    },
    {
      "id": "2718",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu\n\nStar Wars: Galaxy's Edge:Traveler's Guide to Batuu\n\nAttribution information\n\nAuthor(s)\nCole Horton\n\n\nIllustrator(s)\nChris TrevasChris Reiff\n\n\nEditor(s)\nDelia GreveMeredith Mennitt\n\n\n\nPublication information\n\nPublisher\nbecker&mayer!\n\n\nPublication date\nJune 23, 2020 (digital)July 21, 2020\n\n\nPages\n144\n\n\nISBN\n9780760366745\n\n\n[Source]\n\nStar Wars: Galaxy's Edge: Traveler's Guide to Batuu is a reference book written by Cole Horton and published by becker&mayer!. The book was released digitally on June 23, 2020, and the physical hardcover version was released on July 21, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 173.0
      }
    },
    {
      "id": "2781",
      "title": "Black Spire Ruins",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Ruins - Behind the scenes[]\n\nThe Black Spire Ruins on Batuu were revealed in concept art and as part of the Star Wars: Galaxy's Edge model revealed by Disney during the theme park area's development and construction, with Doug Chiang giving some details about it in his interview. This area was believed to be the location of the entrance for Star Wars: Rise of the Resistance and later promotional material confirmed it. It was also present on a trading card titled \"NEW RECRUITS RENDEZVOUS AT THE ANCIENT RUINS\" issued at the Galactic Nights event on December 16, 2017 that gave details about the ride and revealed that the location acted as a staging area for the Resistance, including BB-8.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Ruins",
        "title": "Black Spire Ruins",
        "tokens": 157.0
      }
    },
    {
      "id": "2719",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Publisher's summary[]\n\nWelcome to Batuu, a trading post at the edge of the galaxy where smugglers, bounty hunters, and rogue adventurers swap stories, food, and goods. Like any good tourist, you're going to need a guide book to lead you through your visit. Here is your official guide.\n\nIn 2019, Disney opened a new Star Wars addition to their parks: The planet Batuu. Star Wars fans now have access to an authentic, in-world experience unlike anything they have ever seen before! This official guide to Batuu is written completely in-world, as if you are a visitor from another part of the galaxy, looking for recommendations on where to eat, sleep, and what to do during your trip to this planet. The guide also provides itineraries and descriptions of weekend trips \"Beyond Batuu\"; getaways to nearby planets and environs.\n\nThe guide features:\n\nFull-color illustrations and maps\nOriginal content from Lucasfilm\nAn in-world experience like no other\n\nWhether strolling in The Galaxy's Edge 15-acre park or simply being an armchair traveler, this immersive guide will delight any Star Wars fan.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 248.0
      }
    },
    {
      "id": "2822",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Opening ‡[]\n\nGalaxy's Edge received extensive press coverage in February 2019, after select journalists were given a tour of the Disneyland version. During this time, the cast members' costumes were unveiled. On April 13, Galaxy's Edge featured in a panel at Celebration Chicago. During the panel, Mark Hamill appeared via pre-recorded video to announce a Twitter sweepstakes to win a trip to the attraction.\n\nThe land opened on May 31, 2019 at Disneyland. This followed opening ceremonies on May 29, in which Disney CEO Bob Iger was accompanied by George Lucas, Mark Hamill, Harrison Ford, and Billy Dee Williams, with Ford dedicating Millennium Falcon: Smuggler's Run to the late Peter Mayhew. Initial attendance fell significantly below expectations, which Iger attributed to an increase of ticket and hotel prices, a fear of overcrowding, and the fact that Rise of the Resistance had yet to open. Senior EVP and CFO Christine McCarthy also cited lower passholders attendance due to crowd control policies. Several Galaxy's Edge-themed panels were held at Disney's D23 Expo on August 23. The land opened on August 29, 2019 at Disney's Hollywood Studios at Walt Disney World. As before, there was an opening ceremony on the previous day.\n\nFrom September 24-30, a plethora of Galaxy's Edge tie-ins aired on Disney's TV programming on ABC, Freeform, Disney Channel, and ESPN—including the two-hour special Star Wars: Galaxy's Edge – Adventure Awaits on September 29. On November 28, ABC's Magical Holiday Celebration included Portugal. The Man performing at Galaxy's Edge—the first musical act to perform at the land. The land was later covered in episodes of Disney+'s The Imagineering Story and One Day At Disney.\n\nRise of the Resistance opened on December 5, 2019 at Walt Disney World, accompanied by another press tour. It opened on January 17, 2020 at Disneyland. A smaller version of Galaxy's Edge will also open sometime after 2021 at Walt Disney Studios Park at Disneyland Paris Resort. However, as of August 2022, this is now uncertain following the COVID-19 pandemic.\n\nOn May 27, 2022, it was revealed that characters from different timelines will appear as well, such as Boba Fett and Fennec Shand. Characters from different stories and timelines won't intersect with other characters or stories that would not be appropriate for them in their given timeline.\n\nOn July 27, 2022, the Batuu Bounty Hunters game debuted at Walt Disney World. Using the newly introduced MagicBand+ and the Datapad app, guests take jobs locating bounties for the Bounty Hunters' Guild and Batuu's guildmaster Raga Bua.\n\n",
        "section": "Opening ‡[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 579.0
      }
    },
    {
      "id": "2829",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3 - Publisher's summary[]\n\nTHE JEDHA CONNECTION! During the height of the EMPIRE, DOK-ONDAR hired an unlikely team to pull off an impossible score — to steal a relic out of the occupied HOLY CITY OF JEDHA. With FIRST ORDER troops now blanketing the BLACK SPIRE OUTPOST on BATUU, history may finally be catching up to the notorious procurer of the unprocurable. Guest starring fan favorite Outer Rim pirate HONDO OHNAKA! Based on Star Wars: Galaxy's Edge, the new themed land coming this year to Disney Land and Walt Disney World.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 132.0
      }
    },
    {
      "id": "2826",
      "title": "Galaxy's Edge 3",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Star Wars: Galaxy's Edge issues"
        ],
        "content": "# Galaxy's Edge 3\n\nGalaxy's Edge 3\n\nAttribution information\n\nWriter\nEthan Sacks\n\n\nPenciller\nWill Sliney\n\n\nInker\nWill Sliney\n\n\nLetterer\nTravis Lanham\n\n\nColorist\nDono Sánchez-AlmaraProtobunker\n\n\nCover artist\nTommy Lee Edwards\n\n\nEditor\nMark Paniccia\n\n\n\nPublication information\n\nPublisher\nMarvel Comics\n\n\nPublication date\nJune 26, 2019\n\n\nPages\n23\n\n\nUPC\n759606093557\n\n\n\nChronological information\n\nTimeline\n34 ABYc. 14 BBY (Flashbacks)\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\nIssue number\n3\n\n\nPreceded by\nGalaxy's Edge 2\n\n\nFollowed by\nGalaxy's Edge 4\n\n\n[Source]\n\nGalaxy's Edge 3 is the third issue of the canon comic book miniseries Star Wars: Galaxy's Edge, which ties in to the theme park of the same name. The issue was written by Ethan Sacks, illustrated by Will Sliney, and published on June 26, 2019 by Marvel Comics.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge_3",
        "title": "Galaxy's Edge 3",
        "tokens": 235.0
      }
    },
    {
      "id": "2804",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nIn total, Galaxy's Edge took over six years from concept to final unveiling. Disney CEO Robert Iger first announced it at the D23 Expo on August 15, 2015, stating that the company would be building a Star Wars–themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres, making them the largest single-land expansions in the company's history. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019.\n\nAccording to J. Daniel Jenkins, a former Disney Imagineer who helped design Galaxy's Edge, an early concept for the park would have set it in select locations from Episodes I–VI. This evolved into the original planet Batuu once Iger viewed the first footage from The Force Awakens and became confident in the prospects of the sequel trilogy. Fellow Imagineer Scott Trowbridge explained the reasoning: \"The answer really is we know those places and we know those stories that happen there and we know that we're not in them. Black Spire Outpost is an opportunity that's designed from the very get go to be a place that invites exploration and discovery. A place that invites us to become a character in the world of Star Wars. And to the extent that we want to, to participate in the stories of Star Wars.\" At one point, the Imagineers also considered building two entirely different Star Wars lands instead of two of the same concept.\n\nDuring the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Imagineer Asa Kalama stated that what they were building would be canonical. It was later revealed to take place after The Last Jedi through promotional material for the book series Flight of the Falcon. During development, the attraction had as many as 1,100 Disney employees working on the project. By early 2019, this had dropped to 600.\n\nIn the lead-up to the annual D23 Expo, the Disney Parks Blog unveiled a logo for the event \"Walt Disney Parks and Resorts: A Galaxy of Stories,\" which would debut on July 14–16. The event gave guests a glimpse of the locations, starships, creatures, and droids that would populate the outpost that would act as a setting for the park, and unveiled a detailed model for the 14-acre theme park that would debut in 2019, alongside artwork and media showcasing its development. On December 16, 2017, during the parks' Galactic Nights event, more information about the ride and its development process was unveiled to the public via Lucasfilm vice president Doug Chiang as well as Imagineers Chris Beatty, Robin Reardon, and Scott Trowbridge. In particular, it was revealed via construction photos that development had recently \"topped out\" after the highest construction point was in place. It was also revealed that, among other things, there would be a toy shop with concept art unveiled, with Beatty explaining that the inspiration for its design was from marketplaces in Morocco, and that, fitting with its design inspiration, all the wares are handmade arts and crafts similar to those found in Moroccan marketplaces. In addition, the water fountains would have a unique design. (He later revealed that the overall look of the park was inspired by Petrified Forest National Park.) Much of the production work was handled by the same Pinewood Studios artists who worked on the films.\n\nChiang also revealed that they were building X-wing models for the theme park and differentiated them from the movie models. Some concept art also showcased the Millennium Falcon portion of the attraction, including an entirely new location composed of overgrowth in a sewer-like area. A set of trading cards were also unveiled to the public, which revealed some new details about the ride, in particular confirming that BB-8 and Kylo Ren would be present in the ride, as well as hinting at a droid character called \"R3X\" that was later revealed to be RX-24 from the original Star Tours ride. The same cards also had map pieces that revealed some locations on Batuu, in particular the Surabat River Valley, Docking Bay 9, Merchant Row, and Black Spire Station, would be present in the ride and gave some details about the location and a translation key for an Aurebesh poem on the borders of some cards. Some of the props designed for the land were subsequently used in other Star Wars media, including Star Wars Jedi: Fallen Order and The Mandalorian,\n\nOn January 11, 2018, the Star Wars Launch Bay attraction at Disneyland included a piece of the full model of the upcoming attraction that was unveiled at D23, marking it the second Disney theme park to include part of the scale model, the first being Disney's Hollywood Studios. A short preview video was released on May 22. On May 24, 2019 the Disneyland website and mobile app updated park maps to include, and confirm, the layout of Galaxy's Edge. The Disney Parks Blog revealed new park guide books including the new land.\n\n",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 1079.0
      }
    },
    {
      "id": "2827",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Merchandise and tie-ins ‡[]\n\nIn April 2019, Lucasfilm launched a Galaxy's Edge publishing campaign, which included a Marvel comic series and the novels Galaxy's Edge: Black Spire, A Crash of Fate and Myths & Fables. Galaxy's Edge has been featured in three episodes of Star Wars Galaxy of Adventures: \"Millennium Falcon - Smugglers Run,\" \"Black Spire Outpost,\" \"Rise of the Resistance.\" A Galaxy's Edge-themed content pack was released for The Sims in September 2020. The Art of Star Wars: Galaxy's Edge was released in Spring 2021. A Hasbro toy line was produced. A LEGO set of the Intersystem Transport Ship was also released; A special code will allow you to use the ship in LEGO Star Wars: The Skywalker Saga.\n\nOriginally, certain merchandise was meant to be sold exclusively inside Galaxy's Edge. However, due to a drop in attendance as a result of park closures and travel restrictions caused by the COVID-19 pandemic, the Disney parks began releasing Galaxy's Edge merchandise outside of the land itself. A variety of merchandise became available at Target stores beginning August 30, 2020. That September, merchandise also became available at Disneyland's WonderGround Gallery and at Walt Disney World's Magic Kingdom Emporium, as well as online and internationally via shopDisney.com.\n\n",
        "section": "Merchandise and tie-ins ‡[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 287.0
      }
    },
    {
      "id": "2871",
      "title": "Black Spire Outpost Obelisk",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Outpost Obelisk - Behind the scenes[]\n\nThe Black Spire Outpost Obelisk was created as a piece of scenery for Star Wars: Galaxy's Edge, which opened to guests at Disneyland on May 31, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost_Obelisk",
        "title": "Black Spire Outpost Obelisk",
        "tokens": 54.0
      }
    },
    {
      "id": "2818",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Layout[]\n\nGalaxy's Edge is set on Black Spire Outpost on Batuu, a planet on the edge of the Outer Rim Territories (just before Wild Space). The time period is between the events of The Last Jedi and The Rise of Skywalker. It was designed to feel like a real world, blending seamlessly into the park and having no obvious ride markers. Guests encounter three types of cast members: First Order, Resistance and villagers. Visitors are able to use an app called Star Wars: Datapad to aid in navigating the land; features include \"hacking\" (to interact with door panels or droids), \"scanning\" (to inspect cargo), \"translation\" (to decode all the Aurebesh signs throughout the attraction), \"tuning\" (to listen in to secret communications), and \"Outpost Control\" (a game in which visitors choose First Order or Resistance).\n\nThe park features two attractions: Millennium Falcon: Smuggler's Run (which puts guests behind the controls of the Millennium Falcon) and Star Wars: Rise of the Resistance (which throws guests into the middle of a battle between the First Order and the Resistance). The official names for the attractions were announced November 17, 2018 at the Destination D event. The Target-exclusive Blu-ray for Solo: A Star Wars Story includes a featurette called \"The Millennium Falcon: From Page to Park,\" which details how the Millennium Falcon ride was developed for Galaxy's Edge.\n\nOga's Cantina is a small dining establishment that serves Star Wars–themed food and drink. Coca-Cola products are available at the attraction, with special in-universe Aurebesh designs. Various shops throughout Galaxy's Edge sell in-universe items; in developing these vendors, Disney Imagineers visited Istanbul and Morocco, and looked at old concept art from the Lucasfilm Archives. Visitors can choose to build their own lightsabers at Savi's Workshop, with the option to either make custom lightsabers or choose pre-established designs.\n\n",
        "section": "Layout[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 412.0
      }
    },
    {
      "id": "2807",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nIn total, Galaxy's Edge took over six years from concept to final unveiling. Disney CEO Robert Iger first announced it at the D23 Expo on August 15, 2015, stating that the company would be building a Star Wars–themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres, making them the largest single-land expansions in the company's history. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019.\n\nAccording to J. Daniel Jenkins, a former Disney Imagineer who helped design Galaxy's Edge, an early concept for the park would have set it in select locations from Episodes I–VI. This evolved into the original planet Batuu once Iger viewed the first footage from The Force Awakens and became confident in the prospects of the sequel trilogy. Fellow Imagineer Scott Trowbridge explained the reasoning: \"The answer really is we know those places and we know those stories that happen there and we know that we're not in them. Black Spire Outpost is an opportunity that's designed from the very get go to be a place that invites exploration and discovery. A place that invites us to become a character in the world of Star Wars. And to the extent that we want to, to participate in the stories of Star Wars.\" At one point, the Imagineers also considered building two entirely different Star Wars lands instead of two of the same concept.\n\nDuring the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Imagineer Asa Kalama stated that what they were building would be canonical. It was later revealed to take place after The Last Jedi through promotional material for the book series Flight of the Falcon. During development, the attraction had as many as 1,100 Disney employees working on the project. By early 2019, this had dropped to 600.\n\nIn the lead-up to the annual D23 Expo, the Disney Parks Blog unveiled a logo for the event \"Walt Disney Parks and Resorts: A Galaxy of Stories,\" which would debut on July 14–16. The event gave guests a glimpse of the locations, starships, creatures, and droids that would populate the outpost that would act as a setting for the park, and unveiled a detailed model for the 14-acre theme park that would debut in 2019, alongside artwork and media showcasing its development. On December 16, 2017, during the parks' Galactic Nights event, more information about the ride and its development process was unveiled to the public via Lucasfilm vice president Doug Chiang as well as Imagineers Chris Beatty, Robin Reardon, and Scott Trowbridge. In particular, it was revealed via construction photos that development had recently \"topped out\" after the highest construction point was in place. It was also revealed that, among other things, there would be a toy shop with concept art unveiled, with Beatty explaining that the inspiration for its design was from marketplaces in Morocco, and that, fitting with its design inspiration, all the wares are handmade arts and crafts similar to those found in Moroccan marketplaces. In addition, the water fountains would have a unique design. (He later revealed that the overall look of the park was inspired by Petrified Forest National Park.) Much of the production work was handled by the same Pinewood Studios artists who worked on the films.\n\nChiang also revealed that they were building X-wing models for the theme park and differentiated them from the movie models. Some concept art also showcased the Millennium Falcon portion of the attraction, including an entirely new location composed of overgrowth in a sewer-like area. A set of trading cards were also unveiled to the public, which revealed some new details about the ride, in particular confirming that BB-8 and Kylo Ren would be present in the ride, as well as hinting at a droid character called \"R3X\" that was later revealed to be RX-24 from the original Star Tours ride. The same cards also had map pieces that revealed some locations on Batuu, in particular the Surabat River Valley, Docking Bay 9, Merchant Row, and Black Spire Station, would be present in the ride and gave some details about the location and a translation key for an Aurebesh poem on the borders of some cards. Some of the props designed for the land were subsequently used in other Star Wars media, including Star Wars Jedi: Fallen Order and The Mandalorian,",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 966.0
      }
    },
    {
      "id": "2808",
      "title": "A Crash of Fate",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon young-adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# A Crash of Fate - Editions[]\n\nISBN 9781368048538; August 6, 2019; Disney–Lucasfilm Press; US hardcover\nISBN 9781368050685; August 6, 2019; Disney–Lucasfilm Press; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/A_Crash_of_Fate",
        "title": "A Crash of Fate",
        "tokens": 63.0
      }
    },
    {
      "id": "2811",
      "title": "Star Wars: Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles to be expanded",
          "Articles with an excess of redlinks",
          "4 more",
          "Unrecognized section headers on real-world media pages",
          "Unrecognized listings found in real-world Sources",
          "Real-world attractions",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge - Development[]\n\nOn January 11, 2018, the Star Wars Launch Bay attraction at Disneyland included a piece of the full model of the upcoming attraction that was unveiled at D23, marking it the second Disney theme park to include part of the scale model, the first being Disney's Hollywood Studios. A short preview video was released on May 22. On May 24, 2019 the Disneyland website and mobile app updated park maps to include, and confirm, the layout of Galaxy's Edge. The Disney Parks Blog revealed new park guide books including the new land.",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge",
        "title": "Star Wars: Galaxy's Edge",
        "tokens": 124.0
      }
    },
    {
      "id": "2953",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids\n\nStar Wars: Extraordinary Droids\n\nAttribution information\n\nAuthor(s)\nSimon Beecroft\n\n\n\nPublication information\n\nPublisher\nDK Children\n\n\nPublication date\nApril 7, 2020\n\n\nType\nHardcover\n\n\nPages\n128\n\n\nISBN\n9781465490063\n\n\n[Source]\n\nStar Wars: Extraordinary Droids is a children's reference book that covers various droids within the Star Wars saga, including BB-8. It was written by Simon Beecroft and published in hardcover format by DK Children on April 7, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 125.0
      }
    },
    {
      "id": "2961",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Kindle edition[]\n\nFind the droids you know and love and discover new favorites along the way.\n\nThis Star Wars guide with a twist showcases a world of droids in close-up detail. Arranged from smallest to biggest, more than 50 droids of the galaxy are revealed with stunning photography and gorgeous artwork. The evocative descriptions will delight children and let them discover amazing droid facts, such as what tools R2-D2 uses and why GNK droids make a \"gonk gonk\" noise! Each page features fun droid facts and detailed close-up photographs for children to pore over, including firm favorites such as C-3PO and BB-8 as well as more unusual ones such as Professor Huyang, police droids, tiny probe droids, and new The Rise of Skywalker droid D-O.\n\nStar Wars Extraordinary Droids is a perfect gift for children who can't get enough of a galaxy far, far away. The book covers droids small (quiet, little mouse droids) and big (vulture droid starfighters), kind (memoir-writing PZ-4CO) and scary (droidekas), and will be a treasured favorite book to keep.\n\n",
        "section": "Kindle edition[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 256.0
      }
    },
    {
      "id": "2911",
      "title": "Pirate's Price",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon middle-grade novels",
          "Flight of the Falcon"
        ],
        "content": "# Pirate's Price\n\nPirate's Price\n\nAttribution information\n\nAuthor(s)\nLou Anders\n\n\nCover artist\nAnnie Wu (Cover illustration)Leigh Zieske (Design)Jason Wojtowicz (Design)\n\n\nIllustrator\nAnnie Wu\n\n\n\nPublication information\n\nPublisher\nDisney–Lucasfilm Press\n\n\nRelease date\nJanuary 8, 2019\n\n\nMedia type\nHardcovereBookAudiobook\n\n\nPages\n240\n\n\nISBN\n9781368041515\n\n\n\nChronology\n\nTimeline\n34 ABY (Frame, Part Three)10 BBY (Part One)Before Star Wars: The Force Awakens (Part Two)\n\n\nSeries\nFlight of the Falcon\n\n\n[Source]\n\nPirate's Price is a canon junior novel written by Lou Anders and illustrated by Annie Wu. The book was published on January 8, 2019 by Disney–Lucasfilm Press. Part of the Flight of the Falcon series, Pirate's Price is set after the events of Star Wars: The Last Jedi, and it features Hondo Ohnaka telling stories about his encounters with Han Solo, Chewbacca, and the Millennium Falcon.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Pirate%27s_Price",
        "title": "Pirate's Price",
        "tokens": 232.0
      }
    },
    {
      "id": "2920",
      "title": "Pirate's Price",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "3 more",
          "Incomplete Appearances",
          "Canon middle-grade novels",
          "Flight of the Falcon"
        ],
        "content": "# Pirate's Price - Editions[]\n\nISBN 9781368041515; January 8, 2019; Disney–Lucasfilm Press; US hardcover\nISBN 9781368043823; January 8, 2019; Disney–Lucasfilm Press; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Pirate%27s_Price",
        "title": "Pirate's Price",
        "tokens": 62.0
      }
    },
    {
      "id": "2968",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Editions[]\n\nISBN 9781465490063; April 7, 2020; DK children; US hardcover\nISBN 9780744024654; April 7, 2020; DK Children; US eBook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 58.0
      }
    },
    {
      "id": "2957",
      "title": "Star Wars: Extraordinary Droids",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Incomplete Appearances",
          "2 more",
          "Canon reference books",
          "Canon Young Readers"
        ],
        "content": "# Star Wars: Extraordinary Droids - Hardcover[]\n\nA charming, informative guide to the droids of a galaxy far, far away\n\nThis Star Wars encyclopedia with a twist showcases a world of droids in closeup detail. Arranged from biggest to smallest, the droids of the galaxy are revealed with stunning photography and gorgeous illustrations. The evocative descriptions will delight children and let them discover amazing droid facts, such as how R2-D2 goes down stairs and why GNK droids make a \"gonk gonk\" noise!\n\nEach page features fun droid facts and detailed closeup photographs for children to pore over, including firm favorites such as C-3PO and BB-8, as well more unusual ones such as Professor Huyang, the midwife droid, and the laundry droid.\n\nWith foil on the cover and gilded edges, Star Wars Extraordinary Droids is a perfect gift for children who can't get enough of a galaxy far, far away. The book covers droids big and small, kind and scary, and will be a treasured favorite book.\n\n",
        "section": "Hardcover[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Extraordinary_Droids",
        "title": "Star Wars: Extraordinary Droids",
        "tokens": 225.0
      }
    },
    {
      "id": "3058",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook)\n\nGalaxy's Edge: Black Spire\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\nNarrator(s)\nJanuary LaVoy\n\n\nProducer(s)\nNick Martorelli(Executive producer)Kevin Thomsen\n\n\nDirector(s)\nKevin Thomsen\n\n\nCover artist(s)\nDarren Tan(Cover art)Scott Biel(Cover design)\n\n\n\nPublication information\n\nPublisher\nRandom House Audio\n\n\nRelease date\nAugust 27, 2019\n\n\nMedia type\nCompact discDigital audiobook\n\n\nRun time\n12 hours 57 minutes(777 minutes)\n\n\nDiscs\n11\n\n\nISBN\n9780593150504\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\nPreceded by\nPhasma\n\n\n[Source]\n\nGalaxy's Edge: Black Spire is the unabridged audio version of the canon novel of the same name, written by Delilah S. Dawson. The audiobook was performed by January LaVoy and was released by Random House Audio on August 27, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 227.0
      }
    },
    {
      "id": "3090",
      "title": "Star Wars: Tales from the Galaxy's Edge – Last Call",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "7 more",
          "Articles with multiple issues",
          "2021 releases",
          "Game stubs",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge – Last Call\n\nStar Wars: Tales fromthe Galaxy's Edge – Last Call\n\nProduction information\n\nDeveloper(s)\nILMxLAB\n\n\nRelease date\nSeptember 15, 2021\n\n\n\nChronological information\n\nTimeline\n34 ABYc. 220 BBY (The Sacred Garden)3 ABY (The Bounty of Boggs Triff)\n\n\nPrevious\nStar Wars: Tales from the Galaxy's Edge\n\n\n[Source]\n\nStar Wars: Tales from the Galaxy's Edge – Last Call, previously titled Star Wars: Tales from the Galaxy's Edge – Part II, is an action-adventure VR experience created by ILMxLAB in collaboration with Oculus Quest which was released in September 15, 2021. The experience connects to Star Wars: Galaxy's Edge. An enhanced edition of the game released on PlayStation VR on February 22, 2023.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge_–_Last_Call",
        "title": "Star Wars: Tales from the Galaxy's Edge – Last Call",
        "tokens": 184.0
      }
    },
    {
      "id": "3062",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook) - Publisher's summary[]\n\nWalk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy's Edge, the upcoming expansion to the Disney Parks experience!\n\nAfter devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy's edge.\n\nA planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help.\n\nTo survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 323.0
      }
    },
    {
      "id": "3065",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook) - Development[]\n\nThe audiobook was performed by January LaVoy and was released by Random House Audio on August 27, 2019 as a digital audiobook and an eleven compact disc set. It was produced and directed by Kevin Thomsen with Nick Martorelli serving as executive producer.\n\n",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 73.0
      }
    },
    {
      "id": "3066",
      "title": "Galaxy's Edge: Black Spire (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Canon adult audiobooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire (audiobook) - Editions[]\n\nISBN 9780593150504; August 27, 2019; Random House Audio; Compact disc\nISBN 9780593150511; August 27, 2019; Random House Audio; Digital audiobook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
        "title": "Galaxy's Edge: Black Spire (audiobook)",
        "tokens": 64.0
      }
    },
    {
      "id": "3132",
      "title": "Black Spire Station",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu stores"
        ],
        "content": "# Black Spire Station - Behind the scenes[]\n\nBlack Spire Station was first unveiled during the December 16, 2017 \"Galactic Nights\" session as part of the map side of several Star Wars: Galaxy's Edge-themed trading cards that were intended to promote the ride. The map cards contained locations for the planet Batuu, as well as a poem in Aurebesh along the border of the card. In Black Spire Station's case, the poem line was \"THOSE BROKEN AND TOSSED\". According to the Walt Disney World news page, Black Spire Station is the place where droid parts could be purchased. The catwalk above the station is a location where Rey, Chewbacca, Vi Moradi or First Order stormtroopers may speak to visitors. Rey and Kylo Ren fought a lightsaber duel on the catwalk during the media event on the opening day of Star Wars: Rise of the Resistance at Hollywood Studios. The Disneyland version of the catwalk was the site of another duel between Rey and Kylo Ren at the conclusion of the Blaze Your Path special event for Make-A-Wish children on 11 September 2024.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Station",
        "title": "Black Spire Station",
        "tokens": 238.0
      }
    },
    {
      "id": "3155",
      "title": "The Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 articles and stories",
          "Myths & Fables"
        ],
        "content": "# The Black Spire\n\n\"The Black Spire\"\n\nAttribution information\n\nAuthor(s)\nGeorge Mann\n\n\nIllustrator(s)\nGrant Griffin\n\n\n\nPublication information\n\nPublisher\nDisney–Lucasfilm Press\n\n\nRelease date\nAugust 6, 2019\n\n\nPublished in\nMyths & Fables\n\n\nPages\n16\n\n\n\nChronology\n\nPreceded by\n\"The Wanderer\"\n\n\nFollowed by\n\"Gaze of Stone\"\n\n\n[Source]\n\n\n\"The Black Spire\" is a short story that was published in Myths & Fables. The story was authored by George Mann, illustrated by Grant Griffin, and published on August 6, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/The_Black_Spire",
        "title": "The Black Spire",
        "tokens": 131.0
      }
    },
    {
      "id": "3190",
      "title": "Black Spire Day",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Black Spire Day - Behind the scenes[]\n\nBlack Spire Day was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It is the in-universe name for celebrations held at Disney parks on \"Star Wars Day\" (May the Fourth).\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Day",
        "title": "Black Spire Day",
        "tokens": 65.0
      }
    },
    {
      "id": "3191",
      "title": "Black Spire: Return to a Shattered Planet",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles that need plot summary",
          "2020 articles and stories",
          "2 more",
          "Canon short stories",
          "Short stories published with novels"
        ],
        "content": "# Black Spire: Return to a Shattered Planet\n\n\"Black Spire:Return to a Shattered Planet\"\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\n\nPublication information\n\nPublisher\nDel Rey\n\n\nRelease date\nJune 30, 2020\n\n\nPublished in\nGalaxy's Edge: Black Spire\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\n[Source]\n\n\n\"Black Spire: Return to a Shattered Planet\" is a short story by Delilah S. Dawson that was published in the paperback of Galaxy's Edge: Black Spire on June 30, 2020. It features Vi Moradi, Chewbacca, Kriki, and Pook as they travel to Parnassos to rescue Siv and Torbi.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Black_Spire:_Return_to_a_Shattered_Planet",
        "title": "Black Spire: Return to a Shattered Planet",
        "tokens": 160.0
      }
    },
    {
      "id": "3165",
      "title": "Black Spire Outfitters",
      "metadata": {
        "categories": [
          "Canon articles",
          "Structure stubs",
          "Batuu stores",
          "Real-world stores"
        ],
        "content": "# Black Spire Outfitters - Behind the scenes[]\n\nBlack Spire Outfitters is a clothing store inside Star Wars: Galaxy's Edge at Disneyland Park and Disney's Hollywood Studios.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outfitters",
        "title": "Black Spire Outfitters",
        "tokens": 39.0
      }
    },
    {
      "id": "3341",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide - Publisher's summary[]\n\nThis fact-packed book-plus-app is an interactive guide to key planets from the Star Wars galaxy. It contains plenty of information, photographs, and diagrams on the page, and the latest Augmented Reality technology brings many interactive elements to enhance the reading experience.\n\nThe traveler's guide to some of the key planets, places, and events from the Star Wars galaxy is a unique tool and a fun reference work. Observe, wonder, and engage with these amazing elements and immerse yourself fully into the galaxy that's far, far away.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 121.0
      }
    },
    {
      "id": "3385",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu\n\nTraveler's Guide to Batuu\n\n\nAttribution information\n\nAuthor(s)\nEloc Throno\n\n\n\nPublication information\n\nRelease date\n34 ABY\n\n\nType\nTravel guide\n\n\n[Source]\n\n\nThe Traveler's Guide to Batuu, subtitled \"Black Spire Outpost and Beyond,\" was a travel guide for the planet Batuu written by galactic explorer Eloc Throno. Throno was extremely fond of the planet and updated the guide more than once.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 105.0
      }
    },
    {
      "id": "3338",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide\n\nStar Wars:The Galactic Explorer's Guide\n\nAttribution information\n\nAuthor(s)\nJason Fry\n\n\n\nPublication information\n\nPublisher\nCarlton Books Limited\n\n\nPublication date\nNovember 14, 2019 (UK)December 20, 2019 (US)\n\n\nType\nHardcover\n\n\nPages\n144\n\n\nDimensions\n8.2×10.6 inches\n\n\nWeight\n1.7 pounds\n\n\nISBN\n9781847961020\n\n\n[Source]\n\nStar Wars: The Galactic Explorer's Guide is a canon reference book that is presented as an in-universe guide for traveling across the Star Wars galaxy. The book is supplemented by the Star Wars AR Book Holoscanner app, which reveals secret contents hidden within the pages. It was written by Jason Fry and first published by Carlton Books Limited for the United Kingdom on November 14, 2019. The book was published in the United States on December 20, 2019.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 196.0
      }
    },
    {
      "id": "3352",
      "title": "Star Wars: Galaxy's Edge (media project)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge (media project)\n\nStar Wars: Galaxy's Edge\n\nAttribution information\n\nAuthor(s)\nZoraida CórdovaDelilah S. DawsonGeorge MannEthan SacksChelsea Monroe-CasselMarc Sumerak\n\n\nIllustrator(s)\nGrant GriffinWill Sliney\n\n\n\nPublication information\n\nPublisher\nBecker&mayer!Del ReyDisney–Lucasfilm PressElectronic ArtsILMxLABInsight EditionsIDW PublishingMarvel ComicsWalt Disney Records\n\n\nFirst book published\nApril 24, 2019\n\n\nMedia type\nNovelsComicsReference booksTV Series episodesVideo gamesSoundtracks\n\n\n\nChronology\n\nTimeline\nBetween 34 ABY and 35 ABY\n\n\n[Source]\n\nStar Wars: Galaxy's Edge is a multimedia project consisting of books and comics that center around the Star Wars: Galaxy's Edge theme park. Several of the books take place during the same timeframe as the publishing campaign for Star Wars: Episode IX The Rise of Skywalker, which was developed alongside the ones for The Rise of Skywalker.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge_(media_project)",
        "title": "Star Wars: Galaxy's Edge (media project)",
        "tokens": 215.0
      }
    },
    {
      "id": "3308",
      "title": "Black Spire",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Batuu locations",
          "Individual trees"
        ],
        "content": "# Black Spire - Behind the scenes[]\n\nBlack Spire was named on trading cards available at Disney's December 16, 2017 \"Galactic Nights\" session, which covered locations for the upcoming Star Wars: Galaxy's Edge attraction. It shared a card with Docking Bay 7. Although the map card containing it lacked an Aurebesh phrase itself, the other map cards, in particular those relating to the cantina, Smuggler's Alley, ancient ruins and Saka Homestead, alluded to the landmark via their respective Aurebesh phrases.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire",
        "title": "Black Spire",
        "tokens": 116.0
      }
    },
    {
      "id": "3351",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy - Media[]\n\nISBN 9798886630985; November 5, 2024; Insight Editions\n\n",
        "section": "Media[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 40.0
      }
    },
    {
      "id": "3334",
      "title": "Dok-Ondar",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Collectors",
          "5 more",
          "Dok-Ondar's Den of Antiquities employees",
          "Individuals with he/him pronouns",
          "Ithorians",
          "Males",
          "Merchants"
        ],
        "content": "# Dok-Ondar - Behind the scenes[]\n\nThe Walt Disney Parks and Resorts panel at the D23 Expo on July 16, 2017 announced Dok-Ondar as a character that would make appearances in the upcoming theme-park land Star Wars: Galaxy's Edge. The themed lands were opened in 2019, first at Disneyland in Anaheim, California and then at Walt Disney World in Orlando, Florida.\n\nDok-Ondar takes the form of an animatronic that cast-member attendants can interact with, asking how much it will take to part with certain items. A bust of Dok-Ondar was later present during Celebration Chicago.\n\nWithin the Star Wars canon, Dok-Ondar was first mentioned in the 2018 Star Wars Anthology film Solo: A Star Wars Story.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Dok-Ondar",
        "title": "Dok-Ondar",
        "tokens": 163.0
      }
    },
    {
      "id": "3350",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy - Official summary[]\n\nExplore the creatures of Star Wars in the first of two books, this one featuring beautiful illustrations of the wondrous non-sentient species from a galaxy far, far away.\n\nFrom Naboo to Hoth, Tatooine to Kashyyyk, and beyond, Star Wars is packed with otherworldly species and monstrous creatures. Dive into the lives, habitats, and behaviors of the non-sentient inhabitants from across the galaxy through original, detailed illustrations and insightful text, to include wampas, banthas, porgs, the fearsome Mythosaur, and so much more. This is a must-have comprehensive compendium for any Star Wars fan who wants a closer look at the fascinating lifeforms from the beloved franchise.\n\nALL-NEW ART: Experience Star Wars in a new way through stunning, original artwork from acclaimed artist Iris Compiet (The Dark Crystal Bestiary: The Definitive Guide to the Creatures of Thra, and Labyrinth: Bestiary - A Definitive Guide to the Creatures of the Goblin King's Realm), featuring your favorite creatures and their habitats.\n\nDISCOVER CREATURES FROM ACROSS THE GALAXY: This book includes an in-depth look at the myriad species from the Star Wars galaxy and their habitats, covering creatures from the films, shows, comics, novels, and more.\n\nAN IDEAL GIFT: A perfect gift for the Star Wars fans of all ages!\n\nAN EPIC ADDITION TO YOUR STAR WARS LIBRARY: A gorgeous volume filled with incredible artwork, Star Wars Bestiary, Vol. 1: Non-sentient Species is an exhaustive exploration of the fantastical creatures of this much-loved galaxy.\n\n",
        "section": "Official summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 364.0
      }
    },
    {
      "id": "3391",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu - Behind the scenes[]\n\nThe Traveler's Guide to Batuu appeared in the form of its real-world equivalent, Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. It was written by Cole Horton, in the guise of in-universe character Eloc Throno. The book serves as a guide to Disney Parks' Star Wars: Galaxy's Edge.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 85.0
      }
    },
    {
      "id": "3389",
      "title": "Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Travel guides"
        ],
        "content": "# Traveler's Guide to Batuu - Behind the scenes[]\n\nThe Traveler's Guide to Batuu appeared in the form of its real-world equivalent, Star Wars: Galaxy's Edge: Traveler's Guide to Batuu. It was written by Cole Horton, in the guise of in-universe character Eloc Throno. The book serves as a guide to Disney Parks' Star Wars: Galaxy's Edge.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Traveler%27s_Guide_to_Batuu",
        "title": "Traveler's Guide to Batuu",
        "tokens": 85.0
      }
    },
    {
      "id": "3368",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Editions[]\n\nISBN 9781683837985; November 5, 2019; Insight Editions; US hardcover\nISBN 9781647225360; October 26, 2021; Insight Editions; US hardcover; Gift Set Edition\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 73.0
      }
    },
    {
      "id": "3344",
      "title": "Star Wars: The Galactic Explorer's Guide",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2019 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars: The Galactic Explorer's Guide - Editions[]\n\nISBN 9781847961020; November 14, 2019; Carlton Books Limited; Hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
        "title": "Star Wars: The Galactic Explorer's Guide",
        "tokens": 36.0
      }
    },
    {
      "id": "3366",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Gift Set Edition[]\n\nInspired by the cuisine from the exciting Star Wars: Galaxy's Edge themed parks at Walt Disney World and Disneyland, the Star Wars: Galaxy's Edge Cookbook Gift Set is the ultimate source for creating out-of-this-world meals and treats from a galaxy far, far away.\n\nJoin intergalactic gourmet chef Strono \"Cookie\" Tuggs for a mouthwatering journey into the cuisine of Black Spire Outpost and beyond.\n\nFrom the swamps of Dagobah to the forests of Endor to the deserts of Jakku, chef extraordinaire Strono \"Cookie\" Tuggs has traveled light-years to compile the galaxy's most delicious recipes into this unique volume. Also included in the set is an exclusive Star Wars: Galaxy's Edge apron with adjustable straps and a large front pocket.\n\nThis comprehensive cookbook gift set is a hyperspace route to the tastiest treats in the galaxy, bringing a little taste of Black Spire Outpost right into your own home.\n\nOVER 70 RECIPES: Journey to the streets of Black Spire Outpost and discover delectable delicacies such as Braised Shaak Roast, Nerf Kebabs, Mustafarian Lava Buns, Huttese Slime Pods, Spicy Mandalorian Stew, and much more.\n\nHIGH-QUALITY APRON: Includes a one-of-a-kind Galaxy's Edge-inspired apron with adjustable straps and a large front pocket.\n\nCOMPLETE YOUR COLLECTION: This gift set is part of Insight Editions' line of bestselling Star Wars products, including Star Wars: Secrets of the Jedi, Star Wars: Knitting the Galaxy, Star Wars: The Lightsaber Collection, and Star Wars: The Ultimate Pop-Up Galaxy, as well as the upcoming Star Wars: Galactic Baking and Star Wars: Secrets of the Sith.\n\n",
        "section": "Gift Set Edition[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 388.0
      }
    },
    {
      "id": "3372",
      "title": "Life on the Edge: Arrival at Black Spire Outpost",
      "metadata": {
        "categories": [
          "Real-world media",
          "Real-world articles needing images",
          "2019 articles and stories",
          "2 more",
          "Magazine article stubs",
          "Star Wars Insider 192 articles"
        ],
        "content": "# Life on the Edge: Arrival at Black Spire Outpost\n\nLife on the Edge\n\nAttribution information\n\nAuthor(s)\nTricia Barr\n\n\nEditor(s)\nChristopher Cooper\n\n\n\nPublication information\n\nPublisher\nTitan Magazines\n\n\nRelease date\nSeptember 10, 2019\n\n\nPages\n6\n\n\nPublished in\nStar Wars Insider 192\n\n\n[Source]\n\n\n\"Life on the Edge\" is a feature in Star Wars Insider 192 written by Tricia Barr. It is an invented story for the character T'Bar Ricair on a visit to Black Spire Outpost.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Life_on_the_Edge:_Arrival_at_Black_Spire_Outpost",
        "title": "Life on the Edge: Arrival at Black Spire Outpost",
        "tokens": 116.0
      }
    },
    {
      "id": "3362",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook\n\nStar Wars: Galaxy's Edge:The Official Black Spire Outpost Cookbook\n\nAttribution information\n\nAuthor(s)\nChelsea Monroe-CasselMarc Sumerak\n\n\nIllustrator(s)\nJoel Hustak\n\n\nEditor(s)\nChris Prince\n\n\n\nPublication information\n\nPublisher\nInsight Editions\n\n\nPublication date\nNovember 5, 2019\n\n\nType\nHardcover\n\n\nPages\n208\n\n\nDimensions\n8 × 10 inches\n\n\nISBN\n9781683837985\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\n[Source]\n\nStar Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook written by Chelsea Monroe-Cassel and Marc Sumerak was published as part of the Star Wars: Galaxy's Edge media project by Insight Editions on November 5, 2019. It was illustrated with art by Joel Hustak and photography by Ted Thomas.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 189.0
      }
    },
    {
      "id": "3347",
      "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2024 releases",
          "Canon reference books"
        ],
        "content": "# Star Wars Bestiary, Vol. 1: Creatures of the Galaxy\n\nStar Wars Bestiary, Vol. 1: Creatures of the Galaxy\n\nAttribution information\n\nAuthor(s)\nS.T. Bende\n\n\nIllustrator(s)\nIris Compiet\n\n\n\nPublication information\n\nPublisher\nInsight Editions\n\n\nPublication date\nOctober 19, 2024 (Early release)November 5, 2024\n\n\nPages\n208\n\n\nISBN\n9798886630985\n\n\n[Source]\n\nStar Wars Bestiary, Vol. 1: Creatures of the Galaxy is a reference book written by S.T. Bende and illustrated by Iris Compiet that was published by Insight Editions on November 5, 2024. The first of two planned volumes, it covers non-sentient species in the Star Wars galaxy. The book also saw an early release at New York Comic Con 2024.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Bestiary%2C_Vol._1:_Creatures_of_the_Galaxy",
        "title": "Star Wars Bestiary, Vol. 1: Creatures of the Galaxy",
        "tokens": 188.0
      }
    },
    {
      "id": "3364",
      "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
      "metadata": {
        "categories": [
          "Real-world media",
          "2019 releases",
          "Incomplete Appearances",
          "3 more",
          "Canon reference books",
          "Real-world cookbooks",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook - Original release[]\n\nInspired by the cuisine from the exciting new Star Wars: Galaxy's Edge themed lands at Walt Disney World and Disneyland, the Star Wars: Galaxy's Edge Cookbook is the ultimate source for creating out-of-this-world meals and treats all the way from Black Spire Outpost.\n\nThis exciting new cookbook is inspired by the cuisine from Disney's hugely anticipated theme park expansion, Star Wars: Galaxy's Edge. Based on the delicious delicacies found in Black Spire Outpost on the planet Batuu, this cookbook provides Star Wars fans with a wealth of delicious intergalactic recipes. Engaging, fun, and informative, Star Wars: Galaxy's Edge Cookbook is the definitive guide to the delectable cuisines of a galaxy far, far away.\n\n",
        "section": "Original release[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
        "title": "Star Wars: Galaxy's Edge: The Official Black Spire Outpost Cookbook",
        "tokens": 170.0
      }
    },
    {
      "id": "3490",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu\n\nStar Wars: Galaxy's Edge:Traveler's Guide to Batuu\n\nAttribution information\n\nAuthor(s)\nCole Horton\n\n\nIllustrator(s)\nChris TrevasChris Reiff\n\n\nEditor(s)\nDelia GreveMeredith Mennitt\n\n\n\nPublication information\n\nPublisher\nbecker&mayer!\n\n\nPublication date\nJune 23, 2020 (digital)July 21, 2020\n\n\nPages\n144\n\n\nISBN\n9780760366745\n\n\n[Source]\n\nStar Wars: Galaxy's Edge: Traveler's Guide to Batuu is a reference book written by Cole Horton and published by becker&mayer!. The book was released digitally on June 23, 2020, and the physical hardcover version was released on July 21, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 173.0
      }
    },
    {
      "id": "3411",
      "title": "Star Wars: Tales from the Galaxy's Edge",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles in need of cleanup",
          "Articles with an excess of redlinks",
          "7 more",
          "Articles with multiple issues",
          "2020 releases",
          "Incomplete Credits",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Star Wars: Galaxy's Edge",
          "Virtual reality games"
        ],
        "content": "# Star Wars: Tales from the Galaxy's Edge\n\nStar Wars:Tales from the Galaxy's Edge\n\nProduction information\n\nDeveloper(s)\nILMxLAB\n\n\nPublisher(s)\nDisney Interactive\n\n\nRelease date\nNovember 19, 2020\n\n\n\nAttribution information\n\nComposer(s)\nBear McCrearyDanny PiccioneJoseph Trapanese\n\n\n\nChronological information\n\nTimeline\n34 ABYBetween 233 BBY and 232 BBY (Temple of Darkness)\n\n\nNext\nStar Wars: Tales from the Galaxy's Edge – Last Call\n\n\n[Source]\n\nStar Wars: Tales from the Galaxy's Edge is an action-adventure VR experience created by ILMxLAB in collaboration with Oculus Quest that was released in 2020. The experience connects to Star Wars: Galaxy's Edge that involves Batuu. It is set between the events of Episode VIII The Last Jedi and Episode IX The Rise of Skywalker and involve Black Spire Outpost.\n\nDifferently from previous VR products by ILMxLAB, Star Wars: Tales from the Galaxy's Edge transitions to storyLIVING, where players are inside a world making consequential choices that drive their experience forward, rather than the previous format of storytelling. As such, it gives players the opportunity to live their own action-packed adventure and explore parts of the galaxy. The original story features new and returning characters with multiple styles of gameplay and difficulty settings in order to accommodate a wide range of players. An enhanced edition of the game released on PlayStation VR2 on February 22, 2023.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
        "title": "Star Wars: Tales from the Galaxy's Edge",
        "tokens": 307.0
      }
    },
    {
      "id": "3491",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Publisher's summary[]\n\nWelcome to Batuu, a trading post at the edge of the galaxy where smugglers, bounty hunters, and rogue adventurers swap stories, food, and goods. Like any good tourist, you're going to need a guide book to lead you through your visit. Here is your official guide.\n\nIn 2019, Disney opened a new Star Wars addition to their parks: The planet Batuu. Star Wars fans now have access to an authentic, in-world experience unlike anything they have ever seen before! This official guide to Batuu is written completely in-world, as if you are a visitor from another part of the galaxy, looking for recommendations on where to eat, sleep, and what to do during your trip to this planet. The guide also provides itineraries and descriptions of weekend trips \"Beyond Batuu\"; getaways to nearby planets and environs.\n\nThe guide features:\n\nFull-color illustrations and maps\nOriginal content from Lucasfilm\nAn in-world experience like no other\n\nWhether strolling in The Galaxy's Edge 15-acre park or simply being an armchair traveler, this immersive guide will delight any Star Wars fan.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 248.0
      }
    },
    {
      "id": "3493",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Editions[]\n\nISBN 9780760366745; June 23, 2020; becker&mayer!; US hardcover\nISBN 9780760366745; Voyageur Press; UK hardcover\nISBN 9781797236339; April 29, 2025; Chronicle Books; US Hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 84.0
      }
    },
    {
      "id": "3741",
      "title": "MW-59",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Comprehensive articles",
          "Individuals of unspecified gender",
          "3 more",
          "Individuals of unspecified species",
          "Individuals with unspecified pronouns",
          "Musicians"
        ],
        "content": "# MW-59 - Behind the scenes[]\n\nMW-59's track \"Batuu Boogie\" first appeared in the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland on May 31, 2019. Though created for the Oga's Cantina bar, the track is also included in the background audio for the restrooms near Droid Depot, Black Spire Station, the market, and in the stand-by queue for the attraction Millennium Falcon: Smuggler's Run. The in-universe artists behind the track were not revealed, however, until the release of the digital album Star Wars: Galaxy's Edge Oga's Cantina: R3X's Playlist #1 on September 6, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/MW-59",
        "title": "MW-59",
        "tokens": 153.0
      }
    },
    {
      "id": "3774",
      "title": "YS-5755",
      "metadata": {
        "categories": [
          "Canon articles",
          "Musicians",
          "R-series astromech droids"
        ],
        "content": "# YS-5755 - Behind the scenes[]\n\nYS-5755's voice appeared in the track \"Goola Bukee\" at the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. YS-5755 was identified as the featuring artist on the song with the release of the digital album Star Wars: Galaxy's Edge Oga's Cantina: R3X's Playlist #1 on September 6, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/YS-5755",
        "title": "YS-5755",
        "tokens": 106.0
      }
    },
    {
      "id": "3762",
      "title": "Chaka Mater Laka",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Comprehensive articles",
          "Individuals of unspecified gender",
          "3 more",
          "Individuals of unspecified species",
          "Individuals with unspecified pronouns",
          "Musicians"
        ],
        "content": "# Chaka Mater Laka - Behind the scenes[]\n\nChaka Mater Laka's musical recording \"Batuu Boogie\" first appeared in the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland on May 31, 2019. The track is used in the Oga's Cantina bar and included in the background audio for the restrooms near Droid Depot, Black Spire Station, the market, and in the stand-by queue for the attraction Millennium Falcon: Smuggler's Run. The in-universe artists behind the track were not revealed, however, until the release of Star Wars: Galaxy's Edge Oga's Cantina: R3X's Playlist #1, a digital album released on September 6, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Chaka_Mater_Laka",
        "title": "Chaka Mater Laka",
        "tokens": 158.0
      }
    },
    {
      "id": "3855",
      "title": "Star Wars: Droidography",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2018 releases",
          "2 more",
          "Incomplete Appearances",
          "Canon reference books"
        ],
        "content": "# Star Wars: Droidography\n\nStar Wars: Droidography\n\nAttribution information\n\nAuthor(s)\nMarc Sumerak\n\n\nIllustrator(s)\nJoel HustakMassimo TravagliniArianna Sabella\n\n\n\nPublication information\n\nPublisher\nHarperFestival\n\n\nPublication date\nNovember 6, 2018\n\n\nType\nHardcover\n\n\nPages\n32\n\n\nDimensions\n10 x 12 inches\n\n\nISBN\n9780062862198\n\n\n[Source]\n\nStar Wars: Droidography is a reference book written by Marc Sumerak. The book is told from the point of view of the battle droid R0-GR from LEGO Star Wars: The Freemaker Adventures. It was published by HarperFestival on November 6, 2018.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Droidography",
        "title": "Star Wars: Droidography",
        "tokens": 157.0
      }
    },
    {
      "id": "3857",
      "title": "Star Wars: Droidography",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2018 releases",
          "2 more",
          "Incomplete Appearances",
          "Canon reference books"
        ],
        "content": "# Star Wars: Droidography - Publisher's summary[]\n\nDroids have always been at the heart of Star Wars, from the classic adventures of C-3PO and R2-D2 to the valiant exploits of BB-8 in the latest episodes of the saga.\n\nDroidography is the ultimate in-universe guide to these lovable characters with insider info on their function and role in the Star Wars universe.\n\nCovering every known model of droid, including free-rolling astromechs, Protocol units, KX-series security models, and even bounty hunter droids, the book is filled with fascinating facts and insights that show just how crucial droids are to every faction in the galaxy, from the Rebellion to the First Order.\n\nWith thrilling original illustrations and amazing special features including lift-the-flaps, textures, and more, Star Wars: Droidography is guaranteed to thrill the saga's legions of young fans.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Droidography",
        "title": "Star Wars: Droidography",
        "tokens": 189.0
      }
    },
    {
      "id": "3864",
      "title": "Star Wars: Droidography",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2018 releases",
          "2 more",
          "Incomplete Appearances",
          "Canon reference books"
        ],
        "content": "# Star Wars: Droidography - Editions[]\n\nISBN 9780062862198; November 6, 2018; HarperFestival; US hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Droidography",
        "title": "Star Wars: Droidography",
        "tokens": 36.0
      }
    },
    {
      "id": "3821",
      "title": "Blom Groffitch",
      "metadata": {
        "categories": [
          "Canon articles",
          "Batuu residents",
          "Entertainers",
          "3 more",
          "Individuals of unspecified gender",
          "Individuals of unspecified species",
          "Individuals with unspecified pronouns"
        ],
        "content": "# Blom Groffitch - Behind the scenes[]\n\nBlom Froffitch was first created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Blom_Groffitch",
        "title": "Blom Groffitch",
        "tokens": 44.0
      }
    },
    {
      "id": "4682",
      "title": "Black Spire Outpost (toy line)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Stubs",
          "Incomplete Appearances",
          "Disney toy lines"
        ],
        "content": "# Black Spire Outpost (toy line)\n\nBlack Spire Outpost (toy line)\n\nPublication information\n\nPublisher\nThe Walt Disney Company\n\n\nRelease date\n2019\n\n\n[Source]\n\nBlack Spire Outpost is the name for the toy line and merchandise line sold at much of Star Wars: Galaxy's Edge, based on the name of the fictional outpost Galaxy's Edge is located in. These products are sold in various locations in the themed area including Toydarian Toymaker and Resistance Supply. The items are branded with the name \"Black Spire Outpost\" printed in Aurebesh letters on the brown and orange packaging.\n\nOther product lines are dedicated to some specific shops such as Droid Depot, Dok-Ondar's Den of Antiquities, and the Creature Stall.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost_%28toy_line%29",
        "title": "Black Spire Outpost (toy line)",
        "tokens": 159.0
      }
    },
    {
      "id": "4852",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire\n\nGalaxy's Edge: Black Spire\n\nAttribution information\n\nAuthor(s)\nDelilah S. Dawson\n\n\nCover artist\nDarren Tan (Cover art)Scott Biel (Cover design)Elizabeth A. D. Eno (Book design)Jim C. Hines (Author photo)\n\n\n\nPublication information\n\nPublisher\nDel Rey\n\n\nRelease date\nAugust 27, 2019 (Hardcover, eBook)\n\n\nRerelease date(s)\nJune 30, 2020 (Paperback)\n\n\nMedia type\nHardcoverPaperbackeBookAudiobook\n\n\nPages\n400\n\n\nISBN\n9780593128381\n\n\n\nChronology\n\nTimeline\n34 ABY\n\n\nSeries\nStar Wars: Galaxy's Edge\n\n\n[Source]\n\nGalaxy's Edge: Black Spire is a canon novel written by Delilah S. Dawson. It is part of the Star Wars: Galaxy's Edge media project, and it was first published on August 27, 2019 by Del Rey. An audiobook version was also released.\n\nSet after Dawson's previous Star Wars novel, Phasma, Galaxy's Edge: Black Spire begins during the events of the film Star Wars: Episode VII The Force Awakens. The rest of the story is set four months later, between Star Wars: Episode VIII The Last Jedi and Star Wars: Episode IX The Rise of Skywalker, and prior to the Star Wars: Galaxy's Edge theme park experience.\n\nThe short story \"Black Spire: Return to a Shattered Planet\" was included in the paperback edition of the book.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 322.0
      }
    },
    {
      "id": "4803",
      "title": "Black Spire Outpost",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu settlements",
          "4 more",
          "Cities",
          "First Order locations",
          "Resistance locations",
          "Spaceports"
        ],
        "content": "# Black Spire Outpost - Behind the scenes[]\n\nAt the D23 Expo on August 15, 2015, The Walt Disney Company CEO Bob Iger first announced that the company would be building a Star Wars-themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World Resort in Orlando, Florida. The announcement stated that these lands would be fourteen acres in size, making them the largest single land expansions in company history. The two attractions announced for the land included a ride that puts guests behind the controls of the Millennium Falcon and a ride that throws guests into the middle of a battle between the First Order and the Resistance. it was also announced that the lands' setting would be on a yet-to-be-seen planet on the edge of the Outer Rim Territories, just before Wild Space. During the Q1 FY17 Earnings call for The Walt Disney Company on February 7, 2017, Iger announced that the new lands would open in the year 2019. During the \"Star Wars and Disney Parks: A Galaxy in the Making\" panel at Celebration Orlando, Asa Kalama of Walt Disney Imagineering stated that what they were building would be canonical.\n\nDuring Galactic Nights, a set of promotional trading cards were issued that hinted at what would be found at the attraction regarding Black Spire Outpost. The front of the cards depicted certain scenes of what was likely to occur, such as an encounter with Kylo Ren, bargaining with Dok-Ondar, and Hondo and Chewbacca agreeing to a deal, among others. The back of each card depicted part of a nine-panel map depicting the various locales of the outpost as well as some details about the specific locations. Eight of the cards had a phrase in Aurebesh describing the location which, thanks to Twitter user Nick Tierce, was revealed to say in full \"At the edge of the galaxy so far away, black was the spire that called me to stay, a beacon for drifters forgotten and lost, the spire summoned those broken and tossed, come stay here forever or just pass on through, the spirit of the black spire will forever change you\".\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost",
        "title": "Black Spire Outpost",
        "tokens": 446.0
      }
    },
    {
      "id": "4854",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Publisher's summary[]\n\nWalk the ancient streets, meet the colorful characters, and uncover the secret history of Star Wars: Galaxy's Edge, the upcoming expansion to the Disney Parks experience!\n\nAfter devastating losses at the hands of the First Order, General Leia Organa has dispatched her agents across the galaxy in search of allies, sanctuary, and firepower—and her top spy, Vi Moradi, may have just found all three, on a secluded world at the galaxy's edge.\n\nA planet of lush forests, precarious mountains, and towering, petrified trees, Batuu is on the furthest possible frontier of the galactic map, the last settled world before the mysterious expanse of Wild Space. The rogues, smugglers, and adventurers who eke out a living on the largest settlement on the planet, Black Spire Outpost, are here to avoid prying eyes and unnecessary complications. Vi, a Resistance spy on the run from the First Order, is hardly a welcome guest. And when a shuttle full of stormtroopers lands in her wake, determined to root her out, she has no idea where to find help.\n\nTo survive, Vi will have to seek out the good-hearted heroes hiding in a world that redefines scum and villainy. With the help of a traitorous trooper and her acerbic droid, she begins to gather a colorful band of outcasts and misfits, and embarks on a mission to spark the fire of resistance on Batuu—before the First Order snuffs it out entirely.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 319.0
      }
    },
    {
      "id": "4865",
      "title": "Galaxy's Edge: Black Spire",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "Articles that need plot summary",
          "3 more",
          "2019 releases",
          "Canon adult novels",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Galaxy's Edge: Black Spire - Editions[]\n\nISBN 9780593128381; August 27, 2019; Del Rey; US hardcover\nISBN 9780593157114; August 27, 2019; Del Rey; US hardcover, Barnes & Noble Exclusive Edition\nISBN 9780593128398; August 27, 2019; Del Rey; US eBook\nISBN 9780593157107; August 27, 2019; Del Rey; US hardcover, Signed Edition\nISBN 9780593159033; June 30, 2020; Del Rey; US mass market paperback\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Galaxy%27s_Edge:_Black_Spire",
        "title": "Galaxy's Edge: Black Spire",
        "tokens": 137.0
      }
    },
    {
      "id": "5811",
      "title": "Dark Legends",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Canon short story anthologies",
          "Dark Legends"
        ],
        "content": "# Dark Legends - Editions[]\n\nISBN 9781368057332; July 28, 2020; Disney–Lucasfilm Press; US hardcover\nISBN 9781368064897; July 28, 2020; Disney–Lucasfilm Press; US eBook\nISBN 9781368065580; August 30, 2020; Disney–Lucasfilm Press; Target-exclusive edition\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Dark_Legends",
        "title": "Dark Legends",
        "tokens": 88.0
      }
    },
    {
      "id": "5943",
      "title": "Batuuan Harvest Festival",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Batuuan Harvest Festival - Behind the scenes[]\n\nThe Batuuan Harvest Festival was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It was first identified by that name in the reference book Star Wars: Galaxy's Edge: Traveler's Guide to Batuu, which is presented as an in-universe document of the same name.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Batuuan_Harvest_Festival",
        "title": "Batuuan Harvest Festival",
        "tokens": 84.0
      }
    },
    {
      "id": "5924",
      "title": "Batuuan Spira",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Currency"
        ],
        "content": "# Batuuan Spira - Behind the scenes[]\n\nThe real–world version of the Batuuan Spira is a gift card that can be purchased for a $100 minimum plus a $4.99 activation fee, first made available at Star Wars: Galaxy's Edge in Disneyland upon the theme park area's opening on May 31st, 2019. It can be used wherever a standard Disney Gift Card is accepted.\n\nThe original version of the Spira available from the opening of Galaxy's Edge was dull yellow or golden in color, but it was discontinued and replaced by a silver version on September 1st, 2020. The silver Spira introduced the added $4.99 activation fee. A copper version was introduced on May 4, 2024.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Batuuan_Spira",
        "title": "Batuuan Spira",
        "tokens": 159.0
      }
    },
    {
      "id": "5993",
      "title": "Batuu",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Locations in grid square G-15",
          "8 more",
          "Arboreal planets",
          "Batuu locations",
          "First Order planets",
          "Jedi planets",
          "Rocky planets",
          "Shadowports",
          "Trilon sector planets",
          "Western Reaches planets"
        ],
        "content": "# Batuu - Behind the scenes[]\n\nDisney CEO Robert Iger first announced at the D23 Expo on August 15, 2015 that the company would be building a Star Wars–themed land in Disneyland Park at the Disneyland Resort in Anaheim, California and in Disney's Hollywood Studios at the Walt Disney World in Orlando, Florida. It was also announced that the lands' setting would be an outpost on a yet-to-be-seen planet on the edge of the Outer Rim Territories, just before Wild Space.\n\nBatuu's landscape of mountains and rock spires came about as a necessity for the Disneyland installation of Galaxy's Edge, which required the re-routing of the Disneyland Railroad and the Rivers of America in Frontierland. The reworked northern bend of the river features rocky cliffs, trees and waterfalls that block views of the trading post to visitors riding the various vehicles that travel along the river. In turn, Batuu's mountains and spires become an extended background element for the river, allowing for Galaxy's Edge and Frontierland to better function as neighbors. Real-world inspirations for this rockwork includes Bandelier National Monument and the Bisti Badlands in New Mexico, Badlands National Park in South Dakota, and Petrified Forest National Park in Arizona.\n\nIn an interview with StarWars.com about his 2018 novel Thrawn: Alliances, author Timothy Zahn expressed interest in exploring Batuu more in future books.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Batuu",
        "title": "Batuu",
        "tokens": 288.0
      }
    },
    {
      "id": "6007",
      "title": "Batuu system",
      "metadata": {
        "categories": [
          "Canon articles",
          "Locations in grid square G-15",
          "Trilon sector star systems",
          "Trinary star systems"
        ],
        "content": "# Batuu system - Behind the scenes[]\n\nThe Batuu system was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. However, prior to the opening of the park it first appeared in various tie-in material, starting with the non-canon Star Tours: The Adventures Continue in 2017. The system's first canon appearance was in the 2018 novel Thrawn: Alliances, which was written by Timothy Zahn. None of the sources released prior to the opening of the park identified the Batuu system, but staff at Galaxy's Edge were informed of the system's name to share with guests.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Batuu_system",
        "title": "Batuu system",
        "tokens": 138.0
      }
    },
    {
      "id": "6360",
      "title": "Pinteeka Dub",
      "metadata": {
        "categories": [
          "Real-world music",
          "Real world music stubs",
          "Themes and leitmotifs"
        ],
        "content": "# Pinteeka Dub\n\n\"Pinteeka Dub\"\n\nGeneral information\n\nComposer\nDanny Piccione\n\n\nReleased\n2020\n\n\n\nMusical details\n\nLength\n2:23\n\n\n\nUsage information\n\nCanon\nTales from the Galaxy's Edge\n\n\n[Source]\n\n\"Pinteeka Dub \" is a piece of cantina music composed by Danny Piccione for the action-adventure VR experience Star Wars: Tales from the Galaxy's Edge. The theme was initially released on ILMxLAB's YouTube channel on November 12, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Pinteeka_Dub",
        "title": "Pinteeka Dub",
        "tokens": 109.0
      }
    },
    {
      "id": "6479",
      "title": "Star Wars: Episode I The Phantom Menace (book-and-record)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles that need plot summary",
          "1999 releases",
          "3 more",
          "Incomplete Appearances",
          "Book-and-Record",
          "Legends Young Readers"
        ],
        "content": "# Star Wars: Episode I The Phantom Menace (book-and-record)\n\nStar Wars: Episode I The Phantom Menace\n\nAttribution information\n\nAuthor(s)\nJohn WhitmanMatt Oppenheimer\n\n\nNarrator(s)\nPeter Francis James\n\n\nProducer(s)\nMatt Oppenheimer(Executive producer)Kevin Thomsen\n\n\nDirector(s)\nKevin ThomsenPaul Goodrich(Recording & editing)Zed Starkovich(Recording & editing)Bob Fisher(Mastered by)\n\n\nCover artist(s)\nRachel Gutek (Designer)Hugh Brown(Background photos)\n\n\n\nPublication information\n\nPublisher\nKid Rhino\n\n\nRelease date\nMay, 1999\n\n\nMedia type\nRead–along book (Cassette)Read–along book (Compact disc)\n\n\nRun time\n20 minutes\n\n\nDiscs\n1\n\n\nCassettes\n1\n\n\nPages\n24\n\n\nISBN\n9781568269962\n\n\n\nChronology\n\nTimeline\n32 BBY\n\n\n[Source]\n\nStar Wars Episode I: The Phantom Menace is a young readers' read–along adaptation of the movie of the same name. It was narrated by Peter Francis James and featured audio clips from the film. It was published by Kid Rhino in May 1999 and released as a book with cassette and book with compact disc. The cassette tape version was packaged with one of four different Micro Machines toys.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_%28book-and-record%29",
        "title": "Star Wars: Episode I The Phantom Menace (book-and-record)",
        "tokens": 270.0
      }
    },
    {
      "id": "6486",
      "title": "Star Wars: Episode I The Phantom Menace (book-and-record)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles that need plot summary",
          "1999 releases",
          "3 more",
          "Incomplete Appearances",
          "Book-and-Record",
          "Legends Young Readers"
        ],
        "content": "# Star Wars: Episode I The Phantom Menace (book-and-record) - Publisher summary[]\n\nThe story of \"The Phantom Menace\" is retold in this 30-minute movie adaptation featuring the voices of Liam Neeson, Ewan McGregor, Natalie Portman and Samuel L. Jackson, plus 3D sound effects, John Williams' stirring \"Star Wars\" music, a full-color, 24-page read-along book with photos from the movie, and--for a limited time--one of four Micro Machines toys from \"Episode I\".\n\n",
        "section": "Publisher summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_%28book-and-record%29",
        "title": "Star Wars: Episode I The Phantom Menace (book-and-record)",
        "tokens": 112.0
      }
    },
    {
      "id": "6491",
      "title": "Star Wars: Episode I The Phantom Menace (book-and-record)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles that need plot summary",
          "1999 releases",
          "3 more",
          "Incomplete Appearances",
          "Book-and-Record",
          "Legends Young Readers"
        ],
        "content": "# Star Wars: Episode I The Phantom Menace (book-and-record) - Editions[]\n\nISBN 9781568269962; May, 1999; Kid Rhino; Book with cassette tape\nISBN 9781568269979; May, 1999; Kid Rhino; Book wit compact disc\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_%28book-and-record%29",
        "title": "Star Wars: Episode I The Phantom Menace (book-and-record)",
        "tokens": 64.0
      }
    },
    {
      "id": "6595",
      "title": "Pipa Tuba Braba",
      "metadata": {
        "categories": [
          "Canon articles",
          "Songs"
        ],
        "content": "# Pipa Tuba Braba - Behind the scenes[]\n\n\"Pipa Tuba Braba\" was created for the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. It can be heard playing during the land's background radio loop.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Pipa_Tuba_Braba",
        "title": "Pipa Tuba Braba",
        "tokens": 63.0
      }
    },
    {
      "id": "6673",
      "title": "Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "2024 releases",
          "Ultimate Star Wars"
        ],
        "content": "# Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy - Editions[]\n\nISBN 9780744098846; November 19, 2024; Dorling Kindersley; US hardcover\nISBN 9780593963050; October 28, 2025; Spanish hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Encyclopedia:_The_Comprehensive_Guide_to_the_Star_Wars_Galaxy",
        "title": "Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy",
        "tokens": 64.0
      }
    },
    {
      "id": "6666",
      "title": "Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "2024 releases",
          "Ultimate Star Wars"
        ],
        "content": "# Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy\n\nStar Wars Encyclopedia:The Comprehensive Guide to the Star Wars Galaxy\n\nAttribution information\n\nAuthor(s)\nDan BrooksMegan CrouseAmy RichauAmy RatcliffeBrandon WainerdiDan ZehrKelly KnoxRyder WindhamAdam BrayDaniel WallaceMatt JonesPatricia BarrCole Horton\n\n\n\nPublication information\n\nPublisher\nDorling Kindersley\n\n\nPublication date\nNovember 19, 2024 (US)November 7, 2024 (UK)\n\n\nType\nHardcover\n\n\nPages\n448\n\n\nDimensions\n9.2 × 6 in\n\n\nWeight\n1.3 lb\n\n\nISBN\n9780744098846\n\n\n[Source]\n\nStar Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy is a reference book which was published by Dorling Kindersley on November 19, 2024. It is an updated version of the previous reference books Ultimate Star Wars (2015) and Ultimate Star Wars, New Edition (2019).\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Encyclopedia:_The_Comprehensive_Guide_to_the_Star_Wars_Galaxy",
        "title": "Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy",
        "tokens": 206.0
      }
    },
    {
      "id": "6668",
      "title": "Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy",
      "metadata": {
        "categories": [
          "Real-world media",
          "2024 releases",
          "Ultimate Star Wars"
        ],
        "content": "# Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy - Official summary[]\n\nContaining more than 2,200 entries from the most current Star Wars film and TV series, discover the vital facts about iconic characters, creatures, locations, vehicles, and technology from a galaxy far, far away….\n\nThis definitive title reveals comprehensive histories of 1,200 characters, from icons like Lando Calrissian and Leia Organa to lesser-known individuals like Max Rebo and Therm Scissorpunch.\nFrom terrifying rancors to adorable porgs, learn about more than 100 fascinating creatures.\nChart your way through the galaxy with more than 275 entries on locations, including Darth Vader's castle on Mustafar and the mystical World Between Worlds.\nPick your method of transport from more than 275 vehicles, from the legendary Millennium Falcon to the stylish Naboo N-1 starfighter.\nGet up to speed with the latest technology, including the Mandalorian's beskar armor, Luke Skywalker's lightsaber, and more than 275 other pieces of equipment.\n\nProduced in close collaboration with Lucasfilm, this official title is the most comprehensive reference book on the Star Wars galaxy on the market. Meticulously researched, expertly written, and stunningly illustrated, The Star Wars Encyclopedia is an indispensable guide to that devoted fans and newcomers alike will return to time and again.\n\n",
        "section": "Official summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars_Encyclopedia:_The_Comprehensive_Guide_to_the_Star_Wars_Galaxy",
        "title": "Star Wars Encyclopedia: The Comprehensive Guide to the Star Wars Galaxy",
        "tokens": 278.0
      }
    },
    {
      "id": "6824",
      "title": "Sail Barge Blues",
      "metadata": {
        "categories": [
          "Canon articles",
          "Songs"
        ],
        "content": "# Sail Barge Blues - Behind the scenes[]\n\nSail Barge Blues was first mentioned in Star Wars: Galaxy's Edge, which opened to guests at Disneyland on May 31, 2019.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Sail_Barge_Blues",
        "title": "Sail Barge Blues",
        "tokens": 42.0
      }
    },
    {
      "id": "6865",
      "title": "Stay on Target (sourcebook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Star Wars: Age of Rebellion sourcebooks"
        ],
        "content": "# Stay on Target (sourcebook)\n\nStay on Target\n\nAttribution information\n\nAuthor(s)\nAndrew Fischer (Developer)John CrowdisSterling HersheyKeith KappelJason Marker\n\n\nCover artist\nDavid KeggMatt Bradbury\n\n\nIllustrator(s)\nCristi BalanescuTey BartolomeArden BeckwithMadeline BoniAlberto BontempiMatt BradburyNora BrisottiChristopher BurdettSidharth ChaturvediAnthony DevineTony FotiMariusz GandzelDavid GriffithJoel HustakJeff Lee JohnsonJason JutaMark MolnarJake MurrayThomas Wievegg\n\n\n\nPublication information\n\nPublisher\nFantasy Flight Games\n\n\nPublication date\nDecember 23, 2014\n\n\nPages\n96\n\n\nISBN\n9781633440197\n\n\nSeries\nStar Wars: Age of Rebellion\n\n\n[Source]\n\nStay on Target is an expansion for Fantasy Flight Games' Star Wars: Age of Rebellion roleplaying game. It focuses on the Ace character specialization, adding new abilities and vehicles. It was released on December 23, 2014. The sourcebook is divided into three chapters, introducing new Ace backgrounds, equipment, and game rules.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Stay_on_Target_%28sourcebook%29",
        "title": "Stay on Target (sourcebook)",
        "tokens": 241.0
      }
    },
    {
      "id": "6857",
      "title": "Black Spire Outpost (episode)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2020 releases",
          "Star Wars Galaxy of Adventures episodes"
        ],
        "content": "# Black Spire Outpost (episode)\n\n\"Black Spire Outpost\"\n\nProduction information\n\nSeries\nStar Wars Galaxy of Adventures\n\n\nEpisode\n52\n\n\nAir date\nAugust 27, 2020\n\n\nRun time\n1 minute\n\n\n\nEpisode chronology\n\nTimeline\n34 ABY\n\n\nPrevious episode\n\"Millennium Falcon - Smugglers Run\"\n\n\nNext episode\n\"Rise of the Resistance\"\n\n\n[Source]\n\n\n\"Black Spire Outpost\" is the fifty-second episode of Star Wars Galaxy of Adventures. It premiered on the Star Wars Kids YouTube channel on August 27, 2020.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Outpost_%28episode%29",
        "title": "Black Spire Outpost (episode)",
        "tokens": 122.0
      }
    },
    {
      "id": "6872",
      "title": "Stay on Target (sourcebook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Star Wars: Age of Rebellion sourcebooks"
        ],
        "content": "# Stay on Target (sourcebook) - Editions[]\n\nISBN 9781633440197; December 23, 2014; Fantasy Flight Games; US hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Stay_on_Target_%28sourcebook%29",
        "title": "Stay on Target (sourcebook)",
        "tokens": 37.0
      }
    },
    {
      "id": "6869",
      "title": "Stay on Target (sourcebook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Star Wars: Age of Rebellion sourcebooks"
        ],
        "content": "# Stay on Target (sourcebook) - Publisher's summary[]\n\nThe first book-length rules supplement for the Star Wars®: Age of Rebellion™ Roleplaying Game, Stay on Target focuses on expanding the Ace career, making it more versatile and allowing your Ace characters to hone their talents to all-new levels! You'll find three new Ace specializations, as well as new signature abilities, playable species, starfighters, modifications, and equipment. Game Masters gain new tools to help them incorporate Aces, starfighters, mounts, and rivals into a wide range of exciting and memorable adventures....\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Stay_on_Target_%28sourcebook%29",
        "title": "Stay on Target (sourcebook)",
        "tokens": 118.0
      }
    },
    {
      "id": "6850",
      "title": "Shakawalla",
      "metadata": {
        "categories": [
          "Canon articles",
          "Songs"
        ],
        "content": "# Shakawalla - Behind the scenes[]\n\n\"Shakawalla\" was created for the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. It can be heard playing during the land's background radio loop.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Shakawalla",
        "title": "Shakawalla",
        "tokens": 59.0
      }
    },
    {
      "id": "7045",
      "title": "Bight Size",
      "metadata": {
        "categories": [
          "Canon articles",
          "Songs"
        ],
        "content": "# Bight Size - Behind the scenes[]\n\n\"Bight Size\" was created for the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. It can be heard playing during the land's background radio loop.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Bight_Size",
        "title": "Bight Size",
        "tokens": 57.0
      }
    },
    {
      "id": "7056",
      "title": "The Legends of Luke Skywalker (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2017 releases",
          "Canon middle-grade audiobooks",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker (audiobook) - Editions[]\n\nISBN 9780525529088; October 31, 2017; Random House Audio; Digital audiobook\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker_%28audiobook%29",
        "title": "The Legends of Luke Skywalker (audiobook)",
        "tokens": 39.0
      }
    },
    {
      "id": "7054",
      "title": "The Legends of Luke Skywalker (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2017 releases",
          "Canon middle-grade audiobooks",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker (audiobook) - Publisher's summary[]\n\nA collection of myths and tall-tales about the legendary Jedi Luke Skywalker, written by Nebula, Hugo, and World Fantasy award-winning author Ken Liu.\n\nAs a cargo ship rockets across the galaxy to Canto Bight, the deckhands on board trade stories about legendary Jedi Knight Luke Skywalker. But are the stories of iconic and mysterious Luke Skywalker true, or merely tall tales passed from one corner of the galaxy to another? Is Skywalker really a famous Jedi hero, an elaborate charlatan, or even part droid? The deckhands will have to decide for themselves when they hear The Legends of Luke Skywalker.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker_%28audiobook%29",
        "title": "The Legends of Luke Skywalker (audiobook)",
        "tokens": 139.0
      }
    },
    {
      "id": "7073",
      "title": "Sentient 7 and the Clankers",
      "metadata": {
        "categories": [
          "Canon articles",
          "Bands"
        ],
        "content": "# Sentient 7 and the Clankers - Behind the scenes[]\n\nSentient 7 and the Clankers was created for the theme park land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. Its music is featured at the Oga's Cantina bar and on the BSO 401.72 radio station, which is played as background audio in the land.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Sentient_7_and_the_Clankers",
        "title": "Sentient 7 and the Clankers",
        "tokens": 90.0
      }
    },
    {
      "id": "7080",
      "title": "Til the Spire",
      "metadata": {
        "categories": [
          "Canon articles",
          "Songs"
        ],
        "content": "# Til the Spire - Behind the scenes[]\n\n\"Til the Spire\" was created for the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. It can be heard playing during the land's background radio loop.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Til_the_Spire",
        "title": "Til the Spire",
        "tokens": 60.0
      }
    },
    {
      "id": "7052",
      "title": "The Legends of Luke Skywalker (audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "2017 releases",
          "Canon middle-grade audiobooks",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker (audiobook)\n\nThe Legends of Luke Skywalker\n\nAttribution information\n\nAuthor(s)\nKen Liu\n\n\nNarrator(s)\nJanuary LaVoy\n\n\nCover artist(s)\nJ. G. Jones\n\n\n\nPublication information\n\nPublisher\nRandom House Audio\n\n\nRelease date\nOctober 31, 2017\n\n\nMedia type\nDigital audiobook\n\n\nRun time\n6 hours 42 minutes(402 minutes)\n\n\nISBN\n9780525529088\n\n\n\nChronology\n\nTimeline\nBetween 30 ABY and 34 ABY (frame stories)Between 28 ABY and 34 ABY (The Myth Buster)5 ABY (The Starship Graveyard)Between 3 ABY and 24 ABY (Fishing in the Deluge)Between 0 ABY and 3 ABY (I, Droid)4 ABY (The Tale of Lugubrious Mote)Between 9 ABY and 24 ABY (Big Inside)\n\n\nSeries\nJourney to Star Wars: The Last Jedi\n\n\n[Source]\n\nThe Legends of Luke Skywalker is the unabridged audio version of the canon novel of the same name, written by Ken Liu. The audiobook was performed by January LaVoy and was released by Random House Audio on October 31, 2017.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker_%28audiobook%29",
        "title": "The Legends of Luke Skywalker (audiobook)",
        "tokens": 263.0
      }
    },
    {
      "id": "7151",
      "title": "The Legends of Luke Skywalker",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2017 releases",
          "2 more",
          "Canon middle-grade novels",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker\n\nThe Legends of Luke Skywalker\n\nAttribution information\n\nAuthor(s)\nKen Liu\n\n\nCover artist\nJ. G. Jones (Cover illustration)Leigh Zieske (Design)\n\n\nIllustrator\nJ. G. Jones\n\n\n\nPublication information\n\nPublisher\nDisney–Lucasfilm Press\n\n\nEarly release date\nOctober 5, 2017 (NYCC)\n\n\nRelease date\nOctober 31, 2017\n\n\nMedia type\nHardcovereBookAudiobookPaperback\n\n\nPages\n425\n\n\nISBN\n9781484780770\n\n\n\nChronology\n\nTimeline\nBetween 30 ABY and 34 ABY (frame stories)Between 28 ABY and 34 ABY (The Myth Buster)5 ABY (The Starship Graveyard)Between 3 ABY and 19 ABY (Fishing in the Deluge)Between 0 ABY and 3 ABY (I, Droid)4 ABY (The Tale of Lugubrious Mote)Between 9 ABY and 19 ABY (Big Inside)\n\n\nSeries\nJourney to Star Wars: The Last Jedi\n\n\n[Source]\n\nThe Legends of Luke Skywalker is a canon young-readers novel of myths and tall tales about the legendary Jedi Knight Luke Skywalker. It was written by Ken Liu and was released by Disney–Lucasfilm Press on October 31, 2017, as part of the Journey to Star Wars: The Last Jedi publishing program.\n\nThe frame story of the novel follows children on their way to the casino world of Canto Bight. The children tell each other six stories about Skywalker, debating whether or not he was a myth. The stories include a firsthand account, told secondhand, of a mole-flea named Lugubrious Mote, who claimed to have been with Skywalker during the rescue of Han Solo.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker",
        "title": "The Legends of Luke Skywalker",
        "tokens": 377.0
      }
    },
    {
      "id": "7159",
      "title": "The Legends of Luke Skywalker",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2017 releases",
          "2 more",
          "Canon middle-grade novels",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker - Legacy[]\n\nAt New York Comic Con 2019 it was announced that Viz Media would publish a manga adaptation of the novel in 2020. The manga adapted four of the six stories: \"The Starship Graveyard,\" \"I, Droid,\" \"The Tale of Lugubrious Mote,\" and \"Big Inside.\" \"The Myth Buster\" and \"Fishing in the Deluge\" short stories were not included in the adaption.\n\n",
        "section": "Legacy[]",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker",
        "title": "The Legends of Luke Skywalker",
        "tokens": 99.0
      }
    },
    {
      "id": "7162",
      "title": "The Legends of Luke Skywalker",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2017 releases",
          "2 more",
          "Canon middle-grade novels",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker - Editions[]\n\nISBN 9781484780770; October 31, 2017; Disney–Lucasfilm Press; US hardcover\nISBN 9781760501280; December 1, 2017; Hardie Grant Publishing; Australian paperback\nISBN 9781405289122; April 5, 2018; Egmont UK Ltd; UK paperback\nISBN 9787545533804; January, 2018; Tiandi Press (天地出版社); China (Mainland) paperback\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker",
        "title": "The Legends of Luke Skywalker",
        "tokens": 117.0
      }
    },
    {
      "id": "7155",
      "title": "The Legends of Luke Skywalker",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2017 releases",
          "2 more",
          "Canon middle-grade novels",
          "Journey to Star Wars: The Last Jedi"
        ],
        "content": "# The Legends of Luke Skywalker - Publisher's summary[]\n\nAs a cargo ship rockets across the galaxy to Canto Bight, the deckhands on board trade stories about legendary Jedi Knight Luke Skywalker. But are the stories of iconic and mysterious Luke Skywalker true, or merely tall tales passed from one corner of the galaxy to another? Is Skywalker really a famous Jedi hero, an elaborate charlatan, or even part droid? The deckhands will have to decide for themselves when they hear The Legends of Luke Skywalker.\n\nA collection of myths and tall-tales about the legendary Jedi Luke Skywalker, written by Nebula, Hugo, and World Fantasy award-winning author Ken Liu.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/The_Legends_of_Luke_Skywalker",
        "title": "The Legends of Luke Skywalker",
        "tokens": 135.0
      }
    },
    {
      "id": "7202",
      "title": "Lightyear",
      "metadata": {
        "categories": [
          "Canon articles",
          "Songs"
        ],
        "content": "# Lightyear - Behind the scenes[]\n\n\"Lightyear\" was created for the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios in 2019. It can be heard playing during the land's background radio loop.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Lightyear",
        "title": "Lightyear",
        "tokens": 56.0
      }
    },
    {
      "id": "7758",
      "title": "Star Wars: Shadows of the Empire (abridged audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "1996 releases",
          "Book stubs",
          "2 more",
          "Incomplete Appearances",
          "Legends audiobooks"
        ],
        "content": "# Star Wars: Shadows of the Empire (abridged audiobook) - Publisher's summary[]\n\nIt is a time of crisis. Han Solo, frozen in carbonite, is being taken to the vile gangster Jabba the Hutt. As Princess Leia mounts a rescue mission and Darth Vader scours the galaxy for Luke Skywalker, another sinister figure emerges. Cunning and ruthless, leader of a powerful crime syndicate, he will pit himself against Vader for the favor of their mutual master… the dreaded Emperor.\n\nSHADOWS OF THE EMPIRE\n\nHis name is Xizor, Underlord of a galaxywide criminal organization, and he seeks to displace Darth Vader as the Emperor's right hand. To do so, he will hatch a brilliantly evil plan to discredit Vader in the Emperor's eyes. In the meantime, he will join the Dark Lord in an unholy alliance whose common target is Luke.\n\nThough he is cold and reptilian, Xizor has a certain predatory charisma that not even Leia can totally resist. Against the judgment of Chewbacca, who has promised the frozen Han to keep her from harm, Leia walks willingly into Xizor's lair in a dangerous play of passion and willpower to get the information she needs to defeat him.\n\nAnd as the struggle between Xizor and Vader intensifies, Luke finds himself the potential prize of the two most evil entities in the galaxy—one who wants him alive, and one who wants him dead.\n\nFeaturing original Star Wars music, the specially composed Xizor's Theme, and sound effects, this exclusive Star Wars production adds an exciting new chapter to the Star Wars saga, and introduces important new characters no Star Wars fan will want to miss!\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Shadows_of_the_Empire_%28abridged_audiobook%29",
        "title": "Star Wars: Shadows of the Empire (abridged audiobook)",
        "tokens": 347.0
      }
    },
    {
      "id": "7755",
      "title": "Star Wars: Shadows of the Empire (abridged audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "1996 releases",
          "Book stubs",
          "2 more",
          "Incomplete Appearances",
          "Legends audiobooks"
        ],
        "content": "# Star Wars: Shadows of the Empire (abridged audiobook)\n\nStar Wars: Shadows of the Empire\n\nAttribution information\n\nAuthor(s)\nSteve PerryTrebbe Johnson (Abridgement)\n\n\nNarrator(s)\nAnthony Heald\n\n\nProducer(s)\nDavid Rapkin\n\n\nDirector(s)\nLars Hoel\n\n\nCover artist(s)\nDrew Struzan\n\n\n\nPublication information\n\nPublisher\nBantam Doubleday Dell Audio PublishingRandom House Audio\n\n\nRelease date\nApril 1996(Cassette tape)\n\n\nRerelease date(s)\nFebruary 9, 2007(Digital download)\n\n\nMedia type\nCassette tapeDigital download\n\n\nRun time\n3 hours 3 minutes(183 minutes)\n\n\nCassettes\n2\n\n\nISBN\n9780553754803\n\n\n\nChronology\n\nTimeline\n3–4 ABY\n\n\nSeries\nStar Wars: Shadows of the Empire\n\n\n[Source]\n\n\nThe Star Wars: Shadows of the Empire audiobook is an abridged audio reading of the Shadows of the Empire novel originally published by author Steve Perry, performed by actor Anthony Heald. The audiobook was originally published by Bantam Doubleday Dell Audio Publishing in 1996 as part of the larger Star Wars: Shadows of the Empire multimedia project.\n\nThe Shadows of the Empire audiobook features Xizor's Theme from the Shadows of the Empire soundtrack, originally composed by Joel McNeely, and original sound effects, some of which were reproduced from the three Star Wars films of the Original trilogy.\n\nOriginally released on two audio cassettes, the audiobook's running time is 183 minutes.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Shadows_of_the_Empire_%28abridged_audiobook%29",
        "title": "Star Wars: Shadows of the Empire (abridged audiobook)",
        "tokens": 321.0
      }
    },
    {
      "id": "7759",
      "title": "Star Wars: Shadows of the Empire (abridged audiobook)",
      "metadata": {
        "categories": [
          "Real-world media",
          "1996 releases",
          "Book stubs",
          "2 more",
          "Incomplete Appearances",
          "Legends audiobooks"
        ],
        "content": "# Star Wars: Shadows of the Empire (abridged audiobook) - Editions[]\n\nISBN 9780553474381; April 1, 1996, Bantam Doubleday Dell Audio Publishing, Cassette tape\nISBN 9780553754803; February 9, 2007, Random House Audio, Digital download\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Shadows_of_the_Empire_%28abridged_audiobook%29",
        "title": "Star Wars: Shadows of the Empire (abridged audiobook)",
        "tokens": 72.0
      }
    },
    {
      "id": "8167",
      "title": "Jedi Apprentice: The Rising Force",
      "metadata": {
        "categories": [
          "Real-world media",
          "1999 releases",
          "Incomplete Appearances",
          "Star Wars: Jedi Apprentice"
        ],
        "content": "# Jedi Apprentice: The Rising Force - Publisher's summary[]\n\nPeace over anger.Honor over hate.Strength over fear.\n\nTwelve-year-old Obi-Wan Kenobi desperately wants to be a Jedi Knight. After years at the Jedi Temple, he knows the power of the lightsaber and the Force. But he cannot control his own anger and fear. Because of this, the Jedi Master Qui-Gon Jinn will not take him on as a Padawan apprentice.\n\nNow Obi-Wan is about to have his first encounter with true evil. He must face off against unexpected enemies—and face up to his own dark wishes.\n\nOnly then can his education as a Jedi truly begin.\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/Jedi_Apprentice:_The_Rising_Force",
        "title": "Jedi Apprentice: The Rising Force",
        "tokens": 138.0
      }
    },
    {
      "id": "8125",
      "title": "A New Hope: The Princess, the Scoundrel, and the Farm Boy",
      "metadata": {
        "categories": [
          "Real-world media",
          "2015 releases",
          "Canon middle-grade novels",
          "Junior film novelizations"
        ],
        "content": "# A New Hope: The Princess, the Scoundrel, and the Farm Boy - Publisher's summary[]\n\n\"The galaxy is at war.\n\nAlthough the Rebel Alliance has won a few battles against the Empire, hope is fading. The Empire is about to finish building the greatest weapon the galaxy has ever seen—the Death Star. The rebels' only chance to defeat it now lies in the unlikely hands of a princess, a scoundrel, and a farm boy. . . .\n\nAcclaimed, New York Times bestselling author Alexandra Bracken delivers a captivating retelling of Star Wars: A New Hope like you've never experienced before. Since the premier of the original film, Princess Leia, Han Solo, and Luke Skywalker have become iconic, larger-than-life characters. The Princess, the Scoundrel, and the Farm Boy takes a deeper look at these three heroes as they join forces to defeat the evil that threatens their entire galaxy.\"\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/A_New_Hope:_The_Princess%2C_the_Scoundrel%2C_and_the_Farm_Boy",
        "title": "A New Hope: The Princess, the Scoundrel, and the Farm Boy",
        "tokens": 187.0
      }
    },
    {
      "id": "8131",
      "title": "A New Hope: The Princess, the Scoundrel, and the Farm Boy",
      "metadata": {
        "categories": [
          "Real-world media",
          "2015 releases",
          "Canon middle-grade novels",
          "Junior film novelizations"
        ],
        "content": "# A New Hope: The Princess, the Scoundrel, and the Farm Boy - Editions[]\n\nISBN 9781484709122; September 22, 2015; Disney–Lucasfilm Press; US hardcover\nISBN 9781368027519; March 19, 2019; Disney–Lucasfilm Press; US paperback\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/A_New_Hope:_The_Princess%2C_the_Scoundrel%2C_and_the_Farm_Boy",
        "title": "A New Hope: The Princess, the Scoundrel, and the Farm Boy",
        "tokens": 75.0
      }
    },
    {
      "id": "8164",
      "title": "Jedi Apprentice: The Rising Force",
      "metadata": {
        "categories": [
          "Real-world media",
          "1999 releases",
          "Incomplete Appearances",
          "Star Wars: Jedi Apprentice"
        ],
        "content": "# Jedi Apprentice: The Rising Force\n\nJedi Apprentice: The Rising Force\n\nAttribution information\n\nAuthor(s)\nDave Wolverton\n\n\nCover artist\nCliff Nielsen\n\n\n\nPublication information\n\nPublisher\nScholastic Inc.\n\n\nRelease date\nMay 3, 1999\n\n\nMedia type\nPaperback\n\n\nPages\n176\n\n\nISBN\n9780590519229\n\n\n\nChronology\n\nTimeline\n44 BBY\n\n\nSeries\nStar Wars: Jedi Apprentice\n\n\nFollowed by\nJedi Apprentice: The Dark Rival\n\n\n[Source]\n\nJedi Apprentice: The Rising Force is a Star Wars Legends junior novel written by Dave Wolverton. The book was published by Scholastic Inc. on May 3, 1999, and it is the first installment of the Star Wars: Jedi Apprentice book series. Jedi Apprentice: The Rising Force is set in the year 44 BBY, and it follows Obi-Wan Kenobi under the tutelage of Qui-Gon Jinn.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Jedi_Apprentice:_The_Rising_Force",
        "title": "Jedi Apprentice: The Rising Force",
        "tokens": 197.0
      }
    },
    {
      "id": "8176",
      "title": "Jedi Apprentice: The Rising Force",
      "metadata": {
        "categories": [
          "Real-world media",
          "1999 releases",
          "Incomplete Appearances",
          "Star Wars: Jedi Apprentice"
        ],
        "content": "# Jedi Apprentice: The Rising Force - Editions[]\n\nISBN 9780590519229; May 3, 1999; Scholastic Inc.; US paperback\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Jedi_Apprentice:_The_Rising_Force",
        "title": "Jedi Apprentice: The Rising Force",
        "tokens": 36.0
      }
    },
    {
      "id": "8785",
      "title": "Star Wars: Absolutely Everything You Need to Know",
      "metadata": {
        "categories": [
          "Real-world media",
          "2015 releases",
          "Incomplete Appearances",
          "Star Wars: Absolutely Everything You Need to Know"
        ],
        "content": "# Star Wars: Absolutely Everything You Need to Know - Publisher summary[]\n\nStar Wars®: Absolutely Everything You Need to Know explores the world of Star Wars through lively lists, interesting facts, and questions and answers via a highly engaging infographic design. Whether it's a chart of who is the oldest Jedi, a list of all the owners of the Millennium Falcon, or a diagram showing all the Jedi Yoda has trained, this guide will excite readers of all ages and provide facts they never knew about the Star Wars Galaxy.\n\n",
        "section": "Publisher summary[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
        "title": "Star Wars: Absolutely Everything You Need to Know",
        "tokens": 105.0
      }
    },
    {
      "id": "8790",
      "title": "Star Wars: Absolutely Everything You Need to Know",
      "metadata": {
        "categories": [
          "Real-world media",
          "2015 releases",
          "Incomplete Appearances",
          "Star Wars: Absolutely Everything You Need to Know"
        ],
        "content": "# Star Wars: Absolutely Everything You Need to Know - Editions[]\n\nISBN 9781465437853; September 4, 2015; DK Publishing; US hardcover\nISBN 9780241183700; September 4, 2015; DK Publishing, UK hardcover\nISBN 9780241255339; 2015; Dorling Kindersley Limited; UK paperback\nISBN 9781465457059; 2016; DK Publishing; US hardcover\n\n",
        "section": "Editions[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
        "title": "Star Wars: Absolutely Everything You Need to Know",
        "tokens": 102.0
      }
    },
    {
      "id": "8784",
      "title": "Star Wars: Absolutely Everything You Need to Know",
      "metadata": {
        "categories": [
          "Real-world media",
          "2015 releases",
          "Incomplete Appearances",
          "Star Wars: Absolutely Everything You Need to Know"
        ],
        "content": "# Star Wars: Absolutely Everything You Need to Know\n\nStar Wars: Absolutely EverythingYou Need to Know\n\nAttribution information\n\nAuthor(s)\nAdam BrayKerrie DoughertyCole HortonMichael Kogge\n\n\n\nPublication information\n\nPublisher\nDK Publishing\n\n\nPublication date\nSeptember 4, 2015\n\n\nType\nHardcoverPaperback\n\n\nPages\n200\n\n\nISBN\n9781465437853\n\n\nSeries\nJourney to Star Wars: The Force Awakens\n\n\n[Source]\n\nStar Wars: Absolutely Everything You Need to Know is a Dorling Kindersley reference title and part of the Journey to Star Wars: The Force Awakens initiative. The 200-page title was published on September 4, 2015 and provides facts about the Star Wars universe such as the oldest Jedi and a list of all owners of the Millennium Falcon.\n\nWhile the title was written in part by one of the same writers as Ultimate Star Wars, Adam Bray, the two projects are described as being \"very different.\" Readers will find \"very little common information between the two\" as \"Absolutely Everything highlights anecdotal, quirky and obscure facts.\" On October 3, 2017, the title was followed by Star Wars: Absolutely Everything You Need to Know, Updated and Expanded.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
        "title": "Star Wars: Absolutely Everything You Need to Know",
        "tokens": 253.0
      }
    },
    {
      "id": "8872",
      "title": "Databank (website)",
      "metadata": {
        "categories": [
          "Real-world articles",
          "Website stubs",
          "Incomplete Appearances",
          "3 more",
          "Canon media",
          "Online reference databases",
          "StarWars.com"
        ],
        "content": "# Databank (website)\n\nThe Databank is the official StarWars.com canonical encyclopedia. It was launched on July 1, 2014, following a design overhaul of the StarWars.com site. The Databank replaced the StarWars.com Encyclopedia, which in turn replaced a previous encyclopedia also called the Databank.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Databank_(website)",
        "title": "Databank (website)",
        "tokens": 68.0
      }
    },
    {
      "id": "8901",
      "title": "BattleSun Odyssey",
      "metadata": {
        "categories": [
          "Legends articles",
          "Entertainment"
        ],
        "content": "# BattleSun Odyssey\n\nBattleSun Odyssey\n\n\nPublication information\n\nRelease date\n41 BBY\n\n\nType\nEpisodic\n\n\n[Source]\n\nBattleSun Odyssey was an episodic work that was being released in 41 ABY.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/BattleSun_Odyssey",
        "title": "BattleSun Odyssey",
        "tokens": 46.0
      }
    },
    {
      "id": "9199",
      "title": "Black Spire Day",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Black Spire Day - Behind the scenes[]\n\nBlack Spire Day was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It is the in-universe name for celebrations held at Disney parks on \"Star Wars Day\" (May the Fourth).\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Day",
        "title": "Black Spire Day",
        "tokens": 65.0
      }
    },
    {
      "id": "9179",
      "title": "Black Spire Day",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Black Spire Day - Behind the scenes[]\n\nBlack Spire Day was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It is the in-universe name for celebrations held at Disney parks on \"Star Wars Day\" (May the Fourth).\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Day",
        "title": "Black Spire Day",
        "tokens": 65.0
      }
    },
    {
      "id": "9480",
      "title": "Black Spire Day",
      "metadata": {
        "categories": [
          "Canon articles",
          "Holidays"
        ],
        "content": "# Black Spire Day - Behind the scenes[]\n\nBlack Spire Day was created for Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park on May 31, 2019. It is the in-universe name for celebrations held at Disney parks on \"Star Wars Day\" (May the Fourth).\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Day",
        "title": "Black Spire Day",
        "tokens": 65.0
      }
    },
    {
      "id": "9991",
      "title": "Black Spire Ruins",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Ruins - Behind the scenes[]\n\nThe Black Spire Ruins on Batuu were revealed in concept art and as part of the Star Wars: Galaxy's Edge model revealed by Disney during the theme park area's development and construction, with Doug Chiang giving some details about it in his interview. This area was believed to be the location of the entrance for Star Wars: Rise of the Resistance and later promotional material confirmed it. It was also present on a trading card titled \"NEW RECRUITS RENDEZVOUS AT THE ANCIENT RUINS\" issued at the Galactic Nights event on December 16, 2017 that gave details about the ride and revealed that the location acted as a staging area for the Resistance, including BB-8.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Ruins",
        "title": "Black Spire Ruins",
        "tokens": 157.0
      }
    },
    {
      "id": "9960",
      "title": "Black Spire Ruins",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Batuu locations"
        ],
        "content": "# Black Spire Ruins - Behind the scenes[]\n\nThe Black Spire Ruins on Batuu were revealed in concept art and as part of the Star Wars: Galaxy's Edge model revealed by Disney during the theme park area's development and construction, with Doug Chiang giving some details about it in his interview. This area was believed to be the location of the entrance for Star Wars: Rise of the Resistance and later promotional material confirmed it. It was also present on a trading card titled \"NEW RECRUITS RENDEZVOUS AT THE ANCIENT RUINS\" issued at the Galactic Nights event on December 16, 2017 that gave details about the ride and revealed that the location acted as a staging area for the Resistance, including BB-8.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Black_Spire_Ruins",
        "title": "Black Spire Ruins",
        "tokens": 157.0
      }
    }
  ]
}