{
  "cluster_id": 35,
  "size": 60,
  "vectors": [
    {
      "id": "1230",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nThe realization that the mission was to steal the disruptors led to some debate amongst the crew, a debate that R2-D2 recorded. Orrelios did not want to sell the disruptors to Vizago, instead wanting to destroy them so they could never be used again. Wren was thankful that, at the very least, they were out of Imperial hands, as she had learned through her translating that the Empire intended to mass produce them on Lothal. Jarrus was satisfied that the Empire could not have the weapons, but was insistent that they still sell the weapons to Vizago for the credits the crew needed. Wren also suggested selling C-3PO and R2-D2 to Vizago for extra credits.\n\nWhile the rebels were en route to Lothal, Minister Tua contacted Agent Kallus of the Imperial Security Bureau, who had taken an interest in the rebels during their rescue mission on Kessel. Tua informed the ISB Agent of the weapons theft and described the crew, including how one crew member was a Lasat, prompting Kallus to realize it was the rebels he had been tracking.",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 247.0
      }
    },
    {
      "id": "1222",
      "title": "T-7 ion disruptor rifle",
      "metadata": {
        "categories": [
          "Canon articles",
          "Disruptor rifles"
        ],
        "content": "# T-7 ion disruptor rifle - History[]\n\nAt some point, while fighting on cold terrain, a cold weather assault stormtrooper was armed with a T-7. During the Siege of Lasan, the Empire used disruptors against the Lasat, the sentient species native to the planet. Most of the Lasat were killed during the fall, and the gruesome effects that the rifles had on organic lifeforms led the Imperial Senate to ban their use. T-7s were rather rare, and many of the rifles were either recalled or destroyed; copies of the schematics escaped deletion, however, and private weapons manufacturers produced batches that could be found on the black market—for a price.\n\nSome T-7 disruptors were manufactured and owned by weapons manufacturer Amda Wabo. Minister Maketh Tua of Lothal met with Wabo to discuss an illegal arms deal, with assistance from the droids C-3PO and R2-D2, who had been dispatched by Lothal's governor, Arihnda Pryce—and, secretly, Senator Bail Organa of Alderaan, who wanted the weapons destroyed. In truth, Wabo's weapons were prototypes that the Imperial Military wanted to mass produce on Lothal, ignoring the Senate ban. The arms deal was intercepted and disrupted on Garel by the rebel crew of the Ghost, who intended to sell the weapons to Lothal arms dealer Cikatro Vizago. Agent Kallus of the Imperial Security Bureau found the rebels and attempted to both destroy the rebels and retrieve the weapons, but he failed and the rebels were able to destroy the disruptor rifles and escape. C-3PO and R2-D2 were then returned to Senator Bail Organa. During the skirmish, Kallus also claimed he had ordered the use of ion disruptors on Lasan but later admitted this was not the case.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/T-7_ion_disruptor_rifle",
        "title": "T-7 ion disruptor rifle",
        "tokens": 381.0
      }
    },
    {
      "id": "1225",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons\n\nPrevious\nMission to free Wookiee prisoners\n\n\nNext\nAttack on Imperial Troop Transports\n\n\n\n\n\n\nMission to steal Imperial weapons\n\n\n\nConflict\nEarly rebellion against the Galactic Empire\n\n\nObjective\nSteal T-7 ion disruptor rifles from the Galactic Empire and sell them to Cikatro Vizago\n\n\nDate\n5 BBY\n\n\nPlace\nGarel City Spaceport, Garel City, GarelVizago's camp, Lothal\n\n\nOutcome\nRebel victory:The disruptors are destroyedR2-D2 and C-3PO are returned to Senator Bail Organa of AlderaanOrgana learns about the Lothal rebels\n\n\n\n\nFactions\n\n\nLothal rebels\nGalactic Empire\n\n\n\n\n\n\n\nCommanders\n\n\nKanan Jarrus\nMinister Maketh TuaAgent Kallus\nSenator Bail Organa\n\n\n\n\n\n\nParticipants\n\n\nEzra BridgerC1-10PGarazeb OrreliosHera SyndullaSabine Wren1 VCX-100 light freighterGhost\nAmda WaboMultiple stormtroopers1 Gozanti-class Assault Carrier2 AT-DPs†\nC-3POR2-D21 CR90 corvetteTantive IV\n\n\n\n\n\n\nCasualties\n\n\nNone\nMultiple stormtroopers2 AT-DPs\nNone\n\n\n\n\n[Source]\n\nThe mission to steal Imperial weapons was an operation undertaken in 5 BBY by the rebel crew of the Ghost to steal and, ultimately, destroy illegal T-7 ion disruptor rifles from the Galactic Empire. It was a formative operation in the early days of the Alliance to Restore the Republic.\n\nThe mission began as a means of securing credits needed to replenish their ship's supplies and continue their operations against the Empire; the crime lord Cikatro Vizago, who operated on the Outer Rim planet Lothal, was willing to pay for the weapons. The mission took the rebels to the planet Garel, which they traveled to aboard a star commuter shuttle. Aboard that shuttle was Minister Maketh Tua, who was attempting to procure the weapons from their manufacturer, Amda Wabo, with the help of two droids—R2-D2 and C-3PO, who were secretly working for Senator Bail Organa of Alderaan to destroy the weapons. The rebels were able to learn the location of the weapons in the Garel City Spaceport, and stole them before the Empire could obtain them. After a brief firefight on Garel, the rebels escaped back to Lothal.\n\nOnce on Lothal, the rebels attempted to sell the weapons to Vizago, but were quickly discovered by Agent Kallus of the Imperial Security Bureau. This led to a brief battle against Imperial forces, in which the rebels destroyed the disruptors so they could not fall into Imperial hands. The rebels escaped Agent Kallus' forces and returned the droids to Senator Organa, who was able to learn about the rebels from R2-D2. In the aftermath of the mission, the rebels became part of the fledging Rebel Alliance that Organa helped lead, though only the pilot of the Ghost, Hera Syndulla, knew of their involvement at first. They later learned of their involvement, as well as Organa's, after other rebel cells came to their assistance during mission to rescue the crew's field leader, Kanan Jarrus, from the Empire.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 686.0
      }
    },
    {
      "id": "1235",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Behind the scenes[]\n\nThe rebels' mission to steal the T-7 ion disruptor rifles was the central plot of \"Droids in Distress,\" the first regular series episode of the animated television series Star Wars Rebels. The event was first referenced in Star Wars Rebels: The Visual Guide, a reference book that introduced the characters and settings of the show, and was described as an arms deal in which C-3PO and R2-D2 encountered the rebels and went on \"an unexpected adventure.\" The Visual Guide also introduced the fact that the droids were on loan to Governor Pryce by Senator Organa, thereby setting up the backstory of the episode.\n\nHighlighting how the Imperial regime would sometimes avoid the authority of the Imperial Senate, StarWars.com drew a comparison between the illicit Imperial arms deal in \"Droids in Distress\" and the capture of Princess Leia Organa in Star Wars: Episode IV A New Hope. In the episode, the Empire arranges for the arms deal in secret so as to avoid the attention of the Imperial Senate, whereas A New Hope implies that the Imperial Senate would not approve of the fact that Darth Vader and the Empire boarded the Tantive IV and took Princess Leia captive.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 252.0
      }
    },
    {
      "id": "1229",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nUpon arrival at the Capital City starport, the rebels boarded a Star Commuter 2000 transport shuttle bound for Garel, which was only a few minutes away from Lothal via hyperspace. In order to avoid suspicion, as well as enact a plan to locate the weapons, the rebels boarded the shuttle pretending to not know one another; Bridger and the rebels' astromech droid, C1-10P—also known as Chopper—sat together, while Orrelios and Wren sat across from them. Tua and Wabo soon arrived and were seated in front, just ahead of Orrelios and Wren. R2-D2 and C-3PO arrived shortly thereafter, followed by Jarrus, who arrived at the shuttle at the last minute while pretending to be running late. Once all were aboard, the shuttle departed from Lothal and made the jump towards Garel.\n\nWhile en route to Garel, Chopper made a scene by pretending to start a fight with Bridger, so as to draw attention towards them. Jarrus, still acting as a stranger, demanded that the pilot droid, RX-24, enforce the Imperial regulations regarding droids in the passenger area. With Chopper sent to the back of the shuttle, Bridger demanded that C-3PO and R2-D2 also be sent to the back. Despite Tua's objections, as she needed them for her mission, RX-24 sent the two Imperial droids to the back of the shuttle. With Tua unable to understand Wabo, Wren offered her services as a translator, posing as a loyal student from the Imperial Academy. In Aqualish, Wren asked Wabo where the shipment of T-7 disruptors was being held on Garel. Wabo told her they were in Bay 7, but Wren misled Tua and told the Minister that they were in Bay 17, a lie that would give the rebels time to steal the weapons before the Empire could get to them.\n\nThe ship arrived in the Garel City Spaceport moments later, and the rebels and Imperials disembarked. While the Empire headed for the wrong cargo bay, the rebels began the next phase of their plan. Bridger was tasked with crawling through a ventilation system and reaching Bay 7, where he would unlock the door for the rest of the crew. Bridger, who had been a thief while living alone on Lothal, resented having to resort to stealing and infiltration again, as he had joined the crew of the Ghost so Jarrus could train him as a Jedi—training that had yet to begin. He made his way to a rooftop and across a number of others before arriving at the cargo bay, where he found the cache of weapons and opened the door for the others. Once Jarrus, Wren, and Orrelios arrived, Syndulla—who made her way to Garel aboard the Ghost—landed the ship.\n\nAs the Ghost landed, the rebels inspected the weapons and realized that they were T-7 disruptors. Orrelios was horrified at the discovery, as he had seen them used against his people. Despite Orrelios' reluctance, Jarrus ordered that the weapons be loaded onto the Ghost. Meanwhile, the Imperials arrived in Bay 17 and found that there were no weapons. Wabo stated that they were in Bay 7, which C-3PO translated for the Minister. Tua ordered her stormtroopers to head for the correct cargo bay, where the rebels were still loading the weapons. Chopper, who was spying on the Imperials, was discovered, prompting Tua to realize that she had been tricked by Wren and the rebels.\n\nThe Imperials arrived in Bay 7 just as the cargo crates were being loaded. The stormtroopers demanded that the rebels surrender, but, while Orrelios distracted the Imperials, the weapons continued to be loaded onto the Ghost. As the stormtroopers attempted to inspect the crates, which Orrelios claimed were his, the Lasat attacked the soldiers, leading to a firefight between the Imperials and the rebels. During the firefight, R2-D2 realized that the thieves were rebels and led C-3PO aboard the Ghost, which took off and departed Garel once the remaining weapons were loaded. Jarrus ordered restraining bolts to be placed on the droids, not realizing what their true mission was.",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 925.0
      }
    },
    {
      "id": "1228",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Prelude[]\n\nIn 5 BBY, the rebel crew of the freighter Ghost carried out a number of operations against the Galactic Empire on the Outer Rim planet Lothal. Shortly after their successful mission to rescue Wookiee slaves from the spice mines of Kessel, the crew ran low on supplies, including food, explosives, and fuel. They attempted to steal a shipment of supplies from the Empire, but ended up in battle with an Imperial-class Star Destroyer and a squadron of TIE/ln space superiority starfighters. The Ghost was able to escape from the Imperial forces, but without the supplies the crew was hoping to obtain. They knew that if they did not obtain supplies or money, they would not be able to continue fighting against the Galactic Empire or even maintain the operations of the Ghost. Kanan Jarrus, the field leader of the rebel crew, suggested that they take a job from Lothal crime lord Cikatro Vizago. The idea was met with resistance by the Lasat crew member Garazeb Orrelios, who objected to taking a job as arms dealers for the Devaronian criminal, but Padawan Ezra Bridger agreed with Jarrus, his Jedi teacher. The rebel leader said he already knew the mission, which was to intercept an Imperial arms deal on the planet Garel. After some further discussion, the crew headed to Capital City on Lothal to begin their mission.\n\nMeanwhile, the Empire prepared for their arms deal, where Minister Maketh Tua of Lothal would meet with weapons manufacturer Amda Wabo to obtain Wabo's T-7 ion disruptor rifles on Garel; the disruptors, which could be used to gruesome effect on sentient beings, had previously been banned by the Imperial Senate after their use in the near-extinction of the Lasat species. In order for Tua to understand Wabo, an Aqualish, she would be assisted by two droids, the astromech droid R2-D2 and and the protocol droid C-3PO. The droids were loaned to Lothal's governor, Arihnda Pryce, by Senator Bail Organa of Alderaan, who secretly wanted the illegal weapons destroyed. However, only R2-D2 was aware of their true motives; the chatty C-3PO was kept in the dark.\n\n",
        "section": "Prelude[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 485.0
      }
    },
    {
      "id": "1231",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Battle on Lothal[]\n\nAfter Jarrus confirmed the crew's rendezvous with Vizago, the Ghost landed in the crime lord's encampment on Lothal. Before the crew disembarked, R2-D2 revealed that his real mission was to ensure that the disruptors did not fall into Imperial hands and that his master—whom the droid did not identify as Senator Organa—would provide a generous reward if the droids were returned to him. Jarrus said he would consider it, but nonetheless pushed ahead with his plan to sell the weapons to Vizago. While the rebels unloaded the weapons, C-3PO sent a distress call to Governor Pryce, saying that he and R2-D2 had been abducted by criminals. The signal was intercepted aboard Kallus' ship, the Lawbringer, and Kallus himself replied to the worried protocol droid. C-3PO, who believed Kallus would rescue him, sent the ISB Agent the location of the Ghost.\n\nAs Imperial forces prepared to attack the rebels, Vizago inspected the weapons that the crew had stolen for him. Before Vizago could pay the rebels, however, Kallus' forces arrived, including multiple stormtroopers and two AT-DP walkers. Vizago fled the scene with some of the disruptors, unwilling to pay for only half a shipment, and left the rebels behind to deal with the Imperial forces. Unwilling to risk the disruptors falling into Imperial hands, Jarrus ordered Wren to destroy them. R2-D2, who disembarked from the ship with C-3PO, offered his assistance in destroying the weapons, thus fulfilling Senator Organa's orders. R2-D2 suggested overloading the disruptors so they would explode, a plan that Wren agreed with. Jarrus took one of the weapons for himself in order to eliminate the AT-DPs, while the rest of the crew helped Wren.\n\nThe walkers began firing on the rebels' location, and Jarrus took one of them out. Orrelios and Bridger ran to his aid once a walker fired at him, and they watched as Kallus and his stormtroopers approached. Once Kallus saw Orrelios, he demanded that the Lasat face him in combat. The two fought using AB-75 bo-rifles, the weapon of the Lasan High Honor Guard—Kallus revealed he had stolen the weapon from a Lasat he had killed, and that Kallus himself had personally ordered the use of the disruptors on Lasan. Enraged, Orrelios continued fighting against the ISB Agent. While the two fought, the rebels overloaded the disruptors and pushed them towards the remaining walker and the stormtroopers, triggering explosions that took out both the weapons, the soldiers, and the AT-DP.\n\nThe resulting explosions triggered a small ground tremor, causing Orrelios to lose his balance. Kallus found the upper hand and nearly killed his opponent, before Bridger spontaneously used the Force to throw Kallus through the air, away from Orrelios. The rebels were able to use that as an opportunity to grab Orrelios and return to the Ghost, which took off and departed Lothal, leaving Kallus behind.\n\n",
        "section": "Battle on Lothal[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 692.0
      }
    },
    {
      "id": "1376",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - The con[]\n\nAt Lothal's main spaceport, Ezra and the astromech droid Chopper board Star Commuter 2000 shuttle ST-45, which is leaving for Garel. Aboard the shuttle, they pass by fellow rebels Sabine and Zeb, also disguised as passengers. Shortly after, the shuttle is boarded by Imperial minister Maketh Tua and Aqualish arms trader Amda Wabo, who sit in front of Zeb and Sabine. Wabo speaks to Tua in the Aqualish language, and Tua demands to know where her translator is: the protocol droid C-3PO, who boards the shuttle accompanied by the astromech droid R2-D2. C-3PO's services are necessary because Tua and Wabo cannot communicate directly. Just before the shuttle departs, they are joined by Kanan, boarding at the last minute. The various members of the Ghost crew (Zeb and Sabine, Ezra and Chopper, Kanan) are pretending not to know each other.\n\nAfter the shuttle enters hyperspace, Ezra and Chopper stage a fight, prompting Kanan to demand that the RX-24 droid pilot send Chopper to the back of the craft. In response, Ezra demands that C-3PO and R2-D2 be transferred to the back as well, referring to both droids as astromechs. C-3PO takes insult at being called an astromech, stressing that he is a protocol droid, and Tua tells the pilot that the two droids are accompanying her, and she is on Imperial business. The droid pilot informs Tua that Imperial regulations require all droids (save for himself) at the back of the craft, and 3PO begrudgingly heads to the back, followed by R2. With Tua bereft of a translator, Sabine then volunteers her services while posing as an Imperial Academy student. Sabine quickly learns that Tua's weapons shipment is located in Bay Seven of Garel City Spaceport. However, she misleads Tua into believing that it is in Bay Seventeen. C-3PO, in the back, sniffs that Sabine can't possibly take his place as translator. When R2-D2 attempts to find out what Tua and Wabo, with Sabine translating, are talking about, C-3PO tells him that it hardly matters to him what they're saying, and Chopper, believing R2 to be an Imperial droid, bumps into him to prevent him from listening. 3PO tells R2 that he could stand to learn some manners from Chopper.\n\n",
        "section": "The con[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 552.0
      }
    },
    {
      "id": "1379",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - Showdown[]\n\nUpon landing at the rendezvous point with Vizago on Lothal, the crew of the Ghost meet in the cargo hold to unload the rifles, with Hera agreeing to put off the topic of Ezra's training only for the moment. Sabine announces that R2 told her that his mission was to keep the T-7s out of Imperial hands, and that his master will pay handsomely for the two's return; Kanan agrees to consider it. Zeb is still not comfortable with selling the rifles, but as long as it's not the Empire, Kanan is fine with going ahead with the deal he already made with Vizago. Believing that the crew of the Ghost are criminals, thieves, and outlaws, C-3PO sneaks into the cockpit while the crew is busy with the cargo and sends a distress signal to Governor Pryce, but as she is away it's rerouted to Agent Kallus, who promises that \"help is on the way.\"\n\nMeanwhile, Vizago agrees to buy the T-7s and ordered his IG-RM droids to load the crates onto two speeders. Before they can complete the transaction, they spot an Imperial freighter carrying two All Terrain Defense Pod walkers on its way. Vizago and his droids quickly flee with four of the seven crates without paying the Ghost's crew, stating that he doesn't pay for partial shipments or trouble with the Empire. Kanan is left shaking with anger.\n\nKanan resolves not to let the disruptors fall into Imperial hands, and orders Sabine to destroy them. She starts heading to the ship to get explosives, but is surprised to see R2 leading the other two droids to the crates, saying he's helping the crew. He explains that they can just overload the T-7 disruptors, causing them to explode. While the others get the crates together and open them so Sabine and R2-D2 can get to work, Kanan destroys one of the advancing AT-DP walkers with a T-7 rifle but is knocked to the ground by a laser blast from the second walker. Hera then distracts the second walker by leading it on a chase around the surrounding stone circle and orders Chopper to prep the Ghost for takeoff. Shortly after, Agent Kallus and a contingent of stormtroopers disembark from the Imperial freighter and exchange fire with the crew.\n\nDuring the fighting, Agent Kallus challenges Zeb to a duel and battles the Lasat with a stolen bo-rifle he had taken from a member of the Lasan High Honor Guard he personally killed. Kallus also goads Zeb by claiming to have ordered the use of the T-7 rifles in the pacification of Lasan. Sabine and R2-D2 finish with the rifles, and the others use one crate to destroy the walker, and the other two to scatter the stormtroopers. The powerful detonation throws both Kallus and Zeb off balance, but Kallus recovers a hair faster and stuns Zeb in the chest, leaving him defenseless. Before he can finish off Zeb, Ezra instinctively Force pushes Kallus so hard he's thrown back, tumbles along the ground and slams into a rock, knocking him out. Gathering up Zeb and C-3PO and R2-D2, the crew of the Ghost flee into space. Kallus comes to in time to watch the ship depart. On board, Zeb thanks Kanan for saving his life, only to corrected that it was Ezra, and Zeb nods his thanks. Kanan also informs Ezra that his formal Jedi training will start the following day. Even so, after saying this Kanan's smile drops off to a quiet look of concern about the weight of promising to be a teacher.\n\n",
        "section": "Showdown[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 790.0
      }
    },
    {
      "id": "1377",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - The theft[]\n\nUpon landing on Garel, Minister Tua, C-3PO, R2-D2 and a contingent of stormtroopers depart for Bay Seventeen. Meanwhile, the Spectres make their way towards Bay Seven. To enter the cargo bay, Ezra climbs through a ventilation duct to the roof, using Force jumps across the distant rooftops to Bay Seven's roof. While making his way up the duct, Ezra complains to Kanan via comlink about the delay in his Jedi lessons and that stealing to survive is already something he knows. In response, Kanan replies that the crew need the credits. After entering Bay Seven, Ezra opens the bay door from inside to let in Kanan, Zeb, and Sabine, and Kanan opens the outer bay door to the opposite landing bay, where Hera lands the Ghost. Upon examining the cargo shipment, they discover that the crates contain T-7 ion disruptor rifles, weapons that had been banned by the Galactic Senate. Zeb is particularly upset by the discovery.\n\nMeanwhile, Minister Tua, C-3PO, R2-D2, and her stormtroopers discover that Bay Seventeen is empty. C-3PO deduces that Sabine probably confused the Aqualish word for seven with seventeen. Chopper, keeping an eye on the Imperials, contacts Hera and informs her that Tua and Wabo are on their way to Bay Seven. Ordered to stall them, Chopper picks a fight with R2-D2, but Minister Tua recognizes Chopper as the troublesome astromech droid from the shuttle and orders her men to hurry to Bay Seven. Before the rebels can finish loading the last of the disruptor rifles onto the Ghost, they are confronted by Tua and her stormtroopers. Following a brief gunfight, the rebels manage to flee Garel and set course back to Lothal.\n\nThe crew of the Ghost are accompanied by two stowaways, C-3PO having been led aboard by the insistent R2-D2. Kanan orders Sabine to fit them with restraining bolts. Zeb calls Kanan aside and suggests they just take the T-7s out of circulation and not sell them to Vizago; they don't notice R2 eavesdropping over from where he's standing, as he makes sure he can hear them. Returning with the bolts, Sabine notes that at least the Empire doesn't have them: she learned from her translation that the Empire was planning to use the shipment as prototypes for mass producing the ion rifles on Lothal. As they could really use the money, she also suggests offering R2 and 3PO for sale to Vizago for extra credits.\n\nNot really reassured about the rifles, the despondent Zeb kicks Ezra out of their cabin and locks the door. Hera calls Ezra to the cockpit and asks him to cut Zeb some slack. She reveals that the Empire had used T-7 rifles to violently clear the Lasat homeworld of Lasan. Zeb was one of the few Lasat who survived the genocide, and none of his people are currently on Lasan. Ezra agrees to cut Zeb some slack. When Hera learns that Kanan hasn't started training Ezra, with a frown she resolves to take up the matter with Kanan. Meanwhile, Minister Tua reports her recent encounter with the rebels on Garel to the Imperial Security Bureau Agent Kallus, who takes an interest in the Lasat Zeb. When Tua states that she didn't think there were any more Lasat left in the galaxy, Kallus responds that there are only a few.\n\n",
        "section": "The theft[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 750.0
      }
    },
    {
      "id": "1375",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - In need of a job[]\n\nThe Ghost is being chased by a squad of TIE fighters and a Star Destroyer, fresh from a failed heist. After the ship jumps to hyperspace, Kanan Jarrus and Sabine Wren argue over the former's assertion that they would get away from the failed theft with the Imperial shipment they had attempted to steal. Hera Syndulla notes that the crew is low on food and fuel, and Ezra Bridger complains that there's been no time for his promised Jedi training. Kanan knows about another job, though, from the crime lord Cikatro Vizago. Garazeb Orrelios is not happy about the Spectres being arms dealers again, but the crew agrees to take the job, so they're off to the Lothal City spaceport.\n\n",
        "section": "In need of a job[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 173.0
      }
    },
    {
      "id": "1374",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - Official description[]\n\nLow on food and fuel, the Ghost crew agrees to steal an Imperial weapons shipment for crime lord Cikatro Vizago. During the mission, they encounter a familiar droid duo -- and find that the weapons in question are more deadly than they'd realized.\n\n",
        "section": "Official description[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 64.0
      }
    },
    {
      "id": "1368",
      "title": "Star Commuter 2000",
      "metadata": {
        "categories": [
          "Canon articles",
          "Ship stubs",
          "Sacul Industries products",
          "Shuttle classes"
        ],
        "content": "# Star Commuter 2000 - History[]\n\nBetween 19 BBY and 18 BBY, information broker Ciddarin Scaleback and Clone Force 99 members \"Tech,\" \"Wrecker,\" and Omega traveled to the planet Serolonis in a Star Commuter 2000.\n\nBy 3272 LY, Lothal was linked to Garel by ST-45, which was piloted by the droid named RX-24. That year, the rebel crew of the starship Ghost booked passage for Garel aboard shuttle ST-45 as part of a scheme to gain information from Maketh Tua, an on-board Imperial minister.\n\nWhen the Spectres returned to Lothal in an attempt to extract Minister Tua, who had contacted them wishing to defect from the Empire, they flew in one of these shuttles.\n\nBy 34 ABY, some of these shuttles were still in use, as Resistance Commander Poe Dameron took newly-recruited spy Kazuda Xiono to Castilon in one. Team Colossus used one for various missions during the First Order-Resistance War.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Star_Commuter_2000",
        "title": "Star Commuter 2000",
        "tokens": 228.0
      }
    },
    {
      "id": "2206",
      "title": "Amda Wabo",
      "metadata": {
        "categories": [
          "Canon articles",
          "Aqualish",
          "Arms dealers",
          "2 more",
          "Individuals with he/him pronouns",
          "Males"
        ],
        "content": "# Amda Wabo - Biography[]\n\nThe male Aqualish Amda Wabo was originally a native of the planet Ando, but during the early years of the Galactic Empire's reign worked as a weapons designer on the planet Garel. Around fourteen years after the founding of the Empire—Lothal Year 3272—Wabo acted as a representative of Garel in negotiating a deal to sell a large supply of experimental T-7 ion disruptor rifles to the Imperials, weapons which were illegal under Imperial law. The Aqualish agreed to a one-on-one meeting with Imperial Minister Maketh Tua on the nearby planet of Lothal, where the pair conversed with the aid of the protocol droid C-3PO, who Tua had borrowed from Senator Bail Organa along with the astromech droid R2-D2, in order to act as a translator.\n\nOnce the meeting was complete, Wabo, Tua and the pair of droids boarded the Star Commuter 2000 shuttle ST-45 in Lothal's Capital City spaceport, which was traveling to Garel, where the weapons would be exchanged. The shuttle was also boarded however, by several members of the starship Ghost who had agreed to steal the disruptors from Wabo and the Imperials for Cikatro Vizago, leader of the criminal Broken Horn Syndicate. During the flight, C1-10P, an astromech member of the Ghost's crew, purposefully began a fight with another crew member, Ezra Bridger, causing all droids including C-3PO to be sent to the rear of the shuttle by the RX-Series pilot droid, RX-24. This left Wabo and Tua without a translator and therefore unable to understand each other, although Wabo kept trying to converse much to Tua's annoyance. Garazeb Orrelios, another Ghost crew member who was seated behind Wabo, then offered the services of his companion Sabine Wren as a translator, which Tua gratefully accepted. When Tua asked Wren to inquire where Wabo had stored the disruptors, the translator purposefully mistranslated the Aqualish's answer that they were in Bay 7 in Garel City Spaceport and told the Imperial minister they were in Bay 17.\n\nAfter landing on Garel, Wabo, Tua, and the droids rendezvoused with a squad of stormtroopers and, much to Wabo's confusion headed to Bay 17. Upon arrival, the group discovered the bay to be empty at which point Wabo complained and pointed out that they were in the wrong place. With C-3PO present again to translate what the Aqualish was saying, Tua realized what had happened when she recognized C1-10P observing them from nearby and ordered that the Imperials move to Bay 7 to seize the disruptors. Upon reaching Bay 7, Wabo and the Imperials discovered the Ghost's crew loading crates on to their ship, which the Stormtroopers demanded they allowed to be searched. Two members of the crew, Orrelios and Kanan Jarrus then attacked the Imperials and held them off while the rest of the disruptors were loaded. In the confusion R2-D2 and C-3PO also boarded the Ghost in an attempt to catch C1-10P, and were still on board when it took off and fled Garel.\n\nWithout a translator, Wabo came to believe that the Imperials had double crossed him, and despite Tua's unsuccessful attempts to calm him, drew his heavy blaster pistol on Tua. The crew of the Ghost successfully brought Wabo's weapons to the Broken Horn, who took most of them before Imperial's arrived to disrupt the deal. Vizago then took what weapons he had without paying the Ghost's crew, who destroyed the rest while escaping the Empire.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Amda_Wabo",
        "title": "Amda Wabo",
        "tokens": 802.0
      }
    },
    {
      "id": "2313",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Escaping slavery[]\n\nGaff orders his troops to capture the rockhoppers and bring them to the Roon Clipper, a galley with sails. Mungo, Aurem, and Threepio are chained to the lower decks where they are forced to join the other slaves in rowing the galley. Governor Koong tells his prisoners that when they reach Koong Island, Screed will be waiting for them. He tells them to tell him everything they know about the source of the Roontsones. The overseer warns the slaves that if the ship goes down, they will go down with it. Threepio's companion is Lin-D, an entertainment droid who tells jokes incessantly. Lin-D tries to be optimistic but C-3PO is pessimistic. Mungo is relieved that they did not catch R2-D2.\n\nMeanwhile, R2-D2 reaches the port just after the ship casts off. Artoo jumps off the pier and swims after the Roon Clipper. During the voyage, Lin-D tells jokes about Jabba the Hutt's weight in an attempt to cheer up the other slaves, who don't take too well to his humor. Meanwhile, R2-D2 climbs onto the deck covered in seaweed. A sentry droid notices him but Artoo electrocutes him. He then rolls down the lower decks and reunites with R2-D2.\n\nArtoo proceeds to release Mungo, Aurem and C-3PO. Mungo tells R2-D2 to cut loose the other prisoners and meet him on the deck since he is going after the Roonstones. Aurem advises against it but Mungo is stubborn. The liberated prisoners overpower the overseer. Gaff senses something is going on below deck and sends the guards to investigate while he checks the cargo hold. Reaching the cargo hold, he encounters Mungo. Gaff accidentally discharges his blaster, setting one of the ship's sails ablaze.\n\nThe slaves charge up the deck and fight the guards. Aurem tells Mungo and the droids to get out of here. Governor Koong awakens to find Gaff putting out a fire. By then, the galley prisoners have escaped in the lifeboats. Koong is furious that Mungo has escaped with his Roonstones and orders Gaff to release the drones. Gaff protests that they won't find them in the fog but Koong is determined to recover his Roonstones.\n\n",
        "section": "Escaping slavery[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 520.0
      }
    },
    {
      "id": "2316",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Aftermath[]\n\nVia holoscreen, Admiral Screed rebukes Koong for being a fool and warns that the Emperor has no use for fools. Koong protests that Mungo's escape was sheer luck. Screed warns that there may not be a next time after his report. Koong vows to conquer Roon and to have the secrets of the Roonstones and to destroy Mungo Baobab.\n\nMeanwhile, Aurem says that she is relieved to be home and says that she feared that the Roonstones would be the end of them. Mungo has learned an important lesson about friendship and says that droids are also important friends. Mungo puts his shoulder around Aurem, who senses his adventure is not yet over. Mungo resolves to translate the rest of the message on the pyramidical stone once they get to Umboo in order to find the source of the Roonstones.\n\nR2-D2 also repairs Lin-D, who is grateful to the astromech droid. He tells him and Threepio that they make a good team and should go on the road. He nicknames the trio \"Lin-D and his Cosmic Cutups.\" C-3PO asks R2-D2 how he could do this to him.\n\n",
        "section": "Aftermath[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 267.0
      }
    },
    {
      "id": "2311",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Meeting Oggem Baobab[]\n\nAuren, Mungo and the droids travel through a desolate plain under the cover of rain. They take shelter from the rain in an old agricultural freighter. While exploring the derelict freighter, R2-D2 senses movement but C-3PO thinks that the ship is settling into the mud. C-3PO is startled by a space suit. Continuing their exploration of the ship, they discover \"Old Ogger.\" Auren introduces herself while Mungo says they have come to ask him about the Roonstones.\n\n\"Old Ogger\" asks Mungo to come closer since he has trouble seeing due to old age. He notices that Mungo wears the colors of the Baobab Merchant Fleet and asks who he is. After Mungo introduces himself, \"Old Ogger\" introduces himself as Mungo's great-uncle, Oggem Baobab, who left sixty years previously on a quest to find the Roonstones. Oggem explains that he was marooned here after his ship crashed and explains that he found six bags full of Roonstones. Oggem explains that he almost found the source of the Roonstones and longs to share his knowledge with someone. He turns his quest over to Mungo but warns him to put family and friends before treasure. Oggem then breathes his last. Auren and Mungo tend to Oggem in his final moments.\n\nMungo gathers the six bags of Roonstones, which Auren agrees is a rich fortune that his uncle Oggem left behind. C-3PO inquires about the kit bag which Oggem left for Mungo. Inside, Mungo finds a memling, which C-3PO explains to R2-D2 is a complex element valued for its mutable properties. Auren and Mungo notice that the memling can change its shape. Mungo also finds a blaster–like device within the kit bag, which the droids describe as a weapon.\n\nAnother object within the kit bag is a pyramidical device with different languages on its sides. C-3PO reads an inscription that says \"In fire and ice, the white stones glow. Frozen forever, yet warmed from below.\" Mungo believes this riddle is a clue to the last of the Roonstones. He hopes to fulfill Uncle Ogeem's wish and write a historic chapter in the Baobab Archives.\n\nAuren tries to talk him out of it, since he has enough Roonstones without finding the source. She also warns that it could be dangerous and warns him to heed Uncle Oggem's last words that the treasure is secondary to family and friends. Mungo is still determined to continue with the quest and asks Auren where is the nearest settlement to find supplies. She tells him to head to the nearby port of Nime. Despite Auren's pleas, Mungo sets off on his rockhopper to Nime.\n\n",
        "section": "Meeting Oggem Baobab[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 632.0
      }
    },
    {
      "id": "2317",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Behind the scenes[]\n\nThis episode was released on DVD in 2004 as part of the Treasure of the Hidden Planet feature film.\nThe old spacesuits that Threepio bumps into aboard the haunted spaceship wreck, is the same kind of suit worn by Jess Meade in \"The New King.\"\nThe slave driver aboard Koong's galley was also one of Kybo Ren's pirates in the Mon Julpa arc, and got his hat and vest borrowed by C-3PO in \"The Pirates of Tarnoonga.\"\nOne of the slaves sitting behind Mungo and Aurem in Koong's galley was in charge of the Droid auction on Tyne's Horky in \"The Lost Prince.\"\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 154.0
      }
    },
    {
      "id": "2312",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Trouble at Nime[]\n\nAt Nime, the group meet at an inn where C-3PO attempts to obtain information about the Roonstones from a pair of Lutki information brokers. They give him a bag of coins. Meanwhile aboard his personal ship Roon Clipper, Governor Koong tells Gaff and his troops that Mungo and his companions have been spotted at a nearby inn. Before C-3PO and Mungo can conclude the deal with the Lutki, Gaff and Koong's troops enter the inn under the pretext of recruiting able-bodied volunteers into Governor Koong's navy.\n\nGaff spots Mungo and demands that he leave immediately. Mungo throws a bowl of soup into his face, causing him to stumble into the rest of Koong's enforcers. Mungo, Aurem, and R2-D2 flee but C-3PO has trouble seeing due to his glasses. Gaff corners the four but Mungo fires Oggem's blaster-like device, which turns out to be a seed launcher which creates fast growing vines that entangles him. The four flee but they find their path blocked by Governor Koong and more enforcers. Mungo uses the seed launcher to entangle Governor Koong and some of his men with vines.\n\nThe rockhoppers run off and Koong tries to round them up despite Aurem's warning. R2-2 uses a lasoo to secure one of the rockhoppers while Mungo struggles to secure the second. R2-D2 crashes into a basket with fruits. Gaff forces Mungo to surrender in order to save Aurem's life. Mungo surrenders for now.\n\n",
        "section": "Trouble at Nime[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 359.0
      }
    },
    {
      "id": "2310",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Mungo's quest[]\n\nThe episode open with a probe droid flying over a winding river and lush landscape. Along the riverbank, R2-D2 and C-3PO are repairing Mungo Baobab's starship. C-3PO, who is fixing the underside of the ship, is jealous of R2-D2 who has been given the job of spraypainting the ship. C-3PO tries to demonstrate but ends up stepping in a pail of paint. After performing the last test-firing, Mungo decides that they should return to Manda.\n\nC-3PO is eager to return home but wishes that their journey to find Roonstones had been successful. Mungo agrees, saying that this trip won't go down in the Baobab Archives as a glowing triumph. He grumbles about losing his father's ship to Governor Koong and not finding the Roonstones. C-3PO reassures Mungo that they have found friends in the form of the Yomm family. A sad Mungo says that Auren Yomm left on some quest and thinks that she doesn't care that they are leaving. The droids notice that Mungo has become attached to Aurem.\n\nArtoo senses something but Threepio thinks that paint has interfered with his sensors. Unknown to the droids, they are being watched by Admiral Screed, Governor Koong, and Gaff via Koong's Sloyd Probe. Admiral Screed is surprised that a backwater planet like Roon can host such an advance surveillance system. However, he then chastises Governor Koong for failing to recover the Roonstones for the Galactic Empire. Koong advises patience since he believes that Baobab will lead them to the source of the Roonstones. He vows that Gaff will be ready.\n\nLater, Auren and her father Nilz Yomm, who are riding rockhoppers, come to visit Mungo and the droids. Mungo is relieved that they have not forgotten about him. Auren says that she is relieved they made it back in time. She gives Mungo a present which turns out to be a Roonstone. When Mungo asks where they go it from, Nilz tells him to speak to the hermit \"Old Ogger\", an old prospector who lives near the Bantha Garage, to learn more. Mungo decides to seek the \"Old Ogger.\" The Imperials are monitoring their conversation and send Gaff to find out everything he can. Screed sends two stormtroopers to accompany Gaff and warns that any Roonstones will become the property of the Empire. Koong adds \"and its allies.\"\n\n",
        "section": "Mungo's quest[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 566.0
      }
    },
    {
      "id": "2318",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Behind the scenes[]\n\nThis episode was released on DVD in 2004 as part of the Treasure of the Hidden Planet feature film.\nThe old spacesuits that Threepio bumps into aboard the haunted spaceship wreck, is the same kind of suit worn by Jess Meade in \"The New King.\"\nThe slave driver aboard Koong's galley was also one of Kybo Ren's pirates in the Mon Julpa arc, and got his hat and vest borrowed by C-3PO in \"The Pirates of Tarnoonga.\"\nOne of the slaves sitting behind Mungo and Aurem in Koong's galley was in charge of the Droid auction on Tyne's Horky in \"The Lost Prince.\"\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 154.0
      }
    },
    {
      "id": "2315",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - The drones and whirlpool[]\n\nGaff dispatches two drone fighters into the fog. Mungo, Aurem, the droids and Lin-D find their life boat sailing into a storm. Lin-D tries to cheer them up with a joke about Goflings but C-3PO and R2-D2 don't appreciate his humor. The drones catch up with them and destroy the life boat's motor. Mungo users a laser cannon emplacement to shoot one of the drones down. The ship's sail is damage by a blast and falls on Lin-D. Mungo manages to take out the second drone fighter. Aurem feels sorry for Lin-D's loss.\n\nThe Roon Clipper approaches their lifeboat. Gaff tells Governor Koong they have sighted their quarry. Koong orders his crew to charge at them. C-3PO points out that they are approaching a whirlpool. Mungo uses the Memling to create an improvised sail but Aurem points out the boat is too heavy. Mungo tells them to toss anything that is not nailed down. However, it is still not enough.\n\nWith a heavy heart, Mungo throws the six Roonstones into the sea. This allows their boat to escape the whirlpool. Koong sends fighters after them, which Mungo easily destroys; the ship's sail falls onto Lin-D, however. Governor Koong and Gaff sight the whirlpool and order the helmsman to steer the Roon Clipper away. Gaff manages to steer the ship away from the whirlpool and issues orders for the crew to set sail to Tawntoon immediately.\n\n",
        "section": "The drones and whirlpool[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 343.0
      }
    },
    {
      "id": "2442",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nUpon arrival at the Capital City starport, the rebels boarded a Star Commuter 2000 transport shuttle bound for Garel, which was only a few minutes away from Lothal via hyperspace. In order to avoid suspicion, as well as enact a plan to locate the weapons, the rebels boarded the shuttle pretending to not know one another; Bridger and the rebels' astromech droid, C1-10P—also known as Chopper—sat together, while Orrelios and Wren sat across from them. Tua and Wabo soon arrived and were seated in front, just ahead of Orrelios and Wren. R2-D2 and C-3PO arrived shortly thereafter, followed by Jarrus, who arrived at the shuttle at the last minute while pretending to be running late. Once all were aboard, the shuttle departed from Lothal and made the jump towards Garel.\n\nWhile en route to Garel, Chopper made a scene by pretending to start a fight with Bridger, so as to draw attention towards them. Jarrus, still acting as a stranger, demanded that the pilot droid, RX-24, enforce the Imperial regulations regarding droids in the passenger area. With Chopper sent to the back of the shuttle, Bridger demanded that C-3PO and R2-D2 also be sent to the back. Despite Tua's objections, as she needed them for her mission, RX-24 sent the two Imperial droids to the back of the shuttle. With Tua unable to understand Wabo, Wren offered her services as a translator, posing as a loyal student from the Imperial Academy. In Aqualish, Wren asked Wabo where the shipment of T-7 disruptors was being held on Garel. Wabo told her they were in Bay 7, but Wren misled Tua and told the Minister that they were in Bay 17, a lie that would give the rebels time to steal the weapons before the Empire could get to them.\n\nThe ship arrived in the Garel City Spaceport moments later, and the rebels and Imperials disembarked. While the Empire headed for the wrong cargo bay, the rebels began the next phase of their plan. Bridger was tasked with crawling through a ventilation system and reaching Bay 7, where he would unlock the door for the rest of the crew. Bridger, who had been a thief while living alone on Lothal, resented having to resort to stealing and infiltration again, as he had joined the crew of the Ghost so Jarrus could train him as a Jedi—training that had yet to begin. He made his way to a rooftop and across a number of others before arriving at the cargo bay, where he found the cache of weapons and opened the door for the others. Once Jarrus, Wren, and Orrelios arrived, Syndulla—who made her way to Garel aboard the Ghost—landed the ship.\n\nAs the Ghost landed, the rebels inspected the weapons and realized that they were T-7 disruptors. Orrelios was horrified at the discovery, as he had seen them used against his people. Despite Orrelios' reluctance, Jarrus ordered that the weapons be loaded onto the Ghost. Meanwhile, the Imperials arrived in Bay 17 and found that there were no weapons. Wabo stated that they were in Bay 7, which C-3PO translated for the Minister. Tua ordered her stormtroopers to head for the correct cargo bay, where the rebels were still loading the weapons. Chopper, who was spying on the Imperials, was discovered, prompting Tua to realize that she had been tricked by Wren and the rebels.\n\nThe Imperials arrived in Bay 7 just as the cargo crates were being loaded. The stormtroopers demanded that the rebels surrender, but, while Orrelios distracted the Imperials, the weapons continued to be loaded onto the Ghost. As the stormtroopers attempted to inspect the crates, which Orrelios claimed were his, the Lasat attacked the soldiers, leading to a firefight between the Imperials and the rebels. During the firefight, R2-D2 realized that the thieves were rebels and led C-3PO aboard the Ghost, which took off and departed Garel once the remaining weapons were loaded. Jarrus ordered restraining bolts to be placed on the droids, not realizing what their true mission was.",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 925.0
      }
    },
    {
      "id": "2440",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Prelude[]\n\nIn 5 BBY, the rebel crew of the freighter Ghost carried out a number of operations against the Galactic Empire on the Outer Rim planet Lothal. Shortly after their successful mission to rescue Wookiee slaves from the spice mines of Kessel, the crew ran low on supplies, including food, explosives, and fuel. They attempted to steal a shipment of supplies from the Empire, but ended up in battle with an Imperial-class Star Destroyer and a squadron of TIE/ln space superiority starfighters. The Ghost was able to escape from the Imperial forces, but without the supplies the crew was hoping to obtain. They knew that if they did not obtain supplies or money, they would not be able to continue fighting against the Galactic Empire or even maintain the operations of the Ghost. Kanan Jarrus, the field leader of the rebel crew, suggested that they take a job from Lothal crime lord Cikatro Vizago. The idea was met with resistance by the Lasat crew member Garazeb Orrelios, who objected to taking a job as arms dealers for the Devaronian criminal, but Padawan Ezra Bridger agreed with Jarrus, his Jedi teacher. The rebel leader said he already knew the mission, which was to intercept an Imperial arms deal on the planet Garel. After some further discussion, the crew headed to Capital City on Lothal to begin their mission.\n\nMeanwhile, the Empire prepared for their arms deal, where Minister Maketh Tua of Lothal would meet with weapons manufacturer Amda Wabo to obtain Wabo's T-7 ion disruptor rifles on Garel; the disruptors, which could be used to gruesome effect on sentient beings, had previously been banned by the Imperial Senate after their use in the near-extinction of the Lasat species. In order for Tua to understand Wabo, an Aqualish, she would be assisted by two droids, the astromech droid R2-D2 and and the protocol droid C-3PO. The droids were loaned to Lothal's governor, Arihnda Pryce, by Senator Bail Organa of Alderaan, who secretly wanted the illegal weapons destroyed. However, only R2-D2 was aware of their true motives; the chatty C-3PO was kept in the dark.\n\n",
        "section": "Prelude[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 485.0
      }
    },
    {
      "id": "2445",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Battle on Lothal[]\n\nAfter Jarrus confirmed the crew's rendezvous with Vizago, the Ghost landed in the crime lord's encampment on Lothal. Before the crew disembarked, R2-D2 revealed that his real mission was to ensure that the disruptors did not fall into Imperial hands and that his master—whom the droid did not identify as Senator Organa—would provide a generous reward if the droids were returned to him. Jarrus said he would consider it, but nonetheless pushed ahead with his plan to sell the weapons to Vizago. While the rebels unloaded the weapons, C-3PO sent a distress call to Governor Pryce, saying that he and R2-D2 had been abducted by criminals. The signal was intercepted aboard Kallus' ship, the Lawbringer, and Kallus himself replied to the worried protocol droid. C-3PO, who believed Kallus would rescue him, sent the ISB Agent the location of the Ghost.\n\nAs Imperial forces prepared to attack the rebels, Vizago inspected the weapons that the crew had stolen for him. Before Vizago could pay the rebels, however, Kallus' forces arrived, including multiple stormtroopers and two AT-DP walkers. Vizago fled the scene with some of the disruptors, unwilling to pay for only half a shipment, and left the rebels behind to deal with the Imperial forces. Unwilling to risk the disruptors falling into Imperial hands, Jarrus ordered Wren to destroy them. R2-D2, who disembarked from the ship with C-3PO, offered his assistance in destroying the weapons, thus fulfilling Senator Organa's orders. R2-D2 suggested overloading the disruptors so they would explode, a plan that Wren agreed with. Jarrus took one of the weapons for himself in order to eliminate the AT-DPs, while the rest of the crew helped Wren.\n\nThe walkers began firing on the rebels' location, and Jarrus took one of them out. Orrelios and Bridger ran to his aid once a walker fired at him, and they watched as Kallus and his stormtroopers approached. Once Kallus saw Orrelios, he demanded that the Lasat face him in combat. The two fought using AB-75 bo-rifles, the weapon of the Lasan High Honor Guard—Kallus revealed he had stolen the weapon from a Lasat he had killed, and that Kallus himself had personally ordered the use of the disruptors on Lasan. Enraged, Orrelios continued fighting against the ISB Agent. While the two fought, the rebels overloaded the disruptors and pushed them towards the remaining walker and the stormtroopers, triggering explosions that took out both the weapons, the soldiers, and the AT-DP.\n\nThe resulting explosions triggered a small ground tremor, causing Orrelios to lose his balance. Kallus found the upper hand and nearly killed his opponent, before Bridger spontaneously used the Force to throw Kallus through the air, away from Orrelios. The rebels were able to use that as an opportunity to grab Orrelios and return to the Ghost, which took off and departed Lothal, leaving Kallus behind.\n\n",
        "section": "Battle on Lothal[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 692.0
      }
    },
    {
      "id": "2441",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nUpon arrival at the Capital City starport, the rebels boarded a Star Commuter 2000 transport shuttle bound for Garel, which was only a few minutes away from Lothal via hyperspace. In order to avoid suspicion, as well as enact a plan to locate the weapons, the rebels boarded the shuttle pretending to not know one another; Bridger and the rebels' astromech droid, C1-10P—also known as Chopper—sat together, while Orrelios and Wren sat across from them. Tua and Wabo soon arrived and were seated in front, just ahead of Orrelios and Wren. R2-D2 and C-3PO arrived shortly thereafter, followed by Jarrus, who arrived at the shuttle at the last minute while pretending to be running late. Once all were aboard, the shuttle departed from Lothal and made the jump towards Garel.\n\nWhile en route to Garel, Chopper made a scene by pretending to start a fight with Bridger, so as to draw attention towards them. Jarrus, still acting as a stranger, demanded that the pilot droid, RX-24, enforce the Imperial regulations regarding droids in the passenger area. With Chopper sent to the back of the shuttle, Bridger demanded that C-3PO and R2-D2 also be sent to the back. Despite Tua's objections, as she needed them for her mission, RX-24 sent the two Imperial droids to the back of the shuttle. With Tua unable to understand Wabo, Wren offered her services as a translator, posing as a loyal student from the Imperial Academy. In Aqualish, Wren asked Wabo where the shipment of T-7 disruptors was being held on Garel. Wabo told her they were in Bay 7, but Wren misled Tua and told the Minister that they were in Bay 17, a lie that would give the rebels time to steal the weapons before the Empire could get to them.\n\nThe ship arrived in the Garel City Spaceport moments later, and the rebels and Imperials disembarked. While the Empire headed for the wrong cargo bay, the rebels began the next phase of their plan. Bridger was tasked with crawling through a ventilation system and reaching Bay 7, where he would unlock the door for the rest of the crew. Bridger, who had been a thief while living alone on Lothal, resented having to resort to stealing and infiltration again, as he had joined the crew of the Ghost so Jarrus could train him as a Jedi—training that had yet to begin. He made his way to a rooftop and across a number of others before arriving at the cargo bay, where he found the cache of weapons and opened the door for the others. Once Jarrus, Wren, and Orrelios arrived, Syndulla—who made her way to Garel aboard the Ghost—landed the ship.\n\nAs the Ghost landed, the rebels inspected the weapons and realized that they were T-7 disruptors. Orrelios was horrified at the discovery, as he had seen them used against his people. Despite Orrelios' reluctance, Jarrus ordered that the weapons be loaded onto the Ghost. Meanwhile, the Imperials arrived in Bay 17 and found that there were no weapons. Wabo stated that they were in Bay 7, which C-3PO translated for the Minister. Tua ordered her stormtroopers to head for the correct cargo bay, where the rebels were still loading the weapons. Chopper, who was spying on the Imperials, was discovered, prompting Tua to realize that she had been tricked by Wren and the rebels.\n\nThe Imperials arrived in Bay 7 just as the cargo crates were being loaded. The stormtroopers demanded that the rebels surrender, but, while Orrelios distracted the Imperials, the weapons continued to be loaded onto the Ghost. As the stormtroopers attempted to inspect the crates, which Orrelios claimed were his, the Lasat attacked the soldiers, leading to a firefight between the Imperials and the rebels. During the firefight, R2-D2 realized that the thieves were rebels and led C-3PO aboard the Ghost, which took off and departed Garel once the remaining weapons were loaded. Jarrus ordered restraining bolts to be placed on the droids, not realizing what their true mission was.\n\nThe realization that the mission was to steal the disruptors led to some debate amongst the crew, a debate that R2-D2 recorded. Orrelios did not want to sell the disruptors to Vizago, instead wanting to destroy them so they could never be used again. Wren was thankful that, at the very least, they were out of Imperial hands, as she had learned through her translating that the Empire intended to mass produce them on Lothal. Jarrus was satisfied that the Empire could not have the weapons, but was insistent that they still sell the weapons to Vizago for the credits the crew needed. Wren also suggested selling C-3PO and R2-D2 to Vizago for extra credits.\n\nWhile the rebels were en route to Lothal, Minister Tua contacted Agent Kallus of the Imperial Security Bureau, who had taken an interest in the rebels during their rescue mission on Kessel. Tua informed the ISB Agent of the weapons theft and described the crew, including how one crew member was a Lasat, prompting Kallus to realize it was the rebels he had been tracking.\n\n",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 1158.0
      }
    },
    {
      "id": "2439",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons\n\nPrevious\nMission to free Wookiee prisoners\n\n\nNext\nAttack on Imperial Troop Transports\n\n\n\n\n\n\nMission to steal Imperial weapons\n\n\n\nConflict\nEarly rebellion against the Galactic Empire\n\n\nObjective\nSteal T-7 ion disruptor rifles from the Galactic Empire and sell them to Cikatro Vizago\n\n\nDate\n5 BBY\n\n\nPlace\nGarel City Spaceport, Garel City, GarelVizago's camp, Lothal\n\n\nOutcome\nRebel victory:The disruptors are destroyedR2-D2 and C-3PO are returned to Senator Bail Organa of AlderaanOrgana learns about the Lothal rebels\n\n\n\n\nFactions\n\n\nLothal rebels\nGalactic Empire\n\n\n\n\n\n\n\nCommanders\n\n\nKanan Jarrus\nMinister Maketh TuaAgent Kallus\nSenator Bail Organa\n\n\n\n\n\n\nParticipants\n\n\nEzra BridgerC1-10PGarazeb OrreliosHera SyndullaSabine Wren1 VCX-100 light freighterGhost\nAmda WaboMultiple stormtroopers1 Gozanti-class Assault Carrier2 AT-DPs†\nC-3POR2-D21 CR90 corvetteTantive IV\n\n\n\n\n\n\nCasualties\n\n\nNone\nMultiple stormtroopers2 AT-DPs\nNone\n\n\n\n\n[Source]\n\nThe mission to steal Imperial weapons was an operation undertaken in 5 BBY by the rebel crew of the Ghost to steal and, ultimately, destroy illegal T-7 ion disruptor rifles from the Galactic Empire. It was a formative operation in the early days of the Alliance to Restore the Republic.\n\nThe mission began as a means of securing credits needed to replenish their ship's supplies and continue their operations against the Empire; the crime lord Cikatro Vizago, who operated on the Outer Rim planet Lothal, was willing to pay for the weapons. The mission took the rebels to the planet Garel, which they traveled to aboard a star commuter shuttle. Aboard that shuttle was Minister Maketh Tua, who was attempting to procure the weapons from their manufacturer, Amda Wabo, with the help of two droids—R2-D2 and C-3PO, who were secretly working for Senator Bail Organa of Alderaan to destroy the weapons. The rebels were able to learn the location of the weapons in the Garel City Spaceport, and stole them before the Empire could obtain them. After a brief firefight on Garel, the rebels escaped back to Lothal.\n\nOnce on Lothal, the rebels attempted to sell the weapons to Vizago, but were quickly discovered by Agent Kallus of the Imperial Security Bureau. This led to a brief battle against Imperial forces, in which the rebels destroyed the disruptors so they could not fall into Imperial hands. The rebels escaped Agent Kallus' forces and returned the droids to Senator Organa, who was able to learn about the rebels from R2-D2. In the aftermath of the mission, the rebels became part of the fledging Rebel Alliance that Organa helped lead, though only the pilot of the Ghost, Hera Syndulla, knew of their involvement at first. They later learned of their involvement, as well as Organa's, after other rebel cells came to their assistance during mission to rescue the crew's field leader, Kanan Jarrus, from the Empire.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 686.0
      }
    },
    {
      "id": "2448",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Behind the scenes[]\n\nThe rebels' mission to steal the T-7 ion disruptor rifles was the central plot of \"Droids in Distress,\" the first regular series episode of the animated television series Star Wars Rebels. The event was first referenced in Star Wars Rebels: The Visual Guide, a reference book that introduced the characters and settings of the show, and was described as an arms deal in which C-3PO and R2-D2 encountered the rebels and went on \"an unexpected adventure.\" The Visual Guide also introduced the fact that the droids were on loan to Governor Pryce by Senator Organa, thereby setting up the backstory of the episode.\n\nHighlighting how the Imperial regime would sometimes avoid the authority of the Imperial Senate, StarWars.com drew a comparison between the illicit Imperial arms deal in \"Droids in Distress\" and the capture of Princess Leia Organa in Star Wars: Episode IV A New Hope. In the episode, the Empire arranges for the arms deal in secret so as to avoid the attention of the Imperial Senate, whereas A New Hope implies that the Imperial Senate would not approve of the fact that Darth Vader and the Empire boarded the Tantive IV and took Princess Leia captive.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 252.0
      }
    },
    {
      "id": "2443",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nThe realization that the mission was to steal the disruptors led to some debate amongst the crew, a debate that R2-D2 recorded. Orrelios did not want to sell the disruptors to Vizago, instead wanting to destroy them so they could never be used again. Wren was thankful that, at the very least, they were out of Imperial hands, as she had learned through her translating that the Empire intended to mass produce them on Lothal. Jarrus was satisfied that the Empire could not have the weapons, but was insistent that they still sell the weapons to Vizago for the credits the crew needed. Wren also suggested selling C-3PO and R2-D2 to Vizago for extra credits.\n\nWhile the rebels were en route to Lothal, Minister Tua contacted Agent Kallus of the Imperial Security Bureau, who had taken an interest in the rebels during their rescue mission on Kessel. Tua informed the ISB Agent of the weapons theft and described the crew, including how one crew member was a Lasat, prompting Kallus to realize it was the rebels he had been tracking.",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 247.0
      }
    },
    {
      "id": "2592",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - Official description[]\n\nLow on food and fuel, the Ghost crew agrees to steal an Imperial weapons shipment for crime lord Cikatro Vizago. During the mission, they encounter a familiar droid duo -- and find that the weapons in question are more deadly than they'd realized.\n\n",
        "section": "Official description[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 64.0
      }
    },
    {
      "id": "2595",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - The theft[]\n\nUpon landing on Garel, Minister Tua, C-3PO, R2-D2 and a contingent of stormtroopers depart for Bay Seventeen. Meanwhile, the Spectres make their way towards Bay Seven. To enter the cargo bay, Ezra climbs through a ventilation duct to the roof, using Force jumps across the distant rooftops to Bay Seven's roof. While making his way up the duct, Ezra complains to Kanan via comlink about the delay in his Jedi lessons and that stealing to survive is already something he knows. In response, Kanan replies that the crew need the credits. After entering Bay Seven, Ezra opens the bay door from inside to let in Kanan, Zeb, and Sabine, and Kanan opens the outer bay door to the opposite landing bay, where Hera lands the Ghost. Upon examining the cargo shipment, they discover that the crates contain T-7 ion disruptor rifles, weapons that had been banned by the Galactic Senate. Zeb is particularly upset by the discovery.\n\nMeanwhile, Minister Tua, C-3PO, R2-D2, and her stormtroopers discover that Bay Seventeen is empty. C-3PO deduces that Sabine probably confused the Aqualish word for seven with seventeen. Chopper, keeping an eye on the Imperials, contacts Hera and informs her that Tua and Wabo are on their way to Bay Seven. Ordered to stall them, Chopper picks a fight with R2-D2, but Minister Tua recognizes Chopper as the troublesome astromech droid from the shuttle and orders her men to hurry to Bay Seven. Before the rebels can finish loading the last of the disruptor rifles onto the Ghost, they are confronted by Tua and her stormtroopers. Following a brief gunfight, the rebels manage to flee Garel and set course back to Lothal.\n\nThe crew of the Ghost are accompanied by two stowaways, C-3PO having been led aboard by the insistent R2-D2. Kanan orders Sabine to fit them with restraining bolts. Zeb calls Kanan aside and suggests they just take the T-7s out of circulation and not sell them to Vizago; they don't notice R2 eavesdropping over from where he's standing, as he makes sure he can hear them. Returning with the bolts, Sabine notes that at least the Empire doesn't have them: she learned from her translation that the Empire was planning to use the shipment as prototypes for mass producing the ion rifles on Lothal. As they could really use the money, she also suggests offering R2 and 3PO for sale to Vizago for extra credits.\n\nNot really reassured about the rifles, the despondent Zeb kicks Ezra out of their cabin and locks the door. Hera calls Ezra to the cockpit and asks him to cut Zeb some slack. She reveals that the Empire had used T-7 rifles to violently clear the Lasat homeworld of Lasan. Zeb was one of the few Lasat who survived the genocide, and none of his people are currently on Lasan. Ezra agrees to cut Zeb some slack. When Hera learns that Kanan hasn't started training Ezra, with a frown she resolves to take up the matter with Kanan. Meanwhile, Minister Tua reports her recent encounter with the rebels on Garel to the Imperial Security Bureau Agent Kallus, who takes an interest in the Lasat Zeb. When Tua states that she didn't think there were any more Lasat left in the galaxy, Kallus responds that there are only a few.\n\n",
        "section": "The theft[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 750.0
      }
    },
    {
      "id": "2597",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - Showdown[]\n\nUpon landing at the rendezvous point with Vizago on Lothal, the crew of the Ghost meet in the cargo hold to unload the rifles, with Hera agreeing to put off the topic of Ezra's training only for the moment. Sabine announces that R2 told her that his mission was to keep the T-7s out of Imperial hands, and that his master will pay handsomely for the two's return; Kanan agrees to consider it. Zeb is still not comfortable with selling the rifles, but as long as it's not the Empire, Kanan is fine with going ahead with the deal he already made with Vizago. Believing that the crew of the Ghost are criminals, thieves, and outlaws, C-3PO sneaks into the cockpit while the crew is busy with the cargo and sends a distress signal to Governor Pryce, but as she is away it's rerouted to Agent Kallus, who promises that \"help is on the way.\"\n\nMeanwhile, Vizago agrees to buy the T-7s and ordered his IG-RM droids to load the crates onto two speeders. Before they can complete the transaction, they spot an Imperial freighter carrying two All Terrain Defense Pod walkers on its way. Vizago and his droids quickly flee with four of the seven crates without paying the Ghost's crew, stating that he doesn't pay for partial shipments or trouble with the Empire. Kanan is left shaking with anger.\n\nKanan resolves not to let the disruptors fall into Imperial hands, and orders Sabine to destroy them. She starts heading to the ship to get explosives, but is surprised to see R2 leading the other two droids to the crates, saying he's helping the crew. He explains that they can just overload the T-7 disruptors, causing them to explode. While the others get the crates together and open them so Sabine and R2-D2 can get to work, Kanan destroys one of the advancing AT-DP walkers with a T-7 rifle but is knocked to the ground by a laser blast from the second walker. Hera then distracts the second walker by leading it on a chase around the surrounding stone circle and orders Chopper to prep the Ghost for takeoff. Shortly after, Agent Kallus and a contingent of stormtroopers disembark from the Imperial freighter and exchange fire with the crew.\n\nDuring the fighting, Agent Kallus challenges Zeb to a duel and battles the Lasat with a stolen bo-rifle he had taken from a member of the Lasan High Honor Guard he personally killed. Kallus also goads Zeb by claiming to have ordered the use of the T-7 rifles in the pacification of Lasan. Sabine and R2-D2 finish with the rifles, and the others use one crate to destroy the walker, and the other two to scatter the stormtroopers. The powerful detonation throws both Kallus and Zeb off balance, but Kallus recovers a hair faster and stuns Zeb in the chest, leaving him defenseless. Before he can finish off Zeb, Ezra instinctively Force pushes Kallus so hard he's thrown back, tumbles along the ground and slams into a rock, knocking him out. Gathering up Zeb and C-3PO and R2-D2, the crew of the Ghost flee into space. Kallus comes to in time to watch the ship depart. On board, Zeb thanks Kanan for saving his life, only to corrected that it was Ezra, and Zeb nods his thanks. Kanan also informs Ezra that his formal Jedi training will start the following day. Even so, after saying this Kanan's smile drops off to a quiet look of concern about the weight of promising to be a teacher.\n\n",
        "section": "Showdown[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 790.0
      }
    },
    {
      "id": "2593",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - In need of a job[]\n\nThe Ghost is being chased by a squad of TIE fighters and a Star Destroyer, fresh from a failed heist. After the ship jumps to hyperspace, Kanan Jarrus and Sabine Wren argue over the former's assertion that they would get away from the failed theft with the Imperial shipment they had attempted to steal. Hera Syndulla notes that the crew is low on food and fuel, and Ezra Bridger complains that there's been no time for his promised Jedi training. Kanan knows about another job, though, from the crime lord Cikatro Vizago. Garazeb Orrelios is not happy about the Spectres being arms dealers again, but the crew agrees to take the job, so they're off to the Lothal City spaceport.\n\n",
        "section": "In need of a job[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 173.0
      }
    },
    {
      "id": "2594",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - The con[]\n\nAt Lothal's main spaceport, Ezra and the astromech droid Chopper board Star Commuter 2000 shuttle ST-45, which is leaving for Garel. Aboard the shuttle, they pass by fellow rebels Sabine and Zeb, also disguised as passengers. Shortly after, the shuttle is boarded by Imperial minister Maketh Tua and Aqualish arms trader Amda Wabo, who sit in front of Zeb and Sabine. Wabo speaks to Tua in the Aqualish language, and Tua demands to know where her translator is: the protocol droid C-3PO, who boards the shuttle accompanied by the astromech droid R2-D2. C-3PO's services are necessary because Tua and Wabo cannot communicate directly. Just before the shuttle departs, they are joined by Kanan, boarding at the last minute. The various members of the Ghost crew (Zeb and Sabine, Ezra and Chopper, Kanan) are pretending not to know each other.\n\nAfter the shuttle enters hyperspace, Ezra and Chopper stage a fight, prompting Kanan to demand that the RX-24 droid pilot send Chopper to the back of the craft. In response, Ezra demands that C-3PO and R2-D2 be transferred to the back as well, referring to both droids as astromechs. C-3PO takes insult at being called an astromech, stressing that he is a protocol droid, and Tua tells the pilot that the two droids are accompanying her, and she is on Imperial business. The droid pilot informs Tua that Imperial regulations require all droids (save for himself) at the back of the craft, and 3PO begrudgingly heads to the back, followed by R2. With Tua bereft of a translator, Sabine then volunteers her services while posing as an Imperial Academy student. Sabine quickly learns that Tua's weapons shipment is located in Bay Seven of Garel City Spaceport. However, she misleads Tua into believing that it is in Bay Seventeen. C-3PO, in the back, sniffs that Sabine can't possibly take his place as translator. When R2-D2 attempts to find out what Tua and Wabo, with Sabine translating, are talking about, C-3PO tells him that it hardly matters to him what they're saying, and Chopper, believing R2 to be an Imperial droid, bumps into him to prevent him from listening. 3PO tells R2 that he could stand to learn some manners from Chopper.\n\n",
        "section": "The con[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 552.0
      }
    },
    {
      "id": "3057",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Battle on Lothal[]\n\nAfter Jarrus confirmed the crew's rendezvous with Vizago, the Ghost landed in the crime lord's encampment on Lothal. Before the crew disembarked, R2-D2 revealed that his real mission was to ensure that the disruptors did not fall into Imperial hands and that his master—whom the droid did not identify as Senator Organa—would provide a generous reward if the droids were returned to him. Jarrus said he would consider it, but nonetheless pushed ahead with his plan to sell the weapons to Vizago. While the rebels unloaded the weapons, C-3PO sent a distress call to Governor Pryce, saying that he and R2-D2 had been abducted by criminals. The signal was intercepted aboard Kallus' ship, the Lawbringer, and Kallus himself replied to the worried protocol droid. C-3PO, who believed Kallus would rescue him, sent the ISB Agent the location of the Ghost.\n\nAs Imperial forces prepared to attack the rebels, Vizago inspected the weapons that the crew had stolen for him. Before Vizago could pay the rebels, however, Kallus' forces arrived, including multiple stormtroopers and two AT-DP walkers. Vizago fled the scene with some of the disruptors, unwilling to pay for only half a shipment, and left the rebels behind to deal with the Imperial forces. Unwilling to risk the disruptors falling into Imperial hands, Jarrus ordered Wren to destroy them. R2-D2, who disembarked from the ship with C-3PO, offered his assistance in destroying the weapons, thus fulfilling Senator Organa's orders. R2-D2 suggested overloading the disruptors so they would explode, a plan that Wren agreed with. Jarrus took one of the weapons for himself in order to eliminate the AT-DPs, while the rest of the crew helped Wren.\n\nThe walkers began firing on the rebels' location, and Jarrus took one of them out. Orrelios and Bridger ran to his aid once a walker fired at him, and they watched as Kallus and his stormtroopers approached. Once Kallus saw Orrelios, he demanded that the Lasat face him in combat. The two fought using AB-75 bo-rifles, the weapon of the Lasan High Honor Guard—Kallus revealed he had stolen the weapon from a Lasat he had killed, and that Kallus himself had personally ordered the use of the disruptors on Lasan. Enraged, Orrelios continued fighting against the ISB Agent. While the two fought, the rebels overloaded the disruptors and pushed them towards the remaining walker and the stormtroopers, triggering explosions that took out both the weapons, the soldiers, and the AT-DP.\n\nThe resulting explosions triggered a small ground tremor, causing Orrelios to lose his balance. Kallus found the upper hand and nearly killed his opponent, before Bridger spontaneously used the Force to throw Kallus through the air, away from Orrelios. The rebels were able to use that as an opportunity to grab Orrelios and return to the Ghost, which took off and departed Lothal, leaving Kallus behind.\n\n",
        "section": "Battle on Lothal[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 692.0
      }
    },
    {
      "id": "3056",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Behind the scenes[]\n\nThis episode was released on DVD in 2004 as part of the Treasure of the Hidden Planet feature film.\nThe old spacesuits that Threepio bumps into aboard the haunted spaceship wreck, is the same kind of suit worn by Jess Meade in \"The New King.\"\nThe slave driver aboard Koong's galley was also one of Kybo Ren's pirates in the Mon Julpa arc, and got his hat and vest borrowed by C-3PO in \"The Pirates of Tarnoonga.\"\nOne of the slaves sitting behind Mungo and Aurem in Koong's galley was in charge of the Droid auction on Tyne's Horky in \"The Lost Prince.\"\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 154.0
      }
    },
    {
      "id": "3036",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nUpon arrival at the Capital City starport, the rebels boarded a Star Commuter 2000 transport shuttle bound for Garel, which was only a few minutes away from Lothal via hyperspace. In order to avoid suspicion, as well as enact a plan to locate the weapons, the rebels boarded the shuttle pretending to not know one another; Bridger and the rebels' astromech droid, C1-10P—also known as Chopper—sat together, while Orrelios and Wren sat across from them. Tua and Wabo soon arrived and were seated in front, just ahead of Orrelios and Wren. R2-D2 and C-3PO arrived shortly thereafter, followed by Jarrus, who arrived at the shuttle at the last minute while pretending to be running late. Once all were aboard, the shuttle departed from Lothal and made the jump towards Garel.\n\nWhile en route to Garel, Chopper made a scene by pretending to start a fight with Bridger, so as to draw attention towards them. Jarrus, still acting as a stranger, demanded that the pilot droid, RX-24, enforce the Imperial regulations regarding droids in the passenger area. With Chopper sent to the back of the shuttle, Bridger demanded that C-3PO and R2-D2 also be sent to the back. Despite Tua's objections, as she needed them for her mission, RX-24 sent the two Imperial droids to the back of the shuttle. With Tua unable to understand Wabo, Wren offered her services as a translator, posing as a loyal student from the Imperial Academy. In Aqualish, Wren asked Wabo where the shipment of T-7 disruptors was being held on Garel. Wabo told her they were in Bay 7, but Wren misled Tua and told the Minister that they were in Bay 17, a lie that would give the rebels time to steal the weapons before the Empire could get to them.\n\nThe ship arrived in the Garel City Spaceport moments later, and the rebels and Imperials disembarked. While the Empire headed for the wrong cargo bay, the rebels began the next phase of their plan. Bridger was tasked with crawling through a ventilation system and reaching Bay 7, where he would unlock the door for the rest of the crew. Bridger, who had been a thief while living alone on Lothal, resented having to resort to stealing and infiltration again, as he had joined the crew of the Ghost so Jarrus could train him as a Jedi—training that had yet to begin. He made his way to a rooftop and across a number of others before arriving at the cargo bay, where he found the cache of weapons and opened the door for the others. Once Jarrus, Wren, and Orrelios arrived, Syndulla—who made her way to Garel aboard the Ghost—landed the ship.\n\nAs the Ghost landed, the rebels inspected the weapons and realized that they were T-7 disruptors. Orrelios was horrified at the discovery, as he had seen them used against his people. Despite Orrelios' reluctance, Jarrus ordered that the weapons be loaded onto the Ghost. Meanwhile, the Imperials arrived in Bay 17 and found that there were no weapons. Wabo stated that they were in Bay 7, which C-3PO translated for the Minister. Tua ordered her stormtroopers to head for the correct cargo bay, where the rebels were still loading the weapons. Chopper, who was spying on the Imperials, was discovered, prompting Tua to realize that she had been tricked by Wren and the rebels.\n\nThe Imperials arrived in Bay 7 just as the cargo crates were being loaded. The stormtroopers demanded that the rebels surrender, but, while Orrelios distracted the Imperials, the weapons continued to be loaded onto the Ghost. As the stormtroopers attempted to inspect the crates, which Orrelios claimed were his, the Lasat attacked the soldiers, leading to a firefight between the Imperials and the rebels. During the firefight, R2-D2 realized that the thieves were rebels and led C-3PO aboard the Ghost, which took off and departed Garel once the remaining weapons were loaded. Jarrus ordered restraining bolts to be placed on the droids, not realizing what their true mission was.",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 925.0
      }
    },
    {
      "id": "3068",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Behind the scenes[]\n\nThe rebels' mission to steal the T-7 ion disruptor rifles was the central plot of \"Droids in Distress,\" the first regular series episode of the animated television series Star Wars Rebels. The event was first referenced in Star Wars Rebels: The Visual Guide, a reference book that introduced the characters and settings of the show, and was described as an arms deal in which C-3PO and R2-D2 encountered the rebels and went on \"an unexpected adventure.\" The Visual Guide also introduced the fact that the droids were on loan to Governor Pryce by Senator Organa, thereby setting up the backstory of the episode.\n\nHighlighting how the Imperial regime would sometimes avoid the authority of the Imperial Senate, StarWars.com drew a comparison between the illicit Imperial arms deal in \"Droids in Distress\" and the capture of Princess Leia Organa in Star Wars: Episode IV A New Hope. In the episode, the Empire arranges for the arms deal in secret so as to avoid the attention of the Imperial Senate, whereas A New Hope implies that the Imperial Senate would not approve of the fact that Darth Vader and the Empire boarded the Tantive IV and took Princess Leia captive.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 252.0
      }
    },
    {
      "id": "3030",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Trouble at Nime[]\n\nAt Nime, the group meet at an inn where C-3PO attempts to obtain information about the Roonstones from a pair of Lutki information brokers. They give him a bag of coins. Meanwhile aboard his personal ship Roon Clipper, Governor Koong tells Gaff and his troops that Mungo and his companions have been spotted at a nearby inn. Before C-3PO and Mungo can conclude the deal with the Lutki, Gaff and Koong's troops enter the inn under the pretext of recruiting able-bodied volunteers into Governor Koong's navy.\n\nGaff spots Mungo and demands that he leave immediately. Mungo throws a bowl of soup into his face, causing him to stumble into the rest of Koong's enforcers. Mungo, Aurem, and R2-D2 flee but C-3PO has trouble seeing due to his glasses. Gaff corners the four but Mungo fires Oggem's blaster-like device, which turns out to be a seed launcher which creates fast growing vines that entangles him. The four flee but they find their path blocked by Governor Koong and more enforcers. Mungo uses the seed launcher to entangle Governor Koong and some of his men with vines.\n\nThe rockhoppers run off and Koong tries to round them up despite Aurem's warning. R2-2 uses a lasoo to secure one of the rockhoppers while Mungo struggles to secure the second. R2-D2 crashes into a basket with fruits. Gaff forces Mungo to surrender in order to save Aurem's life. Mungo surrenders for now.\n\n",
        "section": "Trouble at Nime[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 359.0
      }
    },
    {
      "id": "3031",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Prelude[]\n\nIn 5 BBY, the rebel crew of the freighter Ghost carried out a number of operations against the Galactic Empire on the Outer Rim planet Lothal. Shortly after their successful mission to rescue Wookiee slaves from the spice mines of Kessel, the crew ran low on supplies, including food, explosives, and fuel. They attempted to steal a shipment of supplies from the Empire, but ended up in battle with an Imperial-class Star Destroyer and a squadron of TIE/ln space superiority starfighters. The Ghost was able to escape from the Imperial forces, but without the supplies the crew was hoping to obtain. They knew that if they did not obtain supplies or money, they would not be able to continue fighting against the Galactic Empire or even maintain the operations of the Ghost. Kanan Jarrus, the field leader of the rebel crew, suggested that they take a job from Lothal crime lord Cikatro Vizago. The idea was met with resistance by the Lasat crew member Garazeb Orrelios, who objected to taking a job as arms dealers for the Devaronian criminal, but Padawan Ezra Bridger agreed with Jarrus, his Jedi teacher. The rebel leader said he already knew the mission, which was to intercept an Imperial arms deal on the planet Garel. After some further discussion, the crew headed to Capital City on Lothal to begin their mission.\n\nMeanwhile, the Empire prepared for their arms deal, where Minister Maketh Tua of Lothal would meet with weapons manufacturer Amda Wabo to obtain Wabo's T-7 ion disruptor rifles on Garel; the disruptors, which could be used to gruesome effect on sentient beings, had previously been banned by the Imperial Senate after their use in the near-extinction of the Lasat species. In order for Tua to understand Wabo, an Aqualish, she would be assisted by two droids, the astromech droid R2-D2 and and the protocol droid C-3PO. The droids were loaned to Lothal's governor, Arihnda Pryce, by Senator Bail Organa of Alderaan, who secretly wanted the illegal weapons destroyed. However, only R2-D2 was aware of their true motives; the chatty C-3PO was kept in the dark.\n\n",
        "section": "Prelude[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 485.0
      }
    },
    {
      "id": "3049",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Aftermath[]\n\nVia holoscreen, Admiral Screed rebukes Koong for being a fool and warns that the Emperor has no use for fools. Koong protests that Mungo's escape was sheer luck. Screed warns that there may not be a next time after his report. Koong vows to conquer Roon and to have the secrets of the Roonstones and to destroy Mungo Baobab.\n\nMeanwhile, Aurem says that she is relieved to be home and says that she feared that the Roonstones would be the end of them. Mungo has learned an important lesson about friendship and says that droids are also important friends. Mungo puts his shoulder around Aurem, who senses his adventure is not yet over. Mungo resolves to translate the rest of the message on the pyramidical stone once they get to Umboo in order to find the source of the Roonstones.\n\nR2-D2 also repairs Lin-D, who is grateful to the astromech droid. He tells him and Threepio that they make a good team and should go on the road. He nicknames the trio \"Lin-D and his Cosmic Cutups.\" C-3PO asks R2-D2 how he could do this to him.\n\n",
        "section": "Aftermath[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 267.0
      }
    },
    {
      "id": "3034",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nUpon arrival at the Capital City starport, the rebels boarded a Star Commuter 2000 transport shuttle bound for Garel, which was only a few minutes away from Lothal via hyperspace. In order to avoid suspicion, as well as enact a plan to locate the weapons, the rebels boarded the shuttle pretending to not know one another; Bridger and the rebels' astromech droid, C1-10P—also known as Chopper—sat together, while Orrelios and Wren sat across from them. Tua and Wabo soon arrived and were seated in front, just ahead of Orrelios and Wren. R2-D2 and C-3PO arrived shortly thereafter, followed by Jarrus, who arrived at the shuttle at the last minute while pretending to be running late. Once all were aboard, the shuttle departed from Lothal and made the jump towards Garel.\n\nWhile en route to Garel, Chopper made a scene by pretending to start a fight with Bridger, so as to draw attention towards them. Jarrus, still acting as a stranger, demanded that the pilot droid, RX-24, enforce the Imperial regulations regarding droids in the passenger area. With Chopper sent to the back of the shuttle, Bridger demanded that C-3PO and R2-D2 also be sent to the back. Despite Tua's objections, as she needed them for her mission, RX-24 sent the two Imperial droids to the back of the shuttle. With Tua unable to understand Wabo, Wren offered her services as a translator, posing as a loyal student from the Imperial Academy. In Aqualish, Wren asked Wabo where the shipment of T-7 disruptors was being held on Garel. Wabo told her they were in Bay 7, but Wren misled Tua and told the Minister that they were in Bay 17, a lie that would give the rebels time to steal the weapons before the Empire could get to them.\n\nThe ship arrived in the Garel City Spaceport moments later, and the rebels and Imperials disembarked. While the Empire headed for the wrong cargo bay, the rebels began the next phase of their plan. Bridger was tasked with crawling through a ventilation system and reaching Bay 7, where he would unlock the door for the rest of the crew. Bridger, who had been a thief while living alone on Lothal, resented having to resort to stealing and infiltration again, as he had joined the crew of the Ghost so Jarrus could train him as a Jedi—training that had yet to begin. He made his way to a rooftop and across a number of others before arriving at the cargo bay, where he found the cache of weapons and opened the door for the others. Once Jarrus, Wren, and Orrelios arrived, Syndulla—who made her way to Garel aboard the Ghost—landed the ship.\n\nAs the Ghost landed, the rebels inspected the weapons and realized that they were T-7 disruptors. Orrelios was horrified at the discovery, as he had seen them used against his people. Despite Orrelios' reluctance, Jarrus ordered that the weapons be loaded onto the Ghost. Meanwhile, the Imperials arrived in Bay 17 and found that there were no weapons. Wabo stated that they were in Bay 7, which C-3PO translated for the Minister. Tua ordered her stormtroopers to head for the correct cargo bay, where the rebels were still loading the weapons. Chopper, who was spying on the Imperials, was discovered, prompting Tua to realize that she had been tricked by Wren and the rebels.\n\nThe Imperials arrived in Bay 7 just as the cargo crates were being loaded. The stormtroopers demanded that the rebels surrender, but, while Orrelios distracted the Imperials, the weapons continued to be loaded onto the Ghost. As the stormtroopers attempted to inspect the crates, which Orrelios claimed were his, the Lasat attacked the soldiers, leading to a firefight between the Imperials and the rebels. During the firefight, R2-D2 realized that the thieves were rebels and led C-3PO aboard the Ghost, which took off and departed Garel once the remaining weapons were loaded. Jarrus ordered restraining bolts to be placed on the droids, not realizing what their true mission was.\n\nThe realization that the mission was to steal the disruptors led to some debate amongst the crew, a debate that R2-D2 recorded. Orrelios did not want to sell the disruptors to Vizago, instead wanting to destroy them so they could never be used again. Wren was thankful that, at the very least, they were out of Imperial hands, as she had learned through her translating that the Empire intended to mass produce them on Lothal. Jarrus was satisfied that the Empire could not have the weapons, but was insistent that they still sell the weapons to Vizago for the credits the crew needed. Wren also suggested selling C-3PO and R2-D2 to Vizago for extra credits.\n\nWhile the rebels were en route to Lothal, Minister Tua contacted Agent Kallus of the Imperial Security Bureau, who had taken an interest in the rebels during their rescue mission on Kessel. Tua informed the ISB Agent of the weapons theft and described the crew, including how one crew member was a Lasat, prompting Kallus to realize it was the rebels he had been tracking.\n\n",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 1158.0
      }
    },
    {
      "id": "3033",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Escaping slavery[]\n\nGaff orders his troops to capture the rockhoppers and bring them to the Roon Clipper, a galley with sails. Mungo, Aurem, and Threepio are chained to the lower decks where they are forced to join the other slaves in rowing the galley. Governor Koong tells his prisoners that when they reach Koong Island, Screed will be waiting for them. He tells them to tell him everything they know about the source of the Roontsones. The overseer warns the slaves that if the ship goes down, they will go down with it. Threepio's companion is Lin-D, an entertainment droid who tells jokes incessantly. Lin-D tries to be optimistic but C-3PO is pessimistic. Mungo is relieved that they did not catch R2-D2.\n\nMeanwhile, R2-D2 reaches the port just after the ship casts off. Artoo jumps off the pier and swims after the Roon Clipper. During the voyage, Lin-D tells jokes about Jabba the Hutt's weight in an attempt to cheer up the other slaves, who don't take too well to his humor. Meanwhile, R2-D2 climbs onto the deck covered in seaweed. A sentry droid notices him but Artoo electrocutes him. He then rolls down the lower decks and reunites with R2-D2.\n\nArtoo proceeds to release Mungo, Aurem and C-3PO. Mungo tells R2-D2 to cut loose the other prisoners and meet him on the deck since he is going after the Roonstones. Aurem advises against it but Mungo is stubborn. The liberated prisoners overpower the overseer. Gaff senses something is going on below deck and sends the guards to investigate while he checks the cargo hold. Reaching the cargo hold, he encounters Mungo. Gaff accidentally discharges his blaster, setting one of the ship's sails ablaze.\n\nThe slaves charge up the deck and fight the guards. Aurem tells Mungo and the droids to get out of here. Governor Koong awakens to find Gaff putting out a fire. By then, the galley prisoners have escaped in the lifeboats. Koong is furious that Mungo has escaped with his Roonstones and orders Gaff to release the drones. Gaff protests that they won't find them in the fog but Koong is determined to recover his Roonstones.\n\n",
        "section": "Escaping slavery[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 520.0
      }
    },
    {
      "id": "3044",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons - Stealing the disruptors[]\n\nThe realization that the mission was to steal the disruptors led to some debate amongst the crew, a debate that R2-D2 recorded. Orrelios did not want to sell the disruptors to Vizago, instead wanting to destroy them so they could never be used again. Wren was thankful that, at the very least, they were out of Imperial hands, as she had learned through her translating that the Empire intended to mass produce them on Lothal. Jarrus was satisfied that the Empire could not have the weapons, but was insistent that they still sell the weapons to Vizago for the credits the crew needed. Wren also suggested selling C-3PO and R2-D2 to Vizago for extra credits.\n\nWhile the rebels were en route to Lothal, Minister Tua contacted Agent Kallus of the Imperial Security Bureau, who had taken an interest in the rebels during their rescue mission on Kessel. Tua informed the ISB Agent of the weapons theft and described the crew, including how one crew member was a Lasat, prompting Kallus to realize it was the rebels he had been tracking.",
        "section": "Stealing the disruptors[]",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 247.0
      }
    },
    {
      "id": "3018",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Mungo's quest[]\n\nThe episode open with a probe droid flying over a winding river and lush landscape. Along the riverbank, R2-D2 and C-3PO are repairing Mungo Baobab's starship. C-3PO, who is fixing the underside of the ship, is jealous of R2-D2 who has been given the job of spraypainting the ship. C-3PO tries to demonstrate but ends up stepping in a pail of paint. After performing the last test-firing, Mungo decides that they should return to Manda.\n\nC-3PO is eager to return home but wishes that their journey to find Roonstones had been successful. Mungo agrees, saying that this trip won't go down in the Baobab Archives as a glowing triumph. He grumbles about losing his father's ship to Governor Koong and not finding the Roonstones. C-3PO reassures Mungo that they have found friends in the form of the Yomm family. A sad Mungo says that Auren Yomm left on some quest and thinks that she doesn't care that they are leaving. The droids notice that Mungo has become attached to Aurem.\n\nArtoo senses something but Threepio thinks that paint has interfered with his sensors. Unknown to the droids, they are being watched by Admiral Screed, Governor Koong, and Gaff via Koong's Sloyd Probe. Admiral Screed is surprised that a backwater planet like Roon can host such an advance surveillance system. However, he then chastises Governor Koong for failing to recover the Roonstones for the Galactic Empire. Koong advises patience since he believes that Baobab will lead them to the source of the Roonstones. He vows that Gaff will be ready.\n\nLater, Auren and her father Nilz Yomm, who are riding rockhoppers, come to visit Mungo and the droids. Mungo is relieved that they have not forgotten about him. Auren says that she is relieved they made it back in time. She gives Mungo a present which turns out to be a Roonstone. When Mungo asks where they go it from, Nilz tells him to speak to the hermit \"Old Ogger\", an old prospector who lives near the Bantha Garage, to learn more. Mungo decides to seek the \"Old Ogger.\" The Imperials are monitoring their conversation and send Gaff to find out everything he can. Screed sends two stormtroopers to accompany Gaff and warns that any Roonstones will become the property of the Empire. Koong adds \"and its allies.\"\n\n",
        "section": "Mungo's quest[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 566.0
      }
    },
    {
      "id": "3045",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - The drones and whirlpool[]\n\nGaff dispatches two drone fighters into the fog. Mungo, Aurem, the droids and Lin-D find their life boat sailing into a storm. Lin-D tries to cheer them up with a joke about Goflings but C-3PO and R2-D2 don't appreciate his humor. The drones catch up with them and destroy the life boat's motor. Mungo users a laser cannon emplacement to shoot one of the drones down. The ship's sail is damage by a blast and falls on Lin-D. Mungo manages to take out the second drone fighter. Aurem feels sorry for Lin-D's loss.\n\nThe Roon Clipper approaches their lifeboat. Gaff tells Governor Koong they have sighted their quarry. Koong orders his crew to charge at them. C-3PO points out that they are approaching a whirlpool. Mungo uses the Memling to create an improvised sail but Aurem points out the boat is too heavy. Mungo tells them to toss anything that is not nailed down. However, it is still not enough.\n\nWith a heavy heart, Mungo throws the six Roonstones into the sea. This allows their boat to escape the whirlpool. Koong sends fighters after them, which Mungo easily destroys; the ship's sail falls onto Lin-D, however. Governor Koong and Gaff sight the whirlpool and order the helmsman to steer the Roon Clipper away. Gaff manages to steer the ship away from the whirlpool and issues orders for the crew to set sail to Tawntoon immediately.\n\n",
        "section": "The drones and whirlpool[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 343.0
      }
    },
    {
      "id": "3053",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Behind the scenes[]\n\nThis episode was released on DVD in 2004 as part of the Treasure of the Hidden Planet feature film.\nThe old spacesuits that Threepio bumps into aboard the haunted spaceship wreck, is the same kind of suit worn by Jess Meade in \"The New King.\"\nThe slave driver aboard Koong's galley was also one of Kybo Ren's pirates in the Mon Julpa arc, and got his hat and vest borrowed by C-3PO in \"The Pirates of Tarnoonga.\"\nOne of the slaves sitting behind Mungo and Aurem in Koong's galley was in charge of the Droid auction on Tyne's Horky in \"The Lost Prince.\"\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 154.0
      }
    },
    {
      "id": "3024",
      "title": "Mission to steal Imperial weapons",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Featured articles",
          "Battles in 5 BBY",
          "5 more",
          "Battles of Garel",
          "Heists and robberies",
          "Missions of the Early rebellion against the Galactic Empire",
          "Missions of the Ghost",
          "Missions to Lothal"
        ],
        "content": "# Mission to steal Imperial weapons\n\nPrevious\nMission to free Wookiee prisoners\n\n\nNext\nAttack on Imperial Troop Transports\n\n\n\n\n\n\nMission to steal Imperial weapons\n\n\n\nConflict\nEarly rebellion against the Galactic Empire\n\n\nObjective\nSteal T-7 ion disruptor rifles from the Galactic Empire and sell them to Cikatro Vizago\n\n\nDate\n5 BBY\n\n\nPlace\nGarel City Spaceport, Garel City, GarelVizago's camp, Lothal\n\n\nOutcome\nRebel victory:The disruptors are destroyedR2-D2 and C-3PO are returned to Senator Bail Organa of AlderaanOrgana learns about the Lothal rebels\n\n\n\n\nFactions\n\n\nLothal rebels\nGalactic Empire\n\n\n\n\n\n\n\nCommanders\n\n\nKanan Jarrus\nMinister Maketh TuaAgent Kallus\nSenator Bail Organa\n\n\n\n\n\n\nParticipants\n\n\nEzra BridgerC1-10PGarazeb OrreliosHera SyndullaSabine Wren1 VCX-100 light freighterGhost\nAmda WaboMultiple stormtroopers1 Gozanti-class Assault Carrier2 AT-DPs†\nC-3POR2-D21 CR90 corvetteTantive IV\n\n\n\n\n\n\nCasualties\n\n\nNone\nMultiple stormtroopers2 AT-DPs\nNone\n\n\n\n\n[Source]\n\nThe mission to steal Imperial weapons was an operation undertaken in 5 BBY by the rebel crew of the Ghost to steal and, ultimately, destroy illegal T-7 ion disruptor rifles from the Galactic Empire. It was a formative operation in the early days of the Alliance to Restore the Republic.\n\nThe mission began as a means of securing credits needed to replenish their ship's supplies and continue their operations against the Empire; the crime lord Cikatro Vizago, who operated on the Outer Rim planet Lothal, was willing to pay for the weapons. The mission took the rebels to the planet Garel, which they traveled to aboard a star commuter shuttle. Aboard that shuttle was Minister Maketh Tua, who was attempting to procure the weapons from their manufacturer, Amda Wabo, with the help of two droids—R2-D2 and C-3PO, who were secretly working for Senator Bail Organa of Alderaan to destroy the weapons. The rebels were able to learn the location of the weapons in the Garel City Spaceport, and stole them before the Empire could obtain them. After a brief firefight on Garel, the rebels escaped back to Lothal.\n\nOnce on Lothal, the rebels attempted to sell the weapons to Vizago, but were quickly discovered by Agent Kallus of the Imperial Security Bureau. This led to a brief battle against Imperial forces, in which the rebels destroyed the disruptors so they could not fall into Imperial hands. The rebels escaped Agent Kallus' forces and returned the droids to Senator Organa, who was able to learn about the rebels from R2-D2. In the aftermath of the mission, the rebels became part of the fledging Rebel Alliance that Organa helped lead, though only the pilot of the Ghost, Hera Syndulla, knew of their involvement at first. They later learned of their involvement, as well as Organa's, after other rebel cells came to their assistance during mission to rescue the crew's field leader, Kanan Jarrus, from the Empire.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mission_to_steal_Imperial_weapons",
        "title": "Mission to steal Imperial weapons",
        "tokens": 686.0
      }
    },
    {
      "id": "3025",
      "title": "Across the Roon Sea",
      "metadata": {
        "categories": [
          "Real-world media",
          "1985 releases",
          "Star Wars: Droids: The Adventures of R2-D2 and C-3PO episodes"
        ],
        "content": "# Across the Roon Sea - Meeting Oggem Baobab[]\n\nAuren, Mungo and the droids travel through a desolate plain under the cover of rain. They take shelter from the rain in an old agricultural freighter. While exploring the derelict freighter, R2-D2 senses movement but C-3PO thinks that the ship is settling into the mud. C-3PO is startled by a space suit. Continuing their exploration of the ship, they discover \"Old Ogger.\" Auren introduces herself while Mungo says they have come to ask him about the Roonstones.\n\n\"Old Ogger\" asks Mungo to come closer since he has trouble seeing due to old age. He notices that Mungo wears the colors of the Baobab Merchant Fleet and asks who he is. After Mungo introduces himself, \"Old Ogger\" introduces himself as Mungo's great-uncle, Oggem Baobab, who left sixty years previously on a quest to find the Roonstones. Oggem explains that he was marooned here after his ship crashed and explains that he found six bags full of Roonstones. Oggem explains that he almost found the source of the Roonstones and longs to share his knowledge with someone. He turns his quest over to Mungo but warns him to put family and friends before treasure. Oggem then breathes his last. Auren and Mungo tend to Oggem in his final moments.\n\nMungo gathers the six bags of Roonstones, which Auren agrees is a rich fortune that his uncle Oggem left behind. C-3PO inquires about the kit bag which Oggem left for Mungo. Inside, Mungo finds a memling, which C-3PO explains to R2-D2 is a complex element valued for its mutable properties. Auren and Mungo notice that the memling can change its shape. Mungo also finds a blaster–like device within the kit bag, which the droids describe as a weapon.\n\nAnother object within the kit bag is a pyramidical device with different languages on its sides. C-3PO reads an inscription that says \"In fire and ice, the white stones glow. Frozen forever, yet warmed from below.\" Mungo believes this riddle is a clue to the last of the Roonstones. He hopes to fulfill Uncle Ogeem's wish and write a historic chapter in the Baobab Archives.\n\nAuren tries to talk him out of it, since he has enough Roonstones without finding the source. She also warns that it could be dangerous and warns him to heed Uncle Oggem's last words that the treasure is secondary to family and friends. Mungo is still determined to continue with the quest and asks Auren where is the nearest settlement to find supplies. She tells him to head to the nearby port of Nime. Despite Auren's pleas, Mungo sets off on his rockhopper to Nime.\n\n",
        "section": "Meeting Oggem Baobab[]",
        "source": "https://starwars.fandom.com/wiki/Across_the_Roon_Sea",
        "title": "Across the Roon Sea",
        "tokens": 632.0
      }
    },
    {
      "id": "3181",
      "title": "Amda Wabo",
      "metadata": {
        "categories": [
          "Canon articles",
          "Aqualish",
          "Arms dealers",
          "2 more",
          "Individuals with he/him pronouns",
          "Males"
        ],
        "content": "# Amda Wabo - Biography[]\n\nThe male Aqualish Amda Wabo was originally a native of the planet Ando, but during the early years of the Galactic Empire's reign worked as a weapons designer on the planet Garel. Around fourteen years after the founding of the Empire—Lothal Year 3272—Wabo acted as a representative of Garel in negotiating a deal to sell a large supply of experimental T-7 ion disruptor rifles to the Imperials, weapons which were illegal under Imperial law. The Aqualish agreed to a one-on-one meeting with Imperial Minister Maketh Tua on the nearby planet of Lothal, where the pair conversed with the aid of the protocol droid C-3PO, who Tua had borrowed from Senator Bail Organa along with the astromech droid R2-D2, in order to act as a translator.\n\nOnce the meeting was complete, Wabo, Tua and the pair of droids boarded the Star Commuter 2000 shuttle ST-45 in Lothal's Capital City spaceport, which was traveling to Garel, where the weapons would be exchanged. The shuttle was also boarded however, by several members of the starship Ghost who had agreed to steal the disruptors from Wabo and the Imperials for Cikatro Vizago, leader of the criminal Broken Horn Syndicate. During the flight, C1-10P, an astromech member of the Ghost's crew, purposefully began a fight with another crew member, Ezra Bridger, causing all droids including C-3PO to be sent to the rear of the shuttle by the RX-Series pilot droid, RX-24. This left Wabo and Tua without a translator and therefore unable to understand each other, although Wabo kept trying to converse much to Tua's annoyance. Garazeb Orrelios, another Ghost crew member who was seated behind Wabo, then offered the services of his companion Sabine Wren as a translator, which Tua gratefully accepted. When Tua asked Wren to inquire where Wabo had stored the disruptors, the translator purposefully mistranslated the Aqualish's answer that they were in Bay 7 in Garel City Spaceport and told the Imperial minister they were in Bay 17.\n\nAfter landing on Garel, Wabo, Tua, and the droids rendezvoused with a squad of stormtroopers and, much to Wabo's confusion headed to Bay 17. Upon arrival, the group discovered the bay to be empty at which point Wabo complained and pointed out that they were in the wrong place. With C-3PO present again to translate what the Aqualish was saying, Tua realized what had happened when she recognized C1-10P observing them from nearby and ordered that the Imperials move to Bay 7 to seize the disruptors. Upon reaching Bay 7, Wabo and the Imperials discovered the Ghost's crew loading crates on to their ship, which the Stormtroopers demanded they allowed to be searched. Two members of the crew, Orrelios and Kanan Jarrus then attacked the Imperials and held them off while the rest of the disruptors were loaded. In the confusion R2-D2 and C-3PO also boarded the Ghost in an attempt to catch C1-10P, and were still on board when it took off and fled Garel.\n\nWithout a translator, Wabo came to believe that the Imperials had double crossed him, and despite Tua's unsuccessful attempts to calm him, drew his heavy blaster pistol on Tua. The crew of the Ghost successfully brought Wabo's weapons to the Broken Horn, who took most of them before Imperial's arrived to disrupt the deal. Vizago then took what weapons he had without paying the Ghost's crew, who destroyed the rest while escaping the Empire.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Amda_Wabo",
        "title": "Amda Wabo",
        "tokens": 802.0
      }
    },
    {
      "id": "3496",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - Official description[]\n\nLow on food and fuel, the Ghost crew agrees to steal an Imperial weapons shipment for crime lord Cikatro Vizago. During the mission, they encounter a familiar droid duo -- and find that the weapons in question are more deadly than they'd realized.\n\n",
        "section": "Official description[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 64.0
      }
    },
    {
      "id": "3499",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - In need of a job[]\n\nThe Ghost is being chased by a squad of TIE fighters and a Star Destroyer, fresh from a failed heist. After the ship jumps to hyperspace, Kanan Jarrus and Sabine Wren argue over the former's assertion that they would get away from the failed theft with the Imperial shipment they had attempted to steal. Hera Syndulla notes that the crew is low on food and fuel, and Ezra Bridger complains that there's been no time for his promised Jedi training. Kanan knows about another job, though, from the crime lord Cikatro Vizago. Garazeb Orrelios is not happy about the Spectres being arms dealers again, but the crew agrees to take the job, so they're off to the Lothal City spaceport.\n\n",
        "section": "In need of a job[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 173.0
      }
    },
    {
      "id": "3505",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - The theft[]\n\nUpon landing on Garel, Minister Tua, C-3PO, R2-D2 and a contingent of stormtroopers depart for Bay Seventeen. Meanwhile, the Spectres make their way towards Bay Seven. To enter the cargo bay, Ezra climbs through a ventilation duct to the roof, using Force jumps across the distant rooftops to Bay Seven's roof. While making his way up the duct, Ezra complains to Kanan via comlink about the delay in his Jedi lessons and that stealing to survive is already something he knows. In response, Kanan replies that the crew need the credits. After entering Bay Seven, Ezra opens the bay door from inside to let in Kanan, Zeb, and Sabine, and Kanan opens the outer bay door to the opposite landing bay, where Hera lands the Ghost. Upon examining the cargo shipment, they discover that the crates contain T-7 ion disruptor rifles, weapons that had been banned by the Galactic Senate. Zeb is particularly upset by the discovery.\n\nMeanwhile, Minister Tua, C-3PO, R2-D2, and her stormtroopers discover that Bay Seventeen is empty. C-3PO deduces that Sabine probably confused the Aqualish word for seven with seventeen. Chopper, keeping an eye on the Imperials, contacts Hera and informs her that Tua and Wabo are on their way to Bay Seven. Ordered to stall them, Chopper picks a fight with R2-D2, but Minister Tua recognizes Chopper as the troublesome astromech droid from the shuttle and orders her men to hurry to Bay Seven. Before the rebels can finish loading the last of the disruptor rifles onto the Ghost, they are confronted by Tua and her stormtroopers. Following a brief gunfight, the rebels manage to flee Garel and set course back to Lothal.\n\nThe crew of the Ghost are accompanied by two stowaways, C-3PO having been led aboard by the insistent R2-D2. Kanan orders Sabine to fit them with restraining bolts. Zeb calls Kanan aside and suggests they just take the T-7s out of circulation and not sell them to Vizago; they don't notice R2 eavesdropping over from where he's standing, as he makes sure he can hear them. Returning with the bolts, Sabine notes that at least the Empire doesn't have them: she learned from her translation that the Empire was planning to use the shipment as prototypes for mass producing the ion rifles on Lothal. As they could really use the money, she also suggests offering R2 and 3PO for sale to Vizago for extra credits.\n\nNot really reassured about the rifles, the despondent Zeb kicks Ezra out of their cabin and locks the door. Hera calls Ezra to the cockpit and asks him to cut Zeb some slack. She reveals that the Empire had used T-7 rifles to violently clear the Lasat homeworld of Lasan. Zeb was one of the few Lasat who survived the genocide, and none of his people are currently on Lasan. Ezra agrees to cut Zeb some slack. When Hera learns that Kanan hasn't started training Ezra, with a frown she resolves to take up the matter with Kanan. Meanwhile, Minister Tua reports her recent encounter with the rebels on Garel to the Imperial Security Bureau Agent Kallus, who takes an interest in the Lasat Zeb. When Tua states that she didn't think there were any more Lasat left in the galaxy, Kallus responds that there are only a few.\n\n",
        "section": "The theft[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 750.0
      }
    },
    {
      "id": "3515",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - Showdown[]\n\nUpon landing at the rendezvous point with Vizago on Lothal, the crew of the Ghost meet in the cargo hold to unload the rifles, with Hera agreeing to put off the topic of Ezra's training only for the moment. Sabine announces that R2 told her that his mission was to keep the T-7s out of Imperial hands, and that his master will pay handsomely for the two's return; Kanan agrees to consider it. Zeb is still not comfortable with selling the rifles, but as long as it's not the Empire, Kanan is fine with going ahead with the deal he already made with Vizago. Believing that the crew of the Ghost are criminals, thieves, and outlaws, C-3PO sneaks into the cockpit while the crew is busy with the cargo and sends a distress signal to Governor Pryce, but as she is away it's rerouted to Agent Kallus, who promises that \"help is on the way.\"\n\nMeanwhile, Vizago agrees to buy the T-7s and ordered his IG-RM droids to load the crates onto two speeders. Before they can complete the transaction, they spot an Imperial freighter carrying two All Terrain Defense Pod walkers on its way. Vizago and his droids quickly flee with four of the seven crates without paying the Ghost's crew, stating that he doesn't pay for partial shipments or trouble with the Empire. Kanan is left shaking with anger.\n\nKanan resolves not to let the disruptors fall into Imperial hands, and orders Sabine to destroy them. She starts heading to the ship to get explosives, but is surprised to see R2 leading the other two droids to the crates, saying he's helping the crew. He explains that they can just overload the T-7 disruptors, causing them to explode. While the others get the crates together and open them so Sabine and R2-D2 can get to work, Kanan destroys one of the advancing AT-DP walkers with a T-7 rifle but is knocked to the ground by a laser blast from the second walker. Hera then distracts the second walker by leading it on a chase around the surrounding stone circle and orders Chopper to prep the Ghost for takeoff. Shortly after, Agent Kallus and a contingent of stormtroopers disembark from the Imperial freighter and exchange fire with the crew.\n\nDuring the fighting, Agent Kallus challenges Zeb to a duel and battles the Lasat with a stolen bo-rifle he had taken from a member of the Lasan High Honor Guard he personally killed. Kallus also goads Zeb by claiming to have ordered the use of the T-7 rifles in the pacification of Lasan. Sabine and R2-D2 finish with the rifles, and the others use one crate to destroy the walker, and the other two to scatter the stormtroopers. The powerful detonation throws both Kallus and Zeb off balance, but Kallus recovers a hair faster and stuns Zeb in the chest, leaving him defenseless. Before he can finish off Zeb, Ezra instinctively Force pushes Kallus so hard he's thrown back, tumbles along the ground and slams into a rock, knocking him out. Gathering up Zeb and C-3PO and R2-D2, the crew of the Ghost flee into space. Kallus comes to in time to watch the ship depart. On board, Zeb thanks Kanan for saving his life, only to corrected that it was Ezra, and Zeb nods his thanks. Kanan also informs Ezra that his formal Jedi training will start the following day. Even so, after saying this Kanan's smile drops off to a quiet look of concern about the weight of promising to be a teacher.\n\n",
        "section": "Showdown[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 790.0
      }
    },
    {
      "id": "3502",
      "title": "Droids in Distress",
      "metadata": {
        "categories": [
          "Real-world media",
          "2014 releases",
          "Incomplete Credits",
          "Star Wars Rebels episodes"
        ],
        "content": "# Droids in Distress - The con[]\n\nAt Lothal's main spaceport, Ezra and the astromech droid Chopper board Star Commuter 2000 shuttle ST-45, which is leaving for Garel. Aboard the shuttle, they pass by fellow rebels Sabine and Zeb, also disguised as passengers. Shortly after, the shuttle is boarded by Imperial minister Maketh Tua and Aqualish arms trader Amda Wabo, who sit in front of Zeb and Sabine. Wabo speaks to Tua in the Aqualish language, and Tua demands to know where her translator is: the protocol droid C-3PO, who boards the shuttle accompanied by the astromech droid R2-D2. C-3PO's services are necessary because Tua and Wabo cannot communicate directly. Just before the shuttle departs, they are joined by Kanan, boarding at the last minute. The various members of the Ghost crew (Zeb and Sabine, Ezra and Chopper, Kanan) are pretending not to know each other.\n\nAfter the shuttle enters hyperspace, Ezra and Chopper stage a fight, prompting Kanan to demand that the RX-24 droid pilot send Chopper to the back of the craft. In response, Ezra demands that C-3PO and R2-D2 be transferred to the back as well, referring to both droids as astromechs. C-3PO takes insult at being called an astromech, stressing that he is a protocol droid, and Tua tells the pilot that the two droids are accompanying her, and she is on Imperial business. The droid pilot informs Tua that Imperial regulations require all droids (save for himself) at the back of the craft, and 3PO begrudgingly heads to the back, followed by R2. With Tua bereft of a translator, Sabine then volunteers her services while posing as an Imperial Academy student. Sabine quickly learns that Tua's weapons shipment is located in Bay Seven of Garel City Spaceport. However, she misleads Tua into believing that it is in Bay Seventeen. C-3PO, in the back, sniffs that Sabine can't possibly take his place as translator. When R2-D2 attempts to find out what Tua and Wabo, with Sabine translating, are talking about, C-3PO tells him that it hardly matters to him what they're saying, and Chopper, believing R2 to be an Imperial droid, bumps into him to prevent him from listening. 3PO tells R2 that he could stand to learn some manners from Chopper.\n\n",
        "section": "The con[]",
        "source": "https://starwars.fandom.com/wiki/Droids_in_Distress",
        "title": "Droids in Distress",
        "tokens": 552.0
      }
    },
    {
      "id": "3789",
      "title": "T-7 ion disruptor rifle",
      "metadata": {
        "categories": [
          "Canon articles",
          "Disruptor rifles"
        ],
        "content": "# T-7 ion disruptor rifle - History[]\n\nAt some point, while fighting on cold terrain, a cold weather assault stormtrooper was armed with a T-7. During the Siege of Lasan, the Empire used disruptors against the Lasat, the sentient species native to the planet. Most of the Lasat were killed during the fall, and the gruesome effects that the rifles had on organic lifeforms led the Imperial Senate to ban their use. T-7s were rather rare, and many of the rifles were either recalled or destroyed; copies of the schematics escaped deletion, however, and private weapons manufacturers produced batches that could be found on the black market—for a price.\n\nSome T-7 disruptors were manufactured and owned by weapons manufacturer Amda Wabo. Minister Maketh Tua of Lothal met with Wabo to discuss an illegal arms deal, with assistance from the droids C-3PO and R2-D2, who had been dispatched by Lothal's governor, Arihnda Pryce—and, secretly, Senator Bail Organa of Alderaan, who wanted the weapons destroyed. In truth, Wabo's weapons were prototypes that the Imperial Military wanted to mass produce on Lothal, ignoring the Senate ban. The arms deal was intercepted and disrupted on Garel by the rebel crew of the Ghost, who intended to sell the weapons to Lothal arms dealer Cikatro Vizago. Agent Kallus of the Imperial Security Bureau found the rebels and attempted to both destroy the rebels and retrieve the weapons, but he failed and the rebels were able to destroy the disruptor rifles and escape. C-3PO and R2-D2 were then returned to Senator Bail Organa. During the skirmish, Kallus also claimed he had ordered the use of ion disruptors on Lasan but later admitted this was not the case.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/T-7_ion_disruptor_rifle",
        "title": "T-7 ion disruptor rifle",
        "tokens": 381.0
      }
    },
    {
      "id": "3974",
      "title": "Star Commuter 2000",
      "metadata": {
        "categories": [
          "Canon articles",
          "Ship stubs",
          "Sacul Industries products",
          "Shuttle classes"
        ],
        "content": "# Star Commuter 2000 - History[]\n\nBetween 19 BBY and 18 BBY, information broker Ciddarin Scaleback and Clone Force 99 members \"Tech,\" \"Wrecker,\" and Omega traveled to the planet Serolonis in a Star Commuter 2000.\n\nBy 3272 LY, Lothal was linked to Garel by ST-45, which was piloted by the droid named RX-24. That year, the rebel crew of the starship Ghost booked passage for Garel aboard shuttle ST-45 as part of a scheme to gain information from Maketh Tua, an on-board Imperial minister.\n\nWhen the Spectres returned to Lothal in an attempt to extract Minister Tua, who had contacted them wishing to defect from the Empire, they flew in one of these shuttles.\n\nBy 34 ABY, some of these shuttles were still in use, as Resistance Commander Poe Dameron took newly-recruited spy Kazuda Xiono to Castilon in one. Team Colossus used one for various missions during the First Order-Resistance War.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Star_Commuter_2000",
        "title": "Star Commuter 2000",
        "tokens": 228.0
      }
    },
    {
      "id": "5370",
      "title": "R-3X",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Articles needing illustration",
          "6 more",
          "Articles with multiple issues",
          "Batuu residents",
          "Droids with masculine programming",
          "Entertainers",
          "RX-series pilot droids",
          "Star Tours personnel"
        ],
        "content": "# R-3X - Pilot[]\n\nRX-24 flew a Star Commuter 2000 from Lothal to Garel five years before the Battle of Yavin. On one occasion, the shuttle was used by the Spectres, a Rebel cell operating out of Lothal in their mission to steal arms from the Galactic Empire. Their plan involved separating Minister Maketh Tua from the Protocol droid\naccompanying her, C-3PO, so he could not translate her conversation with the Aqualish weapon designer, Amda Wabo. To accomplish this, two members of the rebel cell, the adolescent human Ezra Bridger and the astromech droid C1-10P staged a fight. Bridger demanded that RX-24 enforce a rule that would restrict all droids to the back of the transport. When Tua complained, RX-24 simply stated that he was following Imperial regulations.\n\nThe droid later went on to work for the Star Tours travel agency, where he piloted a Starspeeder 3000. At some point while working for Star Tours, Rex accidentally brought his StarSpeeder into a battle between the Imperial Navy and the Rebel Alliance. Though no one was hurt, the accident resulted in him being fired from the company. In the time after, Rex became a cargo pilot for the Alliance and claimed to have been present during the Battle of Jakku.\n\n",
        "section": "Pilot[]",
        "source": "https://starwars.fandom.com/wiki/R-3X",
        "title": "R-3X",
        "tokens": 284.0
      }
    },
    {
      "id": "7310",
      "title": "Lin-D",
      "metadata": {
        "categories": [
          "Legends articles",
          "Wookieepedia Good articles",
          "Droids with masculine programming",
          "Entertainment droids"
        ],
        "content": "# Lin-D - Biography[]\n\nLin-D was an entertainment droid manufactured before the end of 15 BBY and programmed to spread amusement and good cheer. By the conclusion of that year, Lin-D fell into the hands of Koong, the Governor of the Tawntoom Province of the planet Roon. Koong forced the droid to join a crew of organic and mechanical slaves on an ocean-going galley called the Roon Clipper, where they were forced to serve as rowers. One day, Lin-D found himself chained to a galley bench and tasked with rowing the craft across the Roon Sea to Koong Island with a cargo of valuable gems known as Roonstones in the hold. The entertainment droid's seatmate—to whom he was shackled at the ankle during the voyage—was another mechanical, a protocol droid named C-3PO who had recently joined the slave workforce after being captured along with his master, Mungo Baobab, and a friend, Auren Yomm.\n\nLin-D attempted to lighten the mood by joking about the situation, but C-3PO found him annoying. With a crack of the enslaver's electro-whip, Lin-D joined the other captives in their hours-long journey. Part of the way through the voyage, Lin-D and the other prisoners were freed from their shackles by the astromech droid R2-D2, a colleague of C-3PO's who had sneaked aboard the Clipper. When the freed captives stole lifeboats held on the vessel, Lin-D joined C-3PO, R2-D2, Baobab, and Yomm in a craft as they made their escape. The escapees faced a savage storm and whirlpool, and an attack by drones that resulted in the loss of the lifeboat's motor and sail. During the latter debacle, the sail landed on Lin-D, incapacitating him.\n\nAfter C-3PO and the others escaped their perils in the boat, they checked on the prone entertainment droid. They feared Lin-D irreparable and consoled R2-D2, who had taken a liking to the comic mechanical. Nevertheless, over the remainder of the trip to Umboo Province, R2-D2 restored Lin-D back to full working order. The resuscitated droid expressed his thanks and suggested that he, R2-D2, and C-3PO form a touring act, \"Lin-D and His Cosmic Cutups.\"\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Lin-D",
        "title": "Lin-D",
        "tokens": 508.0
      }
    },
    {
      "id": "8681",
      "title": "Rorax Falken",
      "metadata": {
        "categories": [
          "Legends articles",
          "Pages needing citation",
          "Articles to be expanded",
          "6 more",
          "Articles with multiple issues",
          "Educators",
          "Humans",
          "Males",
          "Musicians",
          "Physicists"
        ],
        "content": "# Rorax Falken - Biography[]\n\nWhen he discovered that the Galactic Empire had put his well-intentioned ideas to use in a weapon of mass destruction, he suffered a massive nervous breakdown. Falken was confined to a repulsorchair from that point on and became very secretive. He was easily noticed because of his repulsorchair, but also by his wild and unkempt gray hair.\n\nAfter retiring to Mrlsst, Falken's work became the founding influence and songwriter for the band Ghost Jedi. His music had been praised throughout the galaxy as precise, yet emotionless, much like the scientific work he performed. The band also served as his agents on the planet.\n\nFalken later became a key member of the Phantom Project and secretly begun the development of the gravitic polarization beam. In addition to his research on these projects, he also supervised the installation of the security holocams that came to cover the entire Academy. Unknown to all but himself and a handful of co-conspirators, these cameras were two-way and also worked as projectors, allowing him to create holographic illusions at will anywhere on the campus. Using this technology, he eventually developed Mrlssti Laser Phantoms. The most famous of these was built on Taj Junak, a martyred Jedi Knight, and soon created rumors that the Academy was haunted by his ghost.\n\nWhile attempting to stall the Empire's realization that the project was a hoax in 4 ABY, he came into conflict with both Rogue Squadron, an Imperial task force commanded by Captain Loka Hask, and the latter's allies in the neo-Imperial Ante-Endor Association. Falken increasingly used Mrlssti Laser Phantoms to set the contending factions against each other, sowing confusion and distrust on the Academy grounds. First he falsified a security recording to imply that Alliance pilot Tycho Celchu had stolen secret materials, leading to the arrest of the Squadron's leader, Wedge Antilles. To further undermine the negotiations between the Academy authorities and the two galactic governments, he then used another Phantom, this one of the \"Ghost Jedi\", to help him escape. Finally, Falken also coerced the Wookiee Groznik into serving as his bodyguard by showing him a Phantom of Throm Loro, his master. All the while, as the bickering factions struggled, Falken watched them through the holocams from his orbital base of operations.\n\nRogue Squadron eventually discovered the location of Falken's base and invaded it, stealing the blueprints of the Gravitic Polarization Beam before escaping. Falken was killed shortly thereafter, when Hask's forces attacked his satellite base, but succeeded in denying the Empire the use of his ultimate weapon, which he destroyed by creating a hyperspace wormhole.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Rorax_Falken",
        "title": "Rorax Falken",
        "tokens": 575.0
      }
    }
  ]
}