{
  "cluster_id": 31,
  "size": 58,
  "vectors": [
    {
      "id": "1331",
      "title": "Sentience",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Incomplete lists",
          "2 more",
          "Biological phenomena",
          "Society and culture"
        ],
        "content": "# Sentience - Behavior[]\n\nThe majority of sentient species dwelt on land, where frequent rain sustains lush forests, gardens, and grassy plains, although many species also inhabited dry ecosystems and rocky habitats. These species ability to adapt to survive on these harsher worlds made them better equipped to adapt offworld as well. Certain sentient species preferred to be immersed in liquids, and lived on worlds covered in water but could survive in airy environments without need for any breathing apparatus or environmental suits.\n\n",
        "section": "Behavior[]",
        "source": "https://starwars.fandom.com/wiki/Sentience",
        "title": "Sentience",
        "tokens": 99.0
      }
    },
    {
      "id": "1499",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Continuity[]\n\nThe key on the included galaxy map incorrectly lists all locations as \"Planets of the galaxy\" when Jedha, Pantora, Ketz, Bardelberan 7, Beixander 9 and Ajan Kloss are all moons. Jason Fry has clarified the naming conventions on maps collaboratively developed by himself and Lucasfilm to be colloquial system names commonly used in-universe by galactic citizens. He has also noted that the Inner Rim and Colonies are erroneously swapped on the galaxy map.\nStar Wars: Galaxy's Edge: Traveler's Guide to Batuu, Star Wars Droids Guide to a Galaxy Far, Far Away and Star Wars Galaxy Map all place Ponemah at H-16 despite Star Wars: Smuggler's Guide placing Ponemah near Jakku, which is located in the Colonies at J-13.\nThe Cantonica, Pacara and Vardos systems have all had their placements adjusted by Star Wars Galaxy Map.\nThe following system labels were omitted from the 2022 Star Wars Galaxy Map leaving their exact grid square placement ambiguous: Bardelberan, Beixander, Bernilla, Chibbier, Cuyacan, Davnar, Dwartii, Eroudac, Gerrenthum, Gonda, Ketz, Ketzali, Linasals, Orchis, Oshira, Haneli, Risso, Toledian, Urajab, Vixnix and Xibariz.\nOn page 33, an image of the 614-AvA speeder bike is mistakenly used for the description of the 74-Z speeder bike.\n\n",
        "section": "Continuity[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 356.0
      }
    },
    {
      "id": "1537",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg - Behind the scenes[]\n\nPorgs were designed for the 2017 film Star Wars: Episode VIII The Last Jedi. They were conceived by writer/director Rian Johnson, who created them to digitally cover up the vast numbers of real-life puffins present on Skellig Michael, the filming site for Ahch-To. According to creature concept designer Jake Lunt Davies, Johnson \"was looking at how can he work with [the puffins]. You can't remove them. You physically can't get rid of them. And digitally removing them is an issue and a lot of work, so let's just roll with it, play with it. And so I think he thought, 'Well, that's great, let's have our own indigenous species. Porgs were first revealed in behind-the-scenes footage from The Last Jedi at the D23 Expo in July 2017. They were officially named in a StarWars.com interview with Lucasfilm Story Group creative executive Pablo Hidalgo. Along with fellow Story Group member Leland Chee, Hidalgo rationalized that the birds seen flying on Ahch-To at the end of Star Wars: Episode VII The Force Awakens were also porgs, retroactively establishing that their first appearance was in that film.\n\nDuring the concept stage of The Last Jedi, creature designer Jake Lunt Davies explored a variety of influences, drawing ideas from birds, bats, flying squirrels, and aquatic creatures such as seals, otters, and beavers. The design approved by Johnson was based on a seal combined with a pug, akin to aquatic, flightless penguins. Porgs were created using a variety of effects including puppets and CGI. About fifteen porgs were built, each for a specific moment in the film, a group of painted models, animatronic pieces, and 1 \"hero\" model. The creatures' squawks were made using a manipulation of a combination of recordings of doves, chickens, and turkeys. The recordings were pitched to create the birds' unique sounds. Additionally, Skywalker Sound team member Ren Klyce sampled imitations of a turkey call performed by an intern named Nick Doctor to further develop the sound of the porgs. When ILM created the CG porgs, they took care to match the movements made by on-set puppeteers. Concept art for the film revealed that, in the scene where porgs investigate Skywalker's lightsaber, it was considered that one of them would have activated the weapon just as another was looking down the shaft, killing it.\n\nAt the theme park attraction Star Wars: Galaxy's Edge, porg items are sold at the out-of-universe Creature Stall. Souvenir porg mugs are included with the purchase of a Cliff Dweller at Oga's Cantina.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 574.0
      }
    },
    {
      "id": "1534",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg - Biology and appearance[]\n\nPorgs were a species of non-sentient birds. They were stocky in nature, with two short wings, flat, beakless faces, and two webbed feet. They could also run quite swiftly on the ground and were good at maneuvering into small spaces.\n\nPorgs were sexually dimorphic; males were slightly larger than females, and males also had orange plumage around the eyes. Their eyes had brown irises and black pupils with stereoscopic vision; their telescopic eyes helped them catch fish. Porgs of both sexes were covered in dense feathers, with white coloration on the body and face, and gray to brown on the wings and back. Their coloration gave them strong natural camouflaging abilities. They were much lighter than they looked, thanks to a thick outer layer of waterproof feathers with a fluffy underlayer for warmth, and they favored colder environments.\n\nPorgs apparently understood certain linguistic terms. When they overheard Rey refer to Chewbacca as \"Chewie,\" they mistook it to be the word chewy, leading them to wonder whether Chewbacca would serve as her food.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 240.0
      }
    },
    {
      "id": "1533",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg\n\nPorg\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nAvian\n\n\n\nPhysical characteristics\n\nAverage height\n18 to 26 centimeters\n\n\nFeather color\nBrownGrayWhiteOrange (males)\n\n\nEye color\nBrown\n\n\n\nSociocultural characteristics\n\nHomeworld\nAhch-To\n\n\nHabitat\nCoastal, Islands, Open seas\n\n\nDiet\nFish\n\n\n[Source]\n\nPorgs were a non-sentient species of sea-dwelling beakless bird. They were native to the planet Ahch-To, where Jedi Master Luke Skywalker made his exile in the years prior to the Battle of Crait.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 137.0
      }
    },
    {
      "id": "1535",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg - Behavior[]\n\nThe hypercurious, cliff-dwelling creatures were found throughout the islands of the planet Ahch-To. Their young, called \"porglets,\" were hatched as pairs. Porgs exhibited a roosting behavior and built nests along the island cliffs. They would collect soft things to make nests and were drawn to shiny objects. The nests were made using hair, fiber, or grass, and decorated with shiny objects they had acquired. The mother and father tended to the nest. Porgs were capable of performing controlled dives into the sea, where they fetched fish to feed on or pass on to their otherwise-helpless offspring; they also hunted crustaceans.\n\nPorgs loved water, both to drink and to play in, and they also loved tasting new things. Both wild and domesticated porgs were unusually smitten by human objects. They were also fascinated by shiny objects. If their curiosity ran unchecked, they could wreak havoc. Their calls ranged from burbles to squeaks to song. They crooned a special song when they were pleased. Despite their curious nature, they could be completely silent when necessary and could be shy if they felt threatened. Porgs enjoyed being petted and scratched, especially behind their ears. A group of porgs was called a \"murder.\"\n\n",
        "section": "Behavior[]",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 272.0
      }
    },
    {
      "id": "1651",
      "title": "Mynock",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Articles to be expanded",
          "6 more",
          "Ergovorous creatures",
          "Food creatures",
          "Non-sentient species",
          "Silicon-based creatures",
          "Space-borne creatures",
          "Twi'lek food"
        ],
        "content": "# Mynock - Biology and appearance[]\n\nA species of silicon-based bat-like parasites native to the planet Ord Mynock, Mynocks chewed on the power cables and energy conductors of starships, and could drain a ship's entire power supply. Some said that mynocks could feed on so much energy that they became \"spark-drunk.\" They reproduced by splitting in two and growing new creatures from each half. Mynocks were capable of surviving in the atmospheres of planets and the vacuum of space, though only a few varieties lived on planets. They were also known to inhabit asteroid fields, thriving on asteroids, and the gullets of exogorths, where they shared in its meals and were part of its internal ecosystem. Nevertheless, most exogorths hated having mynocks inside them. Mynocks were remotely related to grallocs and tibidees, large flying creatures native to Stygeon Prime who were also a nuisance to starpilots.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Mynock",
        "title": "Mynock",
        "tokens": 204.0
      }
    },
    {
      "id": "1650",
      "title": "Mynock",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Articles to be expanded",
          "6 more",
          "Ergovorous creatures",
          "Food creatures",
          "Non-sentient species",
          "Silicon-based creatures",
          "Space-borne creatures",
          "Twi'lek food"
        ],
        "content": "# Mynock\n\nMynock\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nParasite\n\n\n\nPhysical characteristics\n\nAverage length\n1.6 to 2 meters\n\n\nAverage mass\n8 kilograms\n\n\nSkin color\nBrownYam\n\n\nEye color\nBlack\n\n\nDistinctions\nSilicon-based, able to survive in a vacuum\n\n\n\nSociocultural characteristics\n\nHomeworld\nOrd Mynock\n\n\nHabitat\nAsteroid fieldsExogorth stomachPlanetoids\n\n\nDiet\nEnergyExogorth's meals\n\n\n[Source]\n\nMynocks (IPA: /ˈmaɪ.nɒk/, Merriam–Webster: \\mīnäk\\) were a bat-like parasitic species that hailed from the world of Ord Mynock. A group of mynocks is called a battery. Even so, they also thrived in asteroids and could survive in realspace, with some even living within exogorths. For sustenance, they could eat the energy supply of starships.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mynock",
        "title": "Mynock",
        "tokens": 216.0
      }
    },
    {
      "id": "1761",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - Biology and appearance[]\n\nWorrts were squat and spiky creatures whose appearance bore similarities to that of chubas. They had brown, warty skin and measured 1.50 meters in height. They were quadrupeds with dexterous forelimbs. A worrt's head featured a pair of sensitive cranial palps, two bulbous eyes that could be yellow in hue, two nostrils, and a large mouth. That mouth contained a purple prehensile tongue, and strong teeth laced with a venom potent enough to kill a bantha. The eyelids of the worrts could keep sand out of their eyes, and their saliva was also capable of jamming a blaster. Worrts lay large amounts of small, soft eggs which were harvested for food and used as ingredients in drinks served at cantinas.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 177.0
      }
    },
    {
      "id": "1763",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - History[]\n\nThe chuba-like worrts lived in the desertic wastes of Tatooine, a suns-scorched planet located in the Outer Rim Territories. They were considered a delicacy by the Tusken Raiders, a nomadic species native to Tatooine. The most notable worrt in the galaxy may have been the one that lived on the road to Jabba the Hutt's Palace in the Dune Sea of Tatooine around the time of the Battle of Endor. Three years later, Han Solo and Lando Calrissian encountered a worrt named Korrg kept by the pilot Taka Jamoreesa. Around thirty years after the Battle of Endor, a Nu-Cosian traveling merchant and storyteller named Bobbajo kept a worrt named J'Rrosch as a pet. A worrt was held in a tank at Oga's Cantina in Batuu's Black Spire, where it laid fresh eggs every day that were used as an ingredient in drinks, such as Jabba Juice and Carbon Freeze.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 219.0
      }
    },
    {
      "id": "1759",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt\n\nWorrt\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nAmphibian\n\n\n\nPhysical characteristics\n\nAverage height\n1.5 meters\n\n\nSkin color\nBrown\n\n\nEye color\nYellow\n\n\nDistinctions\nToothy mouth, purple prehensile tongue dexterous forelimbs, heat-sensitive palps, two cranial antennae\n\n\n\nSociocultural characteristics\n\nHomeworld\nTatooine\n\n\nHabitat\nDesert\n\n\nDiet\nCarnivore\n\n\n[Source]\n\nWorrts were a non-sentient species that hailed from the desert of the planet Tatooine. These squat, large-mouthed creatures caught prey by sitting stationary in the sand and using their purple prehensile tongues to wrap around passing rodents, insects or birds.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 167.0
      }
    },
    {
      "id": "1762",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - Behavior and intelligence[]\n\nWorrts were predatory creatures who lived on desert planets. Worrts fed mostly on insects and rodents. When hungry, a worrt would settle into the sand, becoming indistinguishable from a rocky outcropping, and wait for a prey to pass by it. When its victim came close enough, the predator threw its purple prehensile tongue out of its mouth and wrapped it around the prey. The worrt's prehensile tongue then snapped back, throwing the food down its throat, devouring it whole and belching loud.\n\n",
        "section": "Behavior and intelligence[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 121.0
      }
    },
    {
      "id": "2383",
      "title": "Mynock",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Articles to be expanded",
          "6 more",
          "Ergovorous creatures",
          "Food creatures",
          "Non-sentient species",
          "Silicon-based creatures",
          "Space-borne creatures",
          "Twi'lek food"
        ],
        "content": "# Mynock\n\nMynock\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nParasite\n\n\n\nPhysical characteristics\n\nAverage length\n1.6 to 2 meters\n\n\nAverage mass\n8 kilograms\n\n\nSkin color\nBrownYam\n\n\nEye color\nBlack\n\n\nDistinctions\nSilicon-based, able to survive in a vacuum\n\n\n\nSociocultural characteristics\n\nHomeworld\nOrd Mynock\n\n\nHabitat\nAsteroid fieldsExogorth stomachPlanetoids\n\n\nDiet\nEnergyExogorth's meals\n\n\n[Source]\n\nMynocks (IPA: /ˈmaɪ.nɒk/, Merriam–Webster: \\mīnäk\\) were a bat-like parasitic species that hailed from the world of Ord Mynock. A group of mynocks is called a battery. Even so, they also thrived in asteroids and could survive in realspace, with some even living within exogorths. For sustenance, they could eat the energy supply of starships.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mynock",
        "title": "Mynock",
        "tokens": 216.0
      }
    },
    {
      "id": "2384",
      "title": "Mynock",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Articles to be expanded",
          "6 more",
          "Ergovorous creatures",
          "Food creatures",
          "Non-sentient species",
          "Silicon-based creatures",
          "Space-borne creatures",
          "Twi'lek food"
        ],
        "content": "# Mynock - Biology and appearance[]\n\nA species of silicon-based bat-like parasites native to the planet Ord Mynock, Mynocks chewed on the power cables and energy conductors of starships, and could drain a ship's entire power supply. Some said that mynocks could feed on so much energy that they became \"spark-drunk.\" They reproduced by splitting in two and growing new creatures from each half. Mynocks were capable of surviving in the atmospheres of planets and the vacuum of space, though only a few varieties lived on planets. They were also known to inhabit asteroid fields, thriving on asteroids, and the gullets of exogorths, where they shared in its meals and were part of its internal ecosystem. Nevertheless, most exogorths hated having mynocks inside them. Mynocks were remotely related to grallocs and tibidees, large flying creatures native to Stygeon Prime who were also a nuisance to starpilots.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Mynock",
        "title": "Mynock",
        "tokens": 204.0
      }
    },
    {
      "id": "2552",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - Biology and appearance[]\n\nWorrts were squat and spiky creatures whose appearance bore similarities to that of chubas. They had brown, warty skin and measured 1.50 meters in height. They were quadrupeds with dexterous forelimbs. A worrt's head featured a pair of sensitive cranial palps, two bulbous eyes that could be yellow in hue, two nostrils, and a large mouth. That mouth contained a purple prehensile tongue, and strong teeth laced with a venom potent enough to kill a bantha. The eyelids of the worrts could keep sand out of their eyes, and their saliva was also capable of jamming a blaster. Worrts lay large amounts of small, soft eggs which were harvested for food and used as ingredients in drinks served at cantinas.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 177.0
      }
    },
    {
      "id": "2553",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - Behavior and intelligence[]\n\nWorrts were predatory creatures who lived on desert planets. Worrts fed mostly on insects and rodents. When hungry, a worrt would settle into the sand, becoming indistinguishable from a rocky outcropping, and wait for a prey to pass by it. When its victim came close enough, the predator threw its purple prehensile tongue out of its mouth and wrapped it around the prey. The worrt's prehensile tongue then snapped back, throwing the food down its throat, devouring it whole and belching loud.\n\n",
        "section": "Behavior and intelligence[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 121.0
      }
    },
    {
      "id": "2551",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt\n\nWorrt\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nAmphibian\n\n\n\nPhysical characteristics\n\nAverage height\n1.5 meters\n\n\nSkin color\nBrown\n\n\nEye color\nYellow\n\n\nDistinctions\nToothy mouth, purple prehensile tongue dexterous forelimbs, heat-sensitive palps, two cranial antennae\n\n\n\nSociocultural characteristics\n\nHomeworld\nTatooine\n\n\nHabitat\nDesert\n\n\nDiet\nCarnivore\n\n\n[Source]\n\nWorrts were a non-sentient species that hailed from the desert of the planet Tatooine. These squat, large-mouthed creatures caught prey by sitting stationary in the sand and using their purple prehensile tongues to wrap around passing rodents, insects or birds.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 167.0
      }
    },
    {
      "id": "2554",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - History[]\n\nThe chuba-like worrts lived in the desertic wastes of Tatooine, a suns-scorched planet located in the Outer Rim Territories. They were considered a delicacy by the Tusken Raiders, a nomadic species native to Tatooine. The most notable worrt in the galaxy may have been the one that lived on the road to Jabba the Hutt's Palace in the Dune Sea of Tatooine around the time of the Battle of Endor. Three years later, Han Solo and Lando Calrissian encountered a worrt named Korrg kept by the pilot Taka Jamoreesa. Around thirty years after the Battle of Endor, a Nu-Cosian traveling merchant and storyteller named Bobbajo kept a worrt named J'Rrosch as a pet. A worrt was held in a tank at Oga's Cantina in Batuu's Black Spire, where it laid fresh eggs every day that were used as an ingredient in drinks, such as Jabba Juice and Carbon Freeze.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 219.0
      }
    },
    {
      "id": "2720",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Continuity[]\n\nThe key on the included galaxy map incorrectly lists all locations as \"Planets of the galaxy\" when Jedha, Pantora, Ketz, Bardelberan 7, Beixander 9 and Ajan Kloss are all moons. Jason Fry has clarified the naming conventions on maps collaboratively developed by himself and Lucasfilm to be colloquial system names commonly used in-universe by galactic citizens. He has also noted that the Inner Rim and Colonies are erroneously swapped on the galaxy map.\nStar Wars: Galaxy's Edge: Traveler's Guide to Batuu, Star Wars Droids Guide to a Galaxy Far, Far Away and Star Wars Galaxy Map all place Ponemah at H-16 despite Star Wars: Smuggler's Guide placing Ponemah near Jakku, which is located in the Colonies at J-13.\nThe Cantonica, Pacara and Vardos systems have all had their placements adjusted by Star Wars Galaxy Map.\nThe following system labels were omitted from the 2022 Star Wars Galaxy Map leaving their exact grid square placement ambiguous: Bardelberan, Beixander, Bernilla, Chibbier, Cuyacan, Davnar, Dwartii, Eroudac, Gerrenthum, Gonda, Ketz, Ketzali, Linasals, Orchis, Oshira, Haneli, Risso, Toledian, Urajab, Vixnix and Xibariz.\nOn page 33, an image of the 614-AvA speeder bike is mistakenly used for the description of the 74-Z speeder bike.\n\n",
        "section": "Continuity[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 356.0
      }
    },
    {
      "id": "3153",
      "title": "Mynock",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Articles to be expanded",
          "6 more",
          "Ergovorous creatures",
          "Food creatures",
          "Non-sentient species",
          "Silicon-based creatures",
          "Space-borne creatures",
          "Twi'lek food"
        ],
        "content": "# Mynock - Biology and appearance[]\n\nA species of silicon-based bat-like parasites native to the planet Ord Mynock, Mynocks chewed on the power cables and energy conductors of starships, and could drain a ship's entire power supply. Some said that mynocks could feed on so much energy that they became \"spark-drunk.\" They reproduced by splitting in two and growing new creatures from each half. Mynocks were capable of surviving in the atmospheres of planets and the vacuum of space, though only a few varieties lived on planets. They were also known to inhabit asteroid fields, thriving on asteroids, and the gullets of exogorths, where they shared in its meals and were part of its internal ecosystem. Nevertheless, most exogorths hated having mynocks inside them. Mynocks were remotely related to grallocs and tibidees, large flying creatures native to Stygeon Prime who were also a nuisance to starpilots.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Mynock",
        "title": "Mynock",
        "tokens": 204.0
      }
    },
    {
      "id": "3199",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt\n\nWorrt\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nAmphibian\n\n\n\nPhysical characteristics\n\nAverage height\n1.5 meters\n\n\nSkin color\nBrown\n\n\nEye color\nYellow\n\n\nDistinctions\nToothy mouth, purple prehensile tongue dexterous forelimbs, heat-sensitive palps, two cranial antennae\n\n\n\nSociocultural characteristics\n\nHomeworld\nTatooine\n\n\nHabitat\nDesert\n\n\nDiet\nCarnivore\n\n\n[Source]\n\nWorrts were a non-sentient species that hailed from the desert of the planet Tatooine. These squat, large-mouthed creatures caught prey by sitting stationary in the sand and using their purple prehensile tongues to wrap around passing rodents, insects or birds.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 167.0
      }
    },
    {
      "id": "3151",
      "title": "Mynock",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Articles to be expanded",
          "6 more",
          "Ergovorous creatures",
          "Food creatures",
          "Non-sentient species",
          "Silicon-based creatures",
          "Space-borne creatures",
          "Twi'lek food"
        ],
        "content": "# Mynock\n\nMynock\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nParasite\n\n\n\nPhysical characteristics\n\nAverage length\n1.6 to 2 meters\n\n\nAverage mass\n8 kilograms\n\n\nSkin color\nBrownYam\n\n\nEye color\nBlack\n\n\nDistinctions\nSilicon-based, able to survive in a vacuum\n\n\n\nSociocultural characteristics\n\nHomeworld\nOrd Mynock\n\n\nHabitat\nAsteroid fieldsExogorth stomachPlanetoids\n\n\nDiet\nEnergyExogorth's meals\n\n\n[Source]\n\nMynocks (IPA: /ˈmaɪ.nɒk/, Merriam–Webster: \\mīnäk\\) were a bat-like parasitic species that hailed from the world of Ord Mynock. A group of mynocks is called a battery. Even so, they also thrived in asteroids and could survive in realspace, with some even living within exogorths. For sustenance, they could eat the energy supply of starships.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mynock",
        "title": "Mynock",
        "tokens": 216.0
      }
    },
    {
      "id": "3201",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - Biology and appearance[]\n\nWorrts were squat and spiky creatures whose appearance bore similarities to that of chubas. They had brown, warty skin and measured 1.50 meters in height. They were quadrupeds with dexterous forelimbs. A worrt's head featured a pair of sensitive cranial palps, two bulbous eyes that could be yellow in hue, two nostrils, and a large mouth. That mouth contained a purple prehensile tongue, and strong teeth laced with a venom potent enough to kill a bantha. The eyelids of the worrts could keep sand out of their eyes, and their saliva was also capable of jamming a blaster. Worrts lay large amounts of small, soft eggs which were harvested for food and used as ingredients in drinks served at cantinas.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 177.0
      }
    },
    {
      "id": "3210",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - History[]\n\nThe chuba-like worrts lived in the desertic wastes of Tatooine, a suns-scorched planet located in the Outer Rim Territories. They were considered a delicacy by the Tusken Raiders, a nomadic species native to Tatooine. The most notable worrt in the galaxy may have been the one that lived on the road to Jabba the Hutt's Palace in the Dune Sea of Tatooine around the time of the Battle of Endor. Three years later, Han Solo and Lando Calrissian encountered a worrt named Korrg kept by the pilot Taka Jamoreesa. Around thirty years after the Battle of Endor, a Nu-Cosian traveling merchant and storyteller named Bobbajo kept a worrt named J'Rrosch as a pet. A worrt was held in a tank at Oga's Cantina in Batuu's Black Spire, where it laid fresh eggs every day that were used as an ingredient in drinks, such as Jabba Juice and Carbon Freeze.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 219.0
      }
    },
    {
      "id": "3204",
      "title": "Worrt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Amphibians",
          "3 more",
          "Creatures of Tatooine",
          "Desert creatures",
          "Non-sentient species"
        ],
        "content": "# Worrt - Behavior and intelligence[]\n\nWorrts were predatory creatures who lived on desert planets. Worrts fed mostly on insects and rodents. When hungry, a worrt would settle into the sand, becoming indistinguishable from a rocky outcropping, and wait for a prey to pass by it. When its victim came close enough, the predator threw its purple prehensile tongue out of its mouth and wrapped it around the prey. The worrt's prehensile tongue then snapped back, throwing the food down its throat, devouring it whole and belching loud.\n\n",
        "section": "Behavior and intelligence[]",
        "source": "https://starwars.fandom.com/wiki/Worrt",
        "title": "Worrt",
        "tokens": 121.0
      }
    },
    {
      "id": "3492",
      "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2020 releases",
          "2 more",
          "Canon reference books",
          "Star Wars: Galaxy's Edge"
        ],
        "content": "# Star Wars: Galaxy's Edge: Traveler's Guide to Batuu - Continuity[]\n\nThe key on the included galaxy map incorrectly lists all locations as \"Planets of the galaxy\" when Jedha, Pantora, Ketz, Bardelberan 7, Beixander 9 and Ajan Kloss are all moons. Jason Fry has clarified the naming conventions on maps collaboratively developed by himself and Lucasfilm to be colloquial system names commonly used in-universe by galactic citizens. He has also noted that the Inner Rim and Colonies are erroneously swapped on the galaxy map.\nStar Wars: Galaxy's Edge: Traveler's Guide to Batuu, Star Wars Droids Guide to a Galaxy Far, Far Away and Star Wars Galaxy Map all place Ponemah at H-16 despite Star Wars: Smuggler's Guide placing Ponemah near Jakku, which is located in the Colonies at J-13.\nThe Cantonica, Pacara and Vardos systems have all had their placements adjusted by Star Wars Galaxy Map.\nThe following system labels were omitted from the 2022 Star Wars Galaxy Map leaving their exact grid square placement ambiguous: Bardelberan, Beixander, Bernilla, Chibbier, Cuyacan, Davnar, Dwartii, Eroudac, Gerrenthum, Gonda, Ketz, Ketzali, Linasals, Orchis, Oshira, Haneli, Risso, Toledian, Urajab, Vixnix and Xibariz.\nOn page 33, an image of the 614-AvA speeder bike is mistakenly used for the description of the 74-Z speeder bike.\n\n",
        "section": "Continuity[]",
        "source": "https://starwars.fandom.com/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
        "title": "Star Wars: Galaxy's Edge: Traveler's Guide to Batuu",
        "tokens": 356.0
      }
    },
    {
      "id": "3839",
      "title": "Sentience",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Incomplete lists",
          "2 more",
          "Biological phenomena",
          "Society and culture"
        ],
        "content": "# Sentience - Behavior[]\n\nThe majority of sentient species dwelt on land, where frequent rain sustains lush forests, gardens, and grassy plains, although many species also inhabited dry ecosystems and rocky habitats. These species ability to adapt to survive on these harsher worlds made them better equipped to adapt offworld as well. Certain sentient species preferred to be immersed in liquids, and lived on worlds covered in water but could survive in airy environments without need for any breathing apparatus or environmental suits.\n\n",
        "section": "Behavior[]",
        "source": "https://starwars.fandom.com/wiki/Sentience",
        "title": "Sentience",
        "tokens": 99.0
      }
    },
    {
      "id": "4403",
      "title": "Mimban",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Comprehensive articles",
          "Articles in need of updating",
          "8 more",
          "Articles to be expanded",
          "Locations in grid square O-12",
          "Arboreal planets",
          "Circarpous sector planets",
          "Galactic Empire planets",
          "Nanth'ri Trade Route",
          "Swamp planets",
          "The Slice planets"
        ],
        "content": "# Mimban - Description[]\n\nThe planet Mimban, formally known as Circarpous V, was located in the Circarpous sector of the galaxy's Expansion Region, in grid square O-12 on the Standard Galactic Grid. Located in a remote star system, it was situated along the Nanth'ri Trade Route between the worlds Kerev Doi and Batuv. It had a dense, ionized atmosphere whose thunderstorms made the planet's sky perpetually overcast, while its marshlands were always draped in mist.\n\nA humid world, Mimban's surface was covered in rainforests and swamps. The planet possessed valuable minerals, including deep hyperbaride deposits. The climate began to be devastated from the Confederacy of Independent Systems's indiscriminate mining practices, with a great deal of mud beginning to form on world during the Clone Wars. Mining by the Galactic Empire during the Imperial Era continued to devastate Mimban's climate.\n\n",
        "section": "Description[]",
        "source": "https://starwars.fandom.com/wiki/Mimban",
        "title": "Mimban",
        "tokens": 192.0
      }
    },
    {
      "id": "4430",
      "title": "Mimban",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Comprehensive articles",
          "Articles in need of updating",
          "8 more",
          "Articles to be expanded",
          "Locations in grid square O-12",
          "Arboreal planets",
          "Circarpous sector planets",
          "Galactic Empire planets",
          "Nanth'ri Trade Route",
          "Swamp planets",
          "The Slice planets"
        ],
        "content": "# Mimban - Discrepancies[]\n\nUltimate Star Wars, New Edition stated Mimban was in the Circarpous system of the Expansion Region, while The Rise of Kylo Ren 4 said the Minemoon of Mimban was located in the Mid Rim.\n\n",
        "section": "Discrepancies[]",
        "source": "https://starwars.fandom.com/wiki/Mimban",
        "title": "Mimban",
        "tokens": 56.0
      }
    },
    {
      "id": "4400",
      "title": "Mimban",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Comprehensive articles",
          "Articles in need of updating",
          "8 more",
          "Articles to be expanded",
          "Locations in grid square O-12",
          "Arboreal planets",
          "Circarpous sector planets",
          "Galactic Empire planets",
          "Nanth'ri Trade Route",
          "Swamp planets",
          "The Slice planets"
        ],
        "content": "# Mimban\n\nMimban\n\n\nAstrographical information\n\nRegion\nExpansion RegionThe Slice\n\n\nSector\nCircarpous sector\n\n\nSystem\nCircarpous system\n\n\nMoons\nMinemoon\n\n\nGrid square\nO-12\n\n\nTrade routes\nNanth'ri Trade Route\n\n\n\nPhysical information\n\nAtmosphere\nBreathable\n\n\nClimate\nHumid\n\n\nTerrain\nMud fieldsRainforestsSwamps\n\n\nPoints of interest\nCamp ForwardCamp Forward airfieldNanth flatlandsSouthern MarshlandsStation 3-7\n\n\n\nSocietal information\n\nNative species\nGreenieMimbanese\n\n\nDemonym\nMimbanese\n\n\nMajor exports\nHyperbaride\n\n\nAffiliation\nGalactic Empire\n\n\n[Source]\n\nMimban, formally known as Circarpous V, was a swamp planet located in the Circarpous sector of the galaxy's Expansion Region. Situated along the Nanth'ri Trade Route, it was the homeworld of several intelligent species, including the Mimbanese. For many decades, Mimban was the site of conflict between its natives and mining interests attracted by the planet's deep hyperbaride mineral deposits.\n\nDuring the Clone Wars, the Mud Jumpers of the Grand Army of the Republic's 224th Division helped the Mimbanese Liberation Army repel the invading Separatist Droid Army. Following the rise of the Galactic Empire, the 224th returned to Mimban as part of the Imperial Army to subjugate the Mimbanese and ensure Imperial energy mining operations continued unabated, which put them into conflict with their erstwhile allies.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mimban",
        "title": "Mimban",
        "tokens": 327.0
      }
    },
    {
      "id": "4416",
      "title": "Mimban",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia former Comprehensive articles",
          "Articles in need of updating",
          "8 more",
          "Articles to be expanded",
          "Locations in grid square O-12",
          "Arboreal planets",
          "Circarpous sector planets",
          "Galactic Empire planets",
          "Nanth'ri Trade Route",
          "Swamp planets",
          "The Slice planets"
        ],
        "content": "# Mimban - Development[]\n\nMimban was first mentioned in the new Star Wars canon in \"Rookies,\" the fifth episode of the animated series Star Wars: The Clone Wars' first season, which originally aired on October 24, 2008. Originally created as the Bog Planet in the earliest scripts of the 1977 film Star Wars: Episode IV A New Hope, it first appeared in Splinter of the Mind's Eye, a 1978 Star Wars Legends novel written by Alan Dean Foster. Concepts for Mimban were later reused for Dagobah in the 1980 film Star Wars: Episode V The Empire Strikes Back.\n\nEarly concept art for Rogue One: A Star Wars Story used Mimban as a setting, before Jedha was developed to replace it. The planet appeared in the 2018 film Solo: A Star Wars Story. For a time in the movie's production, it was considered to make Mimban a planet with an aquatic, swamp-like surface. According to script writer Jon Kasdan, the film's crew wanted to evoke Stanley Kubrick's 1957 anti-war film Paths of Glory and put Han Solo into the most hellish-possible war environment.\n\n",
        "section": "Development[]",
        "source": "https://starwars.fandom.com/wiki/Mimban",
        "title": "Mimban",
        "tokens": 242.0
      }
    },
    {
      "id": "4700",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg\n\nPorg\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nAvian\n\n\n\nPhysical characteristics\n\nAverage height\n18 to 26 centimeters\n\n\nFeather color\nBrownGrayWhiteOrange (males)\n\n\nEye color\nBrown\n\n\n\nSociocultural characteristics\n\nHomeworld\nAhch-To\n\n\nHabitat\nCoastal, Islands, Open seas\n\n\nDiet\nFish\n\n\n[Source]\n\nPorgs were a non-sentient species of sea-dwelling beakless bird. They were native to the planet Ahch-To, where Jedi Master Luke Skywalker made his exile in the years prior to the Battle of Crait.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 137.0
      }
    },
    {
      "id": "4709",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg - Behind the scenes[]\n\nPorgs were designed for the 2017 film Star Wars: Episode VIII The Last Jedi. They were conceived by writer/director Rian Johnson, who created them to digitally cover up the vast numbers of real-life puffins present on Skellig Michael, the filming site for Ahch-To. According to creature concept designer Jake Lunt Davies, Johnson \"was looking at how can he work with [the puffins]. You can't remove them. You physically can't get rid of them. And digitally removing them is an issue and a lot of work, so let's just roll with it, play with it. And so I think he thought, 'Well, that's great, let's have our own indigenous species. Porgs were first revealed in behind-the-scenes footage from The Last Jedi at the D23 Expo in July 2017. They were officially named in a StarWars.com interview with Lucasfilm Story Group creative executive Pablo Hidalgo. Along with fellow Story Group member Leland Chee, Hidalgo rationalized that the birds seen flying on Ahch-To at the end of Star Wars: Episode VII The Force Awakens were also porgs, retroactively establishing that their first appearance was in that film.\n\nDuring the concept stage of The Last Jedi, creature designer Jake Lunt Davies explored a variety of influences, drawing ideas from birds, bats, flying squirrels, and aquatic creatures such as seals, otters, and beavers. The design approved by Johnson was based on a seal combined with a pug, akin to aquatic, flightless penguins. Porgs were created using a variety of effects including puppets and CGI. About fifteen porgs were built, each for a specific moment in the film, a group of painted models, animatronic pieces, and 1 \"hero\" model. The creatures' squawks were made using a manipulation of a combination of recordings of doves, chickens, and turkeys. The recordings were pitched to create the birds' unique sounds. Additionally, Skywalker Sound team member Ren Klyce sampled imitations of a turkey call performed by an intern named Nick Doctor to further develop the sound of the porgs. When ILM created the CG porgs, they took care to match the movements made by on-set puppeteers. Concept art for the film revealed that, in the scene where porgs investigate Skywalker's lightsaber, it was considered that one of them would have activated the weapon just as another was looking down the shaft, killing it.\n\nAt the theme park attraction Star Wars: Galaxy's Edge, porg items are sold at the out-of-universe Creature Stall. Souvenir porg mugs are included with the purchase of a Cliff Dweller at Oga's Cantina.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 574.0
      }
    },
    {
      "id": "4702",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg - Biology and appearance[]\n\nPorgs were a species of non-sentient birds. They were stocky in nature, with two short wings, flat, beakless faces, and two webbed feet. They could also run quite swiftly on the ground and were good at maneuvering into small spaces.\n\nPorgs were sexually dimorphic; males were slightly larger than females, and males also had orange plumage around the eyes. Their eyes had brown irises and black pupils with stereoscopic vision; their telescopic eyes helped them catch fish. Porgs of both sexes were covered in dense feathers, with white coloration on the body and face, and gray to brown on the wings and back. Their coloration gave them strong natural camouflaging abilities. They were much lighter than they looked, thanks to a thick outer layer of waterproof feathers with a fluffy underlayer for warmth, and they favored colder environments.\n\nPorgs apparently understood certain linguistic terms. When they overheard Rey refer to Chewbacca as \"Chewie,\" they mistook it to be the word chewy, leading them to wonder whether Chewbacca would serve as her food.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 240.0
      }
    },
    {
      "id": "4704",
      "title": "Porg",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Birds",
          "3 more",
          "Creatures of Ahch-To",
          "Food creatures",
          "Non-sentient species"
        ],
        "content": "# Porg - Behavior[]\n\nThe hypercurious, cliff-dwelling creatures were found throughout the islands of the planet Ahch-To. Their young, called \"porglets,\" were hatched as pairs. Porgs exhibited a roosting behavior and built nests along the island cliffs. They would collect soft things to make nests and were drawn to shiny objects. The nests were made using hair, fiber, or grass, and decorated with shiny objects they had acquired. The mother and father tended to the nest. Porgs were capable of performing controlled dives into the sea, where they fetched fish to feed on or pass on to their otherwise-helpless offspring; they also hunted crustaceans.\n\nPorgs loved water, both to drink and to play in, and they also loved tasting new things. Both wild and domesticated porgs were unusually smitten by human objects. They were also fascinated by shiny objects. If their curiosity ran unchecked, they could wreak havoc. Their calls ranged from burbles to squeaks to song. They crooned a special song when they were pleased. Despite their curious nature, they could be completely silent when necessary and could be shy if they felt threatened. Porgs enjoyed being petted and scratched, especially behind their ears. A group of porgs was called a \"murder.\"\n\n",
        "section": "Behavior[]",
        "source": "https://starwars.fandom.com/wiki/Porg",
        "title": "Porg",
        "tokens": 272.0
      }
    },
    {
      "id": "5822",
      "title": "Besalisk",
      "metadata": {
        "categories": [
          "Legends articles",
          "Deep Core species"
        ],
        "content": "# Besalisk - Behind the scenes[]\n\nIn a picture in the Ultimate Alien Anthology Besalisks are depicted as somewhat short for their species, approximating only 1.6 meters.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Besalisk/Legends",
        "title": "Besalisk",
        "tokens": 40.0
      }
    },
    {
      "id": "5810",
      "title": "Besalisk",
      "metadata": {
        "categories": [
          "Legends articles",
          "Deep Core species"
        ],
        "content": "# Besalisk - Biology and appearance[]\n\nMale Besalisks' heads sported prominent crests and four arms hung at their sides; females of the species could have as many as eight arms, but like Humans had a primary hand and a limited range of functionality with the others. The addition of the extra appendages required a hearty metabolism, and these bulky beings were able to store food and water for many days, and if the need arose, they could survive for long periods without either. Scruffy sensory whiskers lined the area below their noses, just above the robust wattle most adult Besalisks possessed.\n\nA monogamous species, Besalisks chose a mate for life and often bore one or two eggs. Mating rituals were violent and highly competitive, taking place during the warmer months at specified conclaves. Besalisks were hatched from eggs, carried by the females which laid their young during warm seasons. Before the eggs hatched, a male Besalisk would store the egg close to their body under a large brood patch in his abdominal skin. Because of the chill of Ojom, Besaliks were equipped to survive in harsh conditions, causing them to sweat profusely when on planets with a warmer climate.\n\nChatty, quick to form lasting friendships and lovers of adventure, Besalisks often were fearless and sought thrills without care for themselves. This often caused trouble amongst their employers; Besalisks were known to walk off the job when bored with it and never return. When Besalisks did take jobs in the underworld, they were prone to gossiping and being loose-lipped. This unfortunate habit led to members of the species attracting more bounties than any other.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Besalisk/Legends",
        "title": "Besalisk",
        "tokens": 347.0
      }
    },
    {
      "id": "5807",
      "title": "Besalisk",
      "metadata": {
        "categories": [
          "Legends articles",
          "Deep Core species"
        ],
        "content": "# Besalisk\n\nBesalisk\n\n\nBiological classification\n\nDesignation\nSentient\n\n\n\nPhysical characteristics\n\nAverage height\n1.78–1.8 meters\n\n\nSkin color\nBrown\n\n\nFeather color\nBlack\n\n\nDistinctions\nFour arms (males)Up to eight arms (females)\n\n\nAverage lifespan\nChild: 1-8Young adult: 9-12Adult: 13-48Middle Age: 49-60Old: 61-74Venerable: 75+\n\n\n\nSociocultural characteristics\n\nHomeworld\nOjom\n\n\nLanguage\nBesaliskGalactic Basic Standard\n\n\n[Source]\n\nBesalisks were a race of multi-armed sentient humanoids from the cold ocean world of Ojom.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Besalisk/Legends",
        "title": "Besalisk",
        "tokens": 152.0
      }
    },
    {
      "id": "7280",
      "title": "Mythosaur",
      "metadata": {
        "categories": [
          "Canon articles",
          "Semi-protected pages",
          "Articles in need of updating",
          "7 more",
          "Incomplete lists",
          "Creatures of Mandalore",
          "Creatures of unspecified biology",
          "Creatures of unspecified diet",
          "Domesticated creatures",
          "Mandalorian culture",
          "Non-sentient species"
        ],
        "content": "# Mythosaur - Mythosaurs in the galaxy\n\nThe Mines of Mandalore were once a mythosaur lair. Mandalore the Great is said to have tamed the mythical beast. By the time of the New Republic, they were considered extinct, but a mythosaur resided in the Living Waters beneath the Mines of Mandalore in the ruins of the Civic Center of Sundari.\n\nA mythosaur skull hung from one of the walls in Dok-Ondar's Den of Antiquities in Black Spire Outpost, Batuu.\n\n",
        "section": "Mythosaurs in the galaxy",
        "source": "https://starwars.fandom.com/wiki/Mythosaur",
        "title": "Mythosaur",
        "tokens": 108.0
      }
    },
    {
      "id": "7278",
      "title": "Mythosaur",
      "metadata": {
        "categories": [
          "Canon articles",
          "Semi-protected pages",
          "Articles in need of updating",
          "7 more",
          "Incomplete lists",
          "Creatures of Mandalore",
          "Creatures of unspecified biology",
          "Creatures of unspecified diet",
          "Domesticated creatures",
          "Mandalorian culture",
          "Non-sentient species"
        ],
        "content": "# Mythosaur - Early history\n\nThe mythosaurs were found on the Outer Rim world of Mandalore, and had a lair in its mines. Legends tell that long before the Mandalorians had established themselves on Mandalore, the mythosaurs ruled the planet. They were allegedly tamed and ridden by Mandalore the Great and ancient Mandalorians. Some stories claimed that the Mandalorians tamed the beasts, other tales suggested the even greater feat that the Mandalorians rode the beasts while they where wild and free. Long before the Mandalorian cataclysm, they were believed to have become extinct, though at least one mythosaur survived.\n\nThough considered extinct, its memory lived on in the mythosaur skull emblem, one of the traditional symbols of Mandalorian iconography, with some Mandalorian armor bearing the distinctive symbol. The creature shared its name with the mythosaur axe, a melee weapon used by the Mandalorians. One of these was owned by Vera Beroya and her father.\n\n",
        "section": "Early history",
        "source": "https://starwars.fandom.com/wiki/Mythosaur",
        "title": "Mythosaur",
        "tokens": 201.0
      }
    },
    {
      "id": "7279",
      "title": "Mythosaur",
      "metadata": {
        "categories": [
          "Canon articles",
          "Semi-protected pages",
          "Articles in need of updating",
          "7 more",
          "Incomplete lists",
          "Creatures of Mandalore",
          "Creatures of unspecified biology",
          "Creatures of unspecified diet",
          "Domesticated creatures",
          "Mandalorian culture",
          "Non-sentient species"
        ],
        "content": "# Mythosaur - Time of the New Republic\n\nIn 9 ABY, the Ugnaught Kuiil was training the Mandalorian bounty hunter Din Djarin to ride blurrgs on the planet Arvala-7 and scolded him when he tried to give up, reminding him of the fact that his ancestors rode mythosaurs and that blurrgs were easier to ride.\n\nBy the reign of the New Republic, songs of eons past in the Mandalorian culture foretold of the mythosaur rising up to herald a new age of the Mandalorian culture. Indeed, Lady Bo-Katan Kryze discovered one still alive in the Living Waters in the Mines of Mandalore beneath Sundari's ruins while rescuing Din Djarin from drowning after he fell into its depths. Afterwards, she concealed the fact she had seen the mythosaur from Djarin. She later asked the Armorer to inlay the symbol of the mythosaur on her new pauldron instead of another Nite Owl. When she told the Armorer that she had encountered the mythosaur, the Armorer elected to view it as a noble vision, replying that those who walk the Way see many visions.\n\nHowever, she soon took Kryze's claim as evidence of the new age foretold in songs. After the reconquest of Mandalore from Gideon's Imperial remnant, the Mythosaur remained alive, still living within the Living Waters.\n\n",
        "section": "Time of the New Republic",
        "source": "https://starwars.fandom.com/wiki/Mythosaur",
        "title": "Mythosaur",
        "tokens": 295.0
      }
    },
    {
      "id": "7276",
      "title": "Mythosaur",
      "metadata": {
        "categories": [
          "Canon articles",
          "Semi-protected pages",
          "Articles in need of updating",
          "7 more",
          "Incomplete lists",
          "Creatures of Mandalore",
          "Creatures of unspecified biology",
          "Creatures of unspecified diet",
          "Domesticated creatures",
          "Mandalorian culture",
          "Non-sentient species"
        ],
        "content": "# Mythosaur - Biology and appearance\n\nMythosaurs were sea beasts of gigantic proportions; they could grow to be more than 30 meters (100 feet) in length. Mythosaurs had yellowish scaly skin with black eyes and bore two large horns on the side of their mouth. They could survive both on land and underwater. Mythosaurs used their sharp tusks to fight competitors or possibly to catch prey. There are many questions regarding the biology of the mythosaur: was it lumbering as the apex predator in its environment, or was it fast and agile?\n\n",
        "section": "Biology and appearance",
        "source": "https://starwars.fandom.com/wiki/Mythosaur",
        "title": "Mythosaur",
        "tokens": 114.0
      }
    },
    {
      "id": "7273",
      "title": "Mythosaur",
      "metadata": {
        "categories": [
          "Canon articles",
          "Semi-protected pages",
          "Articles in need of updating",
          "7 more",
          "Incomplete lists",
          "Creatures of Mandalore",
          "Creatures of unspecified biology",
          "Creatures of unspecified diet",
          "Domesticated creatures",
          "Mandalorian culture",
          "Non-sentient species"
        ],
        "content": "# Mythosaur\n\nMythosaur\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\n\nPhysical characteristics\n\nAverage length\n30 meters (100 ft)\n\n\nSkin color\nYellow\n\n\nEye color\nBlack\n\n\nDistinctions\nGigantic proportions\n\n\n\nSociocultural characteristics\n\nHomeworld\nMandalore\n\n\nHabitat\nMines of MandaloreUnderwater inside the Living Waters lake\n\n\nDiet\nOmnivore\n\n\n[Source]\n\nMythosaurs were creatures of gigantic proportions found on the Outer Rim world of Mandalore. The Mines of Mandalore were a mythosaur lair. They were allegedly tamed and ridden by Mandalore the Great and ancient Mandalorians, but they were believed to have gone extinct long before the Mandalorian cataclysm, although at least one mythosaur survived and lived in the Living Waters during the time of the New Republic. Its skull was one of the traditional symbols of Mandalorian iconography, and some Mandalorian armor bore the distinctive symbol.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Mythosaur",
        "title": "Mythosaur",
        "tokens": 201.0
      }
    },
    {
      "id": "7620",
      "title": "Unidentified Weequay 2 (Balnab)",
      "metadata": {
        "categories": [
          "Legends articles",
          "Articles with conjectural titles",
          "Pages needing citation",
          "4 more",
          "Character stubs",
          "Males",
          "Pirates",
          "Weequays"
        ],
        "content": "# Unidentified Weequay 2 (Balnab)\n\nUnidentified Weequay\n\n\nBiographical information\n\nHomeworld\nSriluur\n\n\nDied\nc. 21 BBY\n\n\n\nDescriptive information\n\nSpecies\nWeequay\n\n\nGender\nMale\n\n\nEye color\nBlack\n\n\nSkin color\nBrown\n\n\n[Source]\n\nA Weequay was a pirate and a crew member of a Weequay pirate ship, the Marauder.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Unidentified_Weequay_2_%28Balnab%29",
        "title": "Unidentified Weequay 2 (Balnab)",
        "tokens": 91.0
      }
    },
    {
      "id": "7899",
      "title": "Ithor",
      "metadata": {
        "categories": [
          "Legends articles",
          "Pages needing citation",
          "Locations in grid square M-6",
          "10 more",
          "Darth Krayt's Galactic Empire planets",
          "Devastated planets",
          "Galactic Alliance planets",
          "Galactic Empire planets",
          "Galactic Republic planets",
          "Jungle planets",
          "Lesser Plooriod Cluster planets",
          "New Republic planets",
          "Ottega system planets",
          "Spice producing worlds"
        ],
        "content": "# Ithor - Flora[]\n\nToal\nIndyup tree\nDonar flower\nBull-fern\nBafforr tree\n\nThe bafforr tree was considered semi-sentient and possessed telepathic capabilities and acted as a sort of distributed intellect - the larger the forest was, the higher the collective intellect.\n\n",
        "section": "Flora[]",
        "source": "https://starwars.fandom.com/wiki/Ithor/Legends",
        "title": "Ithor",
        "tokens": 68.0
      }
    },
    {
      "id": "7987",
      "title": "Bith",
      "metadata": {
        "categories": [
          "Legends articles",
          "Outer Rim Territories species"
        ],
        "content": "# Bith\n\nBith\n\n\nBiological classification\n\nDesignation\nSentient\n\n\nClassification\nCraniopod\n\n\nSubspecies\nMainstream BithAalagarY'bith\n\n\n\nPhysical characteristics\n\nAverage height\n1.5 - 1.75 meters\n\n\nSkin color\nGreenPale pinkRedYellow\n\n\nEye color\nBlack\n\n\nDistinctions\nLarge craniumAcute senses of smell and hearing\n\n\nAverage lifespan\nChild: 1-11Young adult: 12-15Adult: 16-50Middle age: 51-70Old: 71-84Venerable: 85+\n\n\n\nSociocultural characteristics\n\nHomeworld\nClak'dor VII\n\n\nLanguage\nBith\n\n\n[Source]\n\nBith were a peaceful, highly evolved craniopod species native to the planet Clak'dor VII. Fully adapted to a civilized, high-technology lifestyle, Bith were found galaxy-wide at all levels of society, most notably as engineers, scientists, intellectuals, consultants, and musicians.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Bith/Legends",
        "title": "Bith",
        "tokens": 208.0
      }
    },
    {
      "id": "7989",
      "title": "Bith",
      "metadata": {
        "categories": [
          "Legends articles",
          "Outer Rim Territories species"
        ],
        "content": "# Bith - Biology and appearance[]\n\nBith were craniopods with pale pink, red, yellow, or (rarely) green skin, large heads, large lidless eyes, toeless feet, and long fingers with large finger pads and crosshatched fingerprints. Their thumb and small finger were both fully opposable. The Bith's internal systems were different from most humanoids, as the Bith had only one lung, and exhaled through their skin. Bith also lacked a proper nose, instead having highly sensitive olfactory organs hidden in the skin flaps of their cheeks.\n\nThe other Bith senses were also acute. Bith could sense the tonal qualities of sound as well as other races sensed colors. Their eyes, as big as a Menahuun's, were able to focus to 0.07 on the Gandok Scale, and they could see microscopic details of nearby objects, but were extremely nearsighted as a result. An interesting side effect of their incredible sensors was the effect of sonic grenades, or screamers, on them. It was described as causing their heads to explode. Similarly, Bith had high manual dexterity, which helped them manipulate fine tools, though their prowess with gross motor skills was only average.\n\nBith had evolved past the need for sleep. Instead, they would slip into a light meditative trance, which allowed them to get as much rest in four hours as other species could get in eight. During this trance, Bith were still almost fully aware of their surroundings.\n\nA Bith's reproductive organs atrophied over time, as did the portions of their brain governing such impulses. As such, Bith were unable to reproduce naturally, instead relying on artificial conception and gestation. Mates brought genetic material to a Computer Mating Service for analysis against prospective mates. Bith children were created from genetic material from two parents, which was combined, fertilized, and incubated for a year.\n\n",
        "section": "Biology and appearance[]",
        "source": "https://starwars.fandom.com/wiki/Bith/Legends",
        "title": "Bith",
        "tokens": 399.0
      }
    },
    {
      "id": "7903",
      "title": "Ithor",
      "metadata": {
        "categories": [
          "Legends articles",
          "Pages needing citation",
          "Locations in grid square M-6",
          "10 more",
          "Darth Krayt's Galactic Empire planets",
          "Devastated planets",
          "Galactic Alliance planets",
          "Galactic Empire planets",
          "Galactic Republic planets",
          "Jungle planets",
          "Lesser Plooriod Cluster planets",
          "New Republic planets",
          "Ottega system planets",
          "Spice producing worlds"
        ],
        "content": "# Ithor - Behind the scenes[]\n\nThe PC game Star Wars: Rebellion mistakenly places Ithor in the Calaron sector of the Outer Rim.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/Ithor/Legends",
        "title": "Ithor",
        "tokens": 32.0
      }
    },
    {
      "id": "8522",
      "title": "Unidentified Weequay (Balnab)",
      "metadata": {
        "categories": [
          "Legends articles",
          "Articles with conjectural titles",
          "Pages needing citation",
          "4 more",
          "Character stubs",
          "Males",
          "Pirates",
          "Weequays"
        ],
        "content": "# Unidentified Weequay (Balnab)\n\nUnidentified Weequay\n\n\nBiographical information\n\nDied\nc. 21 BBY\n\n\n\nDescriptive information\n\nSpecies\nWeequay\n\n\nGender\nMale\n\n\nEye color\nBlack\n\n\nSkin color\nBrown\n\n\n[Source]\n\nA Weequay was a pirate and a crew member of a Weequay pirate ship, the Marauder.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Unidentified_Weequay_%28Balnab%29",
        "title": "Unidentified Weequay (Balnab)",
        "tokens": 82.0
      }
    },
    {
      "id": "9131",
      "title": "Gene",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles needing additional sources",
          "Science stubs",
          "Biology"
        ],
        "content": "# Gene\n\nA gene was a component of genetic material. Arkanians were masters of genetic technology and bioengineering, which they used to breed sentient life. They created genetic offshoots of themselves that lived brief lives in servitude to pure-blooded \"true Arkanian\" masters. Arkanians also created the Quermian species, a genetic offshoot of the Xexto named for Quermia, the planet they were settled on.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Gene",
        "title": "Gene",
        "tokens": 92.0
      }
    },
    {
      "id": "9146",
      "title": "Gene",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles needing additional sources",
          "Science stubs",
          "Biology"
        ],
        "content": "# Gene\n\nA gene was a component of genetic material. Arkanians were masters of genetic technology and bioengineering, which they used to breed sentient life. They created genetic offshoots of themselves that lived brief lives in servitude to pure-blooded \"true Arkanian\" masters. Arkanians also created the Quermian species, a genetic offshoot of the Xexto named for Quermia, the planet they were settled on.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Gene",
        "title": "Gene",
        "tokens": 92.0
      }
    },
    {
      "id": "9395",
      "title": "Gene",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles needing additional sources",
          "Science stubs",
          "Biology"
        ],
        "content": "# Gene\n\nA gene was a component of genetic material. Arkanians were masters of genetic technology and bioengineering, which they used to breed sentient life. They created genetic offshoots of themselves that lived brief lives in servitude to pure-blooded \"true Arkanian\" masters. Arkanians also created the Quermian species, a genetic offshoot of the Xexto named for Quermia, the planet they were settled on.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Gene",
        "title": "Gene",
        "tokens": 92.0
      }
    },
    {
      "id": "9885",
      "title": "Eskrat",
      "metadata": {
        "categories": [
          "Canon articles",
          "Rats",
          "Species of undefined sentience"
        ],
        "content": "# Eskrat\n\nEskrat\n\n\nPhysical characteristics\n\nDistinctions\nRun around a lot\n\n\n[Source]\n\nEskrats were a species of rat that ran around a lot. The demolitions expert Skelly compared the pilot Kanan Jarrus and the miners of the Moonglow Polychemical company to eskrats after Jarrus showed no interest in hearing about a potential mining hazard.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Eskrat",
        "title": "Eskrat",
        "tokens": 80.0
      }
    },
    {
      "id": "9860",
      "title": "River Qwewt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Creature stubs",
          "4 more",
          "Creatures of Tenoo",
          "Creatures of Yamradi",
          "Lizards",
          "Non-sentient species"
        ],
        "content": "# River Qwewt\n\nRiver Qwewt\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nReptilian\n\n\n\nPhysical characteristics\n\nSkin color\nGreen\n\n\nEye color\nBlack\n\n\nDistinctions\nLeaf-like antennaeWide head\n\n\n\nSociocultural characteristics\n\nHomeworld\nTenooYamradi\n\n\nHabitat\nForests\n\n\n[Source]\n\n\nThe River Qwewt was a reptilian found on the forest planets Tenoo and Yamradi. They lived near bodies of water and resembled a gecko.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/River_Qwewt",
        "title": "River Qwewt",
        "tokens": 112.0
      }
    },
    {
      "id": "9865",
      "title": "River Qwewt",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles in need of updating",
          "Creature stubs",
          "4 more",
          "Creatures of Tenoo",
          "Creatures of Yamradi",
          "Lizards",
          "Non-sentient species"
        ],
        "content": "# River Qwewt\n\nRiver Qwewt\n\n\nBiological classification\n\nDesignation\nNon-sentient\n\n\nClassification\nReptilian\n\n\n\nPhysical characteristics\n\nSkin color\nGreen\n\n\nEye color\nBlack\n\n\nDistinctions\nLeaf-like antennaeWide head\n\n\n\nSociocultural characteristics\n\nHomeworld\nTenooYamradi\n\n\nHabitat\nForests\n\n\n[Source]\n\n\nThe River Qwewt was a reptilian found on the forest planets Tenoo and Yamradi. They lived near bodies of water and resembled a gecko.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/River_Qwewt",
        "title": "River Qwewt",
        "tokens": 112.0
      }
    },
    {
      "id": "9893",
      "title": "Eskrat",
      "metadata": {
        "categories": [
          "Canon articles",
          "Rats",
          "Species of undefined sentience"
        ],
        "content": "# Eskrat\n\nEskrat\n\n\nPhysical characteristics\n\nDistinctions\nRun around a lot\n\n\n[Source]\n\nEskrats were a species of rat that ran around a lot. The demolitions expert Skelly compared the pilot Kanan Jarrus and the miners of the Moonglow Polychemical company to eskrats after Jarrus showed no interest in hearing about a potential mining hazard.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Eskrat",
        "title": "Eskrat",
        "tokens": 80.0
      }
    },
    {
      "id": "9981",
      "title": "Flotation vest",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Lanai culture"
        ],
        "content": "# Flotation vest\n\nFlotation vest\n\n\nProduction information\n\nType\nVest\n\n\nCulture\nLanai\n\n\nOwners\nAuk-Waimanu\n\n\n\nPhysical and technical specifications\n\nColor\nBrown\n\n\nMaterial(s)\nVacullacle shells\n\n\n[Source]\n\n\nA flotation vest was a type of clothing. The Visitor Auk-Waimanu wore a flotation vest made of vacullacle shells.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Flotation_vest",
        "title": "Flotation vest",
        "tokens": 80.0
      }
    },
    {
      "id": "9997",
      "title": "Flotation vest",
      "metadata": {
        "categories": [
          "Canon articles",
          "Stubs",
          "Lanai culture"
        ],
        "content": "# Flotation vest\n\nFlotation vest\n\n\nProduction information\n\nType\nVest\n\n\nCulture\nLanai\n\n\nOwners\nAuk-Waimanu\n\n\n\nPhysical and technical specifications\n\nColor\nBrown\n\n\nMaterial(s)\nVacullacle shells\n\n\n[Source]\n\n\nA flotation vest was a type of clothing. The Visitor Auk-Waimanu wore a flotation vest made of vacullacle shells.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Flotation_vest",
        "title": "Flotation vest",
        "tokens": 80.0
      }
    }
  ]
}