{
  "cluster_id": 38,
  "size": 37,
  "vectors": [
    {
      "id": "1200",
      "title": "The High Republic: Tempest Runner (script)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2022 releases",
          "3 more",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Script books"
        ],
        "content": "# The High Republic: Tempest Runner (script) - Publisher's summary[]\n\nDelve into the cutthroat world of one of the High Republic's greatest foes, the merciless Lourna Dee, in this full script for the Star Wars audio original Tempest Runner.\n\nThe Nihil storm has raged through the galaxy, leaving chaos and grief in its wake. Few of its raiders are as vicious as the Tempest Runner Lourna Dee. She stays one step ahead of the Jedi Order at the helm of a vessel named after one of the deadliest monsters in the galaxy: the Lourna Dee. But no one can outrun the defenders of the High Republic forever.\n\nAfter the defeat of her crew, Lourna falls into the hands of the Jedi–but not before she hides her identity, becoming just another Nihil convict. Her captors fail to understand the beast they have cornered. Just like every fool she's ever buried, their first mistake was keeping her alive.\n\nLourna is determined to make underestimating her their last.\n\nLocked onto a Republic correctional ship, she's dragged across the galaxy to repair the very damage she and her fellow Tempest Runners inflicted on it. But as Lourna plans her glorious escape, she makes alliances that grow dangerously close to friendships. Outside the Nihil—separated from her infamous ship, her terrifying arsenal, and her feared name—Lourna must carve her own path. But will it lead to redemption? Or will she emerge as a deadlier threat than ever before?\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/The_High_Republic:_Tempest_Runner_%28script%29",
        "title": "The High Republic: Tempest Runner (script)",
        "tokens": 316.0
      }
    },
    {
      "id": "1475",
      "title": "Flying attack droid",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Good articles",
          "Droid models"
        ],
        "content": "# Flying attack droid - History[]\n\nAround 9 ABY, the merchant Tuut Orial sold flying attack droids from a cart full of them on the pirate-infested asteroid Port Borgo, demonstrating the droids' abilities to those that passed by. The merchant called the droids a bargain and advertised them as lethal assassins with fascinating weaponry and novel toxins. During one demonstration, Orial threw a piece of fruit up into the air for a droid to slice in half.\n\nAn Aqualish observer then poked one of the demonstration droids, which responded by poking the Aqualish in the eye. One of the droids then began pursuing the watching child KB, who backed away from it into her friend Fern, after which the droid stopped following her. When a group of pirates later surrounded KB, Fern, and their friends Wim and Neel with the intent to rob them, the droid SM-33 came to their defense. SM-33 punched the pirate Vane into a stand by Orial's attack droid stall, attracting the attention of a trio of the flying attack droids, one of whom flew at SM-33 with its saw active. SM-33 then punched the attack droid out of the air.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Flying_attack_droid",
        "title": "Flying attack droid",
        "tokens": 256.0
      }
    },
    {
      "id": "2692",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Description[]\n\nThe numerals were completely different from regular Aurebesh numbers, using an alternate numerical system based on dots and lines.\n\n",
        "section": "Description[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 35.0
      }
    },
    {
      "id": "2690",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals\n\nUnidentified Aurebesh numerals\n\n\n\nUsers\nFirst OrderGalactic EmpireImperial SenateKorfé Bennux-AiNew RepublicTak RennodTech\n\n\nLocations\nAt AchrannAt AttinCoruscantDaiyuKesselLothalNevarroNurPlazir-15\n\n\n[Source]\n\nAn alternate form of Aurebesh numerals was used in the galaxy. Completely different from regular Aurebesh, the numbers were used on At Achrann, At Attin, Coruscant, Daiyu, Kessel, Lothal, Nevarro, Nur and Plazir-15; on credit chips and in Tech's visor; by the Galactic Empire and their senate, and the New Republic; on the console of the Razor Crest, on a monitor in the Providence and Ahsoka Tano's shuttle, on the Eye of Sion's special galactic coordinates calculation monitors, on the cockpit monitor of the Onyx Cinder, in the rank insignia of the First Order, and in the Star Yacht Libertine's databank.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 229.0
      }
    },
    {
      "id": "2696",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Imperial Era[]\n\nAfter the Clone Wars ended, the numbers were used on monitors in the repulsorpods in the Imperial Senate, although regular Aurebesh numbers were also in use.\n\nAlso during this time period, Clone Force 99 member Tech wore a special visor that could be used to scan his surroundings. When used in Cid's mine, the scan resulted in \"IPSIUM DETECTED\", followed by a list of alternate numerals.\n\nA set of credit chips in a case that Omega handed to Lanse Crowder as payment for a tree-shaped artifact, had \"845\" engraved on them in these numerals. During the exchange, Hunter was playing a game of sabacc with a Bith, with the credit chips lying on the table saying \"9 99\", using the same numbers.\n\nThe control panel in the cockpit of the Marauder displayed these numbers as Tech was teaching Omega how to fly. When Tech had to alert the rest of the team with some serious news, two lengthy chains of digits emerged on an alternate screen. The same data appeared on the screen while Tech briefed the rest of Clone Force 99 about his search through the Republic and Imperial files for information about the Advanced Science Division.\n\nAs CX-2 tracked Phee Genoa's starship, Providence, a blue monitor aboard Genoa's ship displayed a long list of Aurebesh numbers.\n\nSeveral years later, a sign over a door in the spice mines of Kessel used these numerals, reading \"D7 X371K\". They also appeared on monitors in Daiyu spaceport, and on blueprints of Fortress Inquisitorius available on the underwater stronghold's computers.\n\nPrior to the outbreak of the Galactic Civil War, these numerals were used in 7189, a wall mural in the Capital City of Lothal.\n\nDuring the Galactic Civil War, the numbers \"042 1792-46\" appeared on the display of a pair of binoculars used by Kes Dameron to spy on a Scarabi safe house during the rescue of Rebel Alliance leader Mon Mothma.\n\n",
        "section": "Imperial Era[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 430.0
      }
    },
    {
      "id": "2694",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Republic Era[]\n\nAround 233 BBY, these digits were inscribed on a set of Republic credit chips that Ansen Strung, a bounty hunter, used to purchase sap beverages for himself and a band of Jedi Initiates who had assisted him in locating a missing kibbin. The credits bore the numbers \"8 4 2\".\n\nAt the time of the Clone Wars, alternative numerals were engraved on the credit chips used by Jedi Master Yoda to pay Anthen for information on a mysterious Separatist weapon project called Operation: Titan. They also appeared on a map of destinations on the subtram in the Coruscant Underworld.\n\n",
        "section": "Republic Era[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 140.0
      }
    },
    {
      "id": "2698",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Fall of the Empire[]\n\nAfter the fall of the Galactic Empire, the console aboard Din Djarin's ship, the Razor Crest, used the same kind of numbers. They also appeared on a red monitor on the console of his N-1 starfighter, which said \"ALT 51\" and \"PSI 11\"; and on a small blue monitor on the opposite side of the console, which listed every number from 1 to 9. Curiously, the latter was upside-down.\n\nShortly afterward, the monitor on the control panel of a Six-O-Two Mitigator used by the New Republic Amnesty Program, listed every alternative numeral from 1 to 9, which represented different voltage levels.\n\nThe plaque on the statue of IG-11 in Nevarro City on Nevarro used these digits, while a local cafe's prices were written in these numerals.\n\nThe security camera monitoring room in the peacekeeping zone on Plazir-15 used alternative numerals, with \"CAMERA 7709-739\" appearing on on three different monitors, while another monitor said \"SECTOR 7G\". The also appeared on the business sign of Premium Droid Rentals, which said \"D7X\"; on spark pads, which read \"2311 PLAZIR 86\"; and on the console used by the lab tech.\n\nWhen Sabine Wren tried to crack into a HK-87 assassin droid's memory banks, the inscription on both sides of the datapad she used said \"ABC 1112 34\", using these numerals.\n\nWhen Ahsoka Tano sent Wren to man their shuttle's tail gun during an attack, these digits appeared on a monitor that Wren turned on in the gunner seat, reading \"1 2 3 4 5 6\".\n\nThe Eye of Sion's monitors used a special system to determine the hyperspace coordinates for its journey to Peridea; these were calculated using this numerical system. As the ship approached Peridea, these numbers appeared alongside regular Aurebesh letters on the monitor used by the Star Navigator Droid.\n\nAt Hera Syndulla' hearing in the New Republic's Defense Council building on Coruscant, a large panel was mounted on the wall. The headline on the left said \"NEW REPUBLIC\", and below that, there were red and blue cells labeled with alternative Aurebesh numerals. The headline on the right said \"HALL OF JUSTICE DOCKET\". The scrolling Aurebesh below the headline appeared to be a list of case files: Most of the names appeared to be nonsense, but a few lines on the list had the word \"CASE\" beside a random mixture of letters and alternative numerals.\n\nNeel, a youngling from At Attin, possessed a walkie talkie configured with Aurebesh settings, featuring numerous alternative numerals. It read:\n\nWhile the Skeleton Crew were preparing to jump to hyperspace during the escape from Port Borgo, the top of the cockpit screen featured the alternative numbers \"0720 07 01 07 019\". During their escape from the observatory moon, it displayed \"920 18 01 07 0009\".\n\nThe Fallen Sanctum on At Achrann contained pillars with galactic coordinates to all the lost Jewels of the Old Republic, where the coordinates were inscribed in alternative numerals. One column read:\n\nThe inscription on another post transliterated as:\n\nA computer used by Wendle on At Attin had \"NA76\" printed over the screen, using alternative numerals.\n\nA holographic readout of Captain Rennod's log contained alternative Aurebesh numbers, and transliterated as:\n\nThe following text subsequently appeared at the top:\n\nWhen the Onyx Cinder was pinned by a garbage machine on Lanupa, forcing the Skeleton Crew to turn on the emergency hull demolition sequencer and purge the hull, alternative numerals and Aurebesh text appeared on a circular monitor next to a switch that that Fern activated. The readout transliterated as:\n\n*Note that only the initial third of the Aurebesh letter E in the word \"range\" can be seen, while the remainder is inexplicably truncated.\n\nAs the children gazed at the greenish Barrier of At Attin, a circular cockpit monitor displayed the alternative numerals \"19 38\". When Jod Na Nawood and SM-33 noticed an incoming transmission on the Onyx Cinder's computer, the numbers \"012788 91 28 279 1520 08 01 07 0009\" appeared at the top of the monitor.\n\nWhen Navood was in the Supervisor's Tower on At Attin, fellow pirate Vane reported to him about a speeder bike incident. As Vane said, \"But don't worry. We got him.\" a small display on the panel before Navood read \"B09 19270\", using alternative numerals.\n\n",
        "section": "Fall of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 1006.0
      }
    },
    {
      "id": "2681",
      "title": "Flying attack droid",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Good articles",
          "Droid models"
        ],
        "content": "# Flying attack droid - History[]\n\nAround 9 ABY, the merchant Tuut Orial sold flying attack droids from a cart full of them on the pirate-infested asteroid Port Borgo, demonstrating the droids' abilities to those that passed by. The merchant called the droids a bargain and advertised them as lethal assassins with fascinating weaponry and novel toxins. During one demonstration, Orial threw a piece of fruit up into the air for a droid to slice in half.\n\nAn Aqualish observer then poked one of the demonstration droids, which responded by poking the Aqualish in the eye. One of the droids then began pursuing the watching child KB, who backed away from it into her friend Fern, after which the droid stopped following her. When a group of pirates later surrounded KB, Fern, and their friends Wim and Neel with the intent to rob them, the droid SM-33 came to their defense. SM-33 punched the pirate Vane into a stand by Orial's attack droid stall, attracting the attention of a trio of the flying attack droids, one of whom flew at SM-33 with its saw active. SM-33 then punched the attack droid out of the air.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Flying_attack_droid",
        "title": "Flying attack droid",
        "tokens": 256.0
      }
    },
    {
      "id": "2701",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Fall of the Empire[]\n\nAfter the fall of the Galactic Empire, the console aboard Din Djarin's ship, the Razor Crest, used the same kind of numbers. They also appeared on a red monitor on the console of his N-1 starfighter, which said \"ALT 51\" and \"PSI 11\"; and on a small blue monitor on the opposite side of the console, which listed every number from 1 to 9. Curiously, the latter was upside-down.\n\nShortly afterward, the monitor on the control panel of a Six-O-Two Mitigator used by the New Republic Amnesty Program, listed every alternative numeral from 1 to 9, which represented different voltage levels.\n\nThe plaque on the statue of IG-11 in Nevarro City on Nevarro used these digits, while a local cafe's prices were written in these numerals.\n\nThe security camera monitoring room in the peacekeeping zone on Plazir-15 used alternative numerals, with \"CAMERA 7709-739\" appearing on on three different monitors, while another monitor said \"SECTOR 7G\". The also appeared on the business sign of Premium Droid Rentals, which said \"D7X\"; on spark pads, which read \"2311 PLAZIR 86\"; and on the console used by the lab tech.\n\nWhen Sabine Wren tried to crack into a HK-87 assassin droid's memory banks, the inscription on both sides of the datapad she used said \"ABC 1112 34\", using these numerals.\n\nWhen Ahsoka Tano sent Wren to man their shuttle's tail gun during an attack, these digits appeared on a monitor that Wren turned on in the gunner seat, reading \"1 2 3 4 5 6\".\n\nThe Eye of Sion's monitors used a special system to determine the hyperspace coordinates for its journey to Peridea; these were calculated using this numerical system. As the ship approached Peridea, these numbers appeared alongside regular Aurebesh letters on the monitor used by the Star Navigator Droid.\n\nAt Hera Syndulla' hearing in the New Republic's Defense Council building on Coruscant, a large panel was mounted on the wall. The headline on the left said \"NEW REPUBLIC\", and below that, there were red and blue cells labeled with alternative Aurebesh numerals. The headline on the right said \"HALL OF JUSTICE DOCKET\". The scrolling Aurebesh below the headline appeared to be a list of case files: Most of the names appeared to be nonsense, but a few lines on the list had the word \"CASE\" beside a random mixture of letters and alternative numerals.\n\nNeel, a youngling from At Attin, possessed a walkie talkie configured with Aurebesh settings, featuring numerous alternative numerals. It read:\n\nWhile the Skeleton Crew were preparing to jump to hyperspace during the escape from Port Borgo, the top of the cockpit screen featured the alternative numbers \"0720 07 01 07 019\". During their escape from the observatory moon, it displayed \"920 18 01 07 0009\".\n\nThe Fallen Sanctum on At Achrann contained pillars with galactic coordinates to all the lost Jewels of the Old Republic, where the coordinates were inscribed in alternative numerals. One column read:\n\nThe inscription on another post transliterated as:\n\nA computer used by Wendle on At Attin had \"NA76\" printed over the screen, using alternative numerals.\n\nA holographic readout of Captain Rennod's log contained alternative Aurebesh numbers, and transliterated as:\n\nThe following text subsequently appeared at the top:\n\nWhen the Onyx Cinder was pinned by a garbage machine on Lanupa, forcing the Skeleton Crew to turn on the emergency hull demolition sequencer and purge the hull, alternative numerals and Aurebesh text appeared on a circular monitor next to a switch that that Fern activated. The readout transliterated as:\n\n*Note that only the initial third of the Aurebesh letter E in the word \"range\" can be seen, while the remainder is inexplicably truncated.\n\nAs the children gazed at the greenish Barrier of At Attin, a circular cockpit monitor displayed the alternative numerals \"19 38\". When Jod Na Nawood and SM-33 noticed an incoming transmission on the Onyx Cinder's computer, the numbers \"012788 91 28 279 1520 08 01 07 0009\" appeared at the top of the monitor.",
        "section": "Fall of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 941.0
      }
    },
    {
      "id": "2706",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Rise of the First Order[]\n\nShortly before the outbreak of the First Order-Resistance War, the logo of 8Key contained the number 8 written in this script. The business was advertised on the chassis of R4-G77, an astromech droid owned by Hype Fazon, a racer pilot on the Colossus refueling station.\n\nDuring the war, rank insignia of the First Order utilized this system, with the numbers appearing in the insignias for sergeant (\"Ro 8\") and squad leader (\"Hal 4\"). The \"Hal 4\" insignia was worn by Lank Paze, while the \"Ro 8\" insignia could be seen on Armitage Hux's First Order monitor. When Resistance pilot Poe Dameron was communicating with General Hux over the intercom during the evacuation of D'Qar, a computer monitor aboard the Finalizer, which showed an Aurebesh transcription of Dameron's words, was filled with digits presented in this alternative format. The databank of the Libertine, which DJ gained access to after he stole the Star Yacht in Canto Bight, used these numerals to list prices in the owner's catalog of starfighters for sale.\n\nRex, an RX-Series pilot droid who provided musical entertainment i Oga's Cantina on Batuu,\nhad an inscription, \"RX24,\" on his chest, using alternative numerals.\n\n",
        "section": "Rise of the First Order[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 298.0
      }
    },
    {
      "id": "2704",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Fall of the Empire[]\n\nWhen Navood was in the Supervisor's Tower on At Attin, fellow pirate Vane reported to him about a speeder bike incident. As Vane said, \"But don't worry. We got him.\" a small display on the panel before Navood read \"B09 19270\", using alternative numerals.",
        "section": "Fall of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 79.0
      }
    },
    {
      "id": "2845",
      "title": "11011101 2",
      "metadata": {
        "categories": [
          "Legends articles",
          "Songs"
        ],
        "content": "# 11011101 2 - Behind the scenes[]\n\nIn the binary numeral system, the number 11011101 is 221 in base ten.\n\n",
        "section": "Behind the scenes[]",
        "source": "https://starwars.fandom.com/wiki/11011101_2",
        "title": "11011101 2",
        "tokens": 32.0
      }
    },
    {
      "id": "3123",
      "title": "Flying attack droid",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Good articles",
          "Droid models"
        ],
        "content": "# Flying attack droid - History[]\n\nAround 9 ABY, the merchant Tuut Orial sold flying attack droids from a cart full of them on the pirate-infested asteroid Port Borgo, demonstrating the droids' abilities to those that passed by. The merchant called the droids a bargain and advertised them as lethal assassins with fascinating weaponry and novel toxins. During one demonstration, Orial threw a piece of fruit up into the air for a droid to slice in half.\n\nAn Aqualish observer then poked one of the demonstration droids, which responded by poking the Aqualish in the eye. One of the droids then began pursuing the watching child KB, who backed away from it into her friend Fern, after which the droid stopped following her. When a group of pirates later surrounded KB, Fern, and their friends Wim and Neel with the intent to rob them, the droid SM-33 came to their defense. SM-33 punched the pirate Vane into a stand by Orial's attack droid stall, attracting the attention of a trio of the flying attack droids, one of whom flew at SM-33 with its saw active. SM-33 then punched the attack droid out of the air.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Flying_attack_droid",
        "title": "Flying attack droid",
        "tokens": 256.0
      }
    },
    {
      "id": "3508",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Description[]\n\nThe numerals were completely different from regular Aurebesh numbers, using an alternate numerical system based on dots and lines.\n\n",
        "section": "Description[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 35.0
      }
    },
    {
      "id": "3538",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Rise of the First Order[]\n\nShortly before the outbreak of the First Order-Resistance War, the logo of 8Key contained the number 8 written in this script. The business was advertised on the chassis of R4-G77, an astromech droid owned by Hype Fazon, a racer pilot on the Colossus refueling station.\n\nDuring the war, rank insignia of the First Order utilized this system, with the numbers appearing in the insignias for sergeant (\"Ro 8\") and squad leader (\"Hal 4\"). The \"Hal 4\" insignia was worn by Lank Paze, while the \"Ro 8\" insignia could be seen on Armitage Hux's First Order monitor. When Resistance pilot Poe Dameron was communicating with General Hux over the intercom during the evacuation of D'Qar, a computer monitor aboard the Finalizer, which showed an Aurebesh transcription of Dameron's words, was filled with digits presented in this alternative format. The databank of the Libertine, which DJ gained access to after he stole the Star Yacht in Canto Bight, used these numerals to list prices in the owner's catalog of starfighters for sale.\n\nRex, an RX-Series pilot droid who provided musical entertainment i Oga's Cantina on Batuu,\nhad an inscription, \"RX24,\" on his chest, using alternative numerals.\n\n",
        "section": "Rise of the First Order[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 298.0
      }
    },
    {
      "id": "3503",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals\n\nUnidentified Aurebesh numerals\n\n\n\nUsers\nFirst OrderGalactic EmpireImperial SenateKorfé Bennux-AiNew RepublicTak RennodTech\n\n\nLocations\nAt AchrannAt AttinCoruscantDaiyuKesselLothalNevarroNurPlazir-15\n\n\n[Source]\n\nAn alternate form of Aurebesh numerals was used in the galaxy. Completely different from regular Aurebesh, the numbers were used on At Achrann, At Attin, Coruscant, Daiyu, Kessel, Lothal, Nevarro, Nur and Plazir-15; on credit chips and in Tech's visor; by the Galactic Empire and their senate, and the New Republic; on the console of the Razor Crest, on a monitor in the Providence and Ahsoka Tano's shuttle, on the Eye of Sion's special galactic coordinates calculation monitors, on the cockpit monitor of the Onyx Cinder, in the rank insignia of the First Order, and in the Star Yacht Libertine's databank.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 229.0
      }
    },
    {
      "id": "3534",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Fall of the Empire[]\n\nWhen Navood was in the Supervisor's Tower on At Attin, fellow pirate Vane reported to him about a speeder bike incident. As Vane said, \"But don't worry. We got him.\" a small display on the panel before Navood read \"B09 19270\", using alternative numerals.",
        "section": "Fall of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 79.0
      }
    },
    {
      "id": "3514",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Imperial Era[]\n\nAfter the Clone Wars ended, the numbers were used on monitors in the repulsorpods in the Imperial Senate, although regular Aurebesh numbers were also in use.\n\nAlso during this time period, Clone Force 99 member Tech wore a special visor that could be used to scan his surroundings. When used in Cid's mine, the scan resulted in \"IPSIUM DETECTED\", followed by a list of alternate numerals.\n\nA set of credit chips in a case that Omega handed to Lanse Crowder as payment for a tree-shaped artifact, had \"845\" engraved on them in these numerals. During the exchange, Hunter was playing a game of sabacc with a Bith, with the credit chips lying on the table saying \"9 99\", using the same numbers.\n\nThe control panel in the cockpit of the Marauder displayed these numbers as Tech was teaching Omega how to fly. When Tech had to alert the rest of the team with some serious news, two lengthy chains of digits emerged on an alternate screen. The same data appeared on the screen while Tech briefed the rest of Clone Force 99 about his search through the Republic and Imperial files for information about the Advanced Science Division.\n\nAs CX-2 tracked Phee Genoa's starship, Providence, a blue monitor aboard Genoa's ship displayed a long list of Aurebesh numbers.\n\nSeveral years later, a sign over a door in the spice mines of Kessel used these numerals, reading \"D7 X371K\". They also appeared on monitors in Daiyu spaceport, and on blueprints of Fortress Inquisitorius available on the underwater stronghold's computers.\n\nPrior to the outbreak of the Galactic Civil War, these numerals were used in 7189, a wall mural in the Capital City of Lothal.\n\nDuring the Galactic Civil War, the numbers \"042 1792-46\" appeared on the display of a pair of binoculars used by Kes Dameron to spy on a Scarabi safe house during the rescue of Rebel Alliance leader Mon Mothma.\n\n",
        "section": "Imperial Era[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 430.0
      }
    },
    {
      "id": "3531",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Fall of the Empire[]\n\nAfter the fall of the Galactic Empire, the console aboard Din Djarin's ship, the Razor Crest, used the same kind of numbers. They also appeared on a red monitor on the console of his N-1 starfighter, which said \"ALT 51\" and \"PSI 11\"; and on a small blue monitor on the opposite side of the console, which listed every number from 1 to 9. Curiously, the latter was upside-down.\n\nShortly afterward, the monitor on the control panel of a Six-O-Two Mitigator used by the New Republic Amnesty Program, listed every alternative numeral from 1 to 9, which represented different voltage levels.\n\nThe plaque on the statue of IG-11 in Nevarro City on Nevarro used these digits, while a local cafe's prices were written in these numerals.\n\nThe security camera monitoring room in the peacekeeping zone on Plazir-15 used alternative numerals, with \"CAMERA 7709-739\" appearing on on three different monitors, while another monitor said \"SECTOR 7G\". The also appeared on the business sign of Premium Droid Rentals, which said \"D7X\"; on spark pads, which read \"2311 PLAZIR 86\"; and on the console used by the lab tech.\n\nWhen Sabine Wren tried to crack into a HK-87 assassin droid's memory banks, the inscription on both sides of the datapad she used said \"ABC 1112 34\", using these numerals.\n\nWhen Ahsoka Tano sent Wren to man their shuttle's tail gun during an attack, these digits appeared on a monitor that Wren turned on in the gunner seat, reading \"1 2 3 4 5 6\".\n\nThe Eye of Sion's monitors used a special system to determine the hyperspace coordinates for its journey to Peridea; these were calculated using this numerical system. As the ship approached Peridea, these numbers appeared alongside regular Aurebesh letters on the monitor used by the Star Navigator Droid.\n\nAt Hera Syndulla' hearing in the New Republic's Defense Council building on Coruscant, a large panel was mounted on the wall. The headline on the left said \"NEW REPUBLIC\", and below that, there were red and blue cells labeled with alternative Aurebesh numerals. The headline on the right said \"HALL OF JUSTICE DOCKET\". The scrolling Aurebesh below the headline appeared to be a list of case files: Most of the names appeared to be nonsense, but a few lines on the list had the word \"CASE\" beside a random mixture of letters and alternative numerals.\n\nNeel, a youngling from At Attin, possessed a walkie talkie configured with Aurebesh settings, featuring numerous alternative numerals. It read:\n\nWhile the Skeleton Crew were preparing to jump to hyperspace during the escape from Port Borgo, the top of the cockpit screen featured the alternative numbers \"0720 07 01 07 019\". During their escape from the observatory moon, it displayed \"920 18 01 07 0009\".\n\nThe Fallen Sanctum on At Achrann contained pillars with galactic coordinates to all the lost Jewels of the Old Republic, where the coordinates were inscribed in alternative numerals. One column read:\n\nThe inscription on another post transliterated as:\n\nA computer used by Wendle on At Attin had \"NA76\" printed over the screen, using alternative numerals.\n\nA holographic readout of Captain Rennod's log contained alternative Aurebesh numbers, and transliterated as:\n\nThe following text subsequently appeared at the top:\n\nWhen the Onyx Cinder was pinned by a garbage machine on Lanupa, forcing the Skeleton Crew to turn on the emergency hull demolition sequencer and purge the hull, alternative numerals and Aurebesh text appeared on a circular monitor next to a switch that that Fern activated. The readout transliterated as:\n\n*Note that only the initial third of the Aurebesh letter E in the word \"range\" can be seen, while the remainder is inexplicably truncated.\n\nAs the children gazed at the greenish Barrier of At Attin, a circular cockpit monitor displayed the alternative numerals \"19 38\". When Jod Na Nawood and SM-33 noticed an incoming transmission on the Onyx Cinder's computer, the numbers \"012788 91 28 279 1520 08 01 07 0009\" appeared at the top of the monitor.",
        "section": "Fall of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 941.0
      }
    },
    {
      "id": "3511",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Republic Era[]\n\nAround 233 BBY, these digits were inscribed on a set of Republic credit chips that Ansen Strung, a bounty hunter, used to purchase sap beverages for himself and a band of Jedi Initiates who had assisted him in locating a missing kibbin. The credits bore the numbers \"8 4 2\".\n\nAt the time of the Clone Wars, alternative numerals were engraved on the credit chips used by Jedi Master Yoda to pay Anthen for information on a mysterious Separatist weapon project called Operation: Titan. They also appeared on a map of destinations on the subtram in the Coruscant Underworld.\n\n",
        "section": "Republic Era[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 140.0
      }
    },
    {
      "id": "3518",
      "title": "Alternative Aurebesh numerals",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles with conjectural titles",
          "Aurebesh"
        ],
        "content": "# Alternative Aurebesh numerals - Fall of the Empire[]\n\nAfter the fall of the Galactic Empire, the console aboard Din Djarin's ship, the Razor Crest, used the same kind of numbers. They also appeared on a red monitor on the console of his N-1 starfighter, which said \"ALT 51\" and \"PSI 11\"; and on a small blue monitor on the opposite side of the console, which listed every number from 1 to 9. Curiously, the latter was upside-down.\n\nShortly afterward, the monitor on the control panel of a Six-O-Two Mitigator used by the New Republic Amnesty Program, listed every alternative numeral from 1 to 9, which represented different voltage levels.\n\nThe plaque on the statue of IG-11 in Nevarro City on Nevarro used these digits, while a local cafe's prices were written in these numerals.\n\nThe security camera monitoring room in the peacekeeping zone on Plazir-15 used alternative numerals, with \"CAMERA 7709-739\" appearing on on three different monitors, while another monitor said \"SECTOR 7G\". The also appeared on the business sign of Premium Droid Rentals, which said \"D7X\"; on spark pads, which read \"2311 PLAZIR 86\"; and on the console used by the lab tech.\n\nWhen Sabine Wren tried to crack into a HK-87 assassin droid's memory banks, the inscription on both sides of the datapad she used said \"ABC 1112 34\", using these numerals.\n\nWhen Ahsoka Tano sent Wren to man their shuttle's tail gun during an attack, these digits appeared on a monitor that Wren turned on in the gunner seat, reading \"1 2 3 4 5 6\".\n\nThe Eye of Sion's monitors used a special system to determine the hyperspace coordinates for its journey to Peridea; these were calculated using this numerical system. As the ship approached Peridea, these numbers appeared alongside regular Aurebesh letters on the monitor used by the Star Navigator Droid.\n\nAt Hera Syndulla' hearing in the New Republic's Defense Council building on Coruscant, a large panel was mounted on the wall. The headline on the left said \"NEW REPUBLIC\", and below that, there were red and blue cells labeled with alternative Aurebesh numerals. The headline on the right said \"HALL OF JUSTICE DOCKET\". The scrolling Aurebesh below the headline appeared to be a list of case files: Most of the names appeared to be nonsense, but a few lines on the list had the word \"CASE\" beside a random mixture of letters and alternative numerals.\n\nNeel, a youngling from At Attin, possessed a walkie talkie configured with Aurebesh settings, featuring numerous alternative numerals. It read:\n\nWhile the Skeleton Crew were preparing to jump to hyperspace during the escape from Port Borgo, the top of the cockpit screen featured the alternative numbers \"0720 07 01 07 019\". During their escape from the observatory moon, it displayed \"920 18 01 07 0009\".\n\nThe Fallen Sanctum on At Achrann contained pillars with galactic coordinates to all the lost Jewels of the Old Republic, where the coordinates were inscribed in alternative numerals. One column read:\n\nThe inscription on another post transliterated as:\n\nA computer used by Wendle on At Attin had \"NA76\" printed over the screen, using alternative numerals.\n\nA holographic readout of Captain Rennod's log contained alternative Aurebesh numbers, and transliterated as:\n\nThe following text subsequently appeared at the top:\n\nWhen the Onyx Cinder was pinned by a garbage machine on Lanupa, forcing the Skeleton Crew to turn on the emergency hull demolition sequencer and purge the hull, alternative numerals and Aurebesh text appeared on a circular monitor next to a switch that that Fern activated. The readout transliterated as:\n\n*Note that only the initial third of the Aurebesh letter E in the word \"range\" can be seen, while the remainder is inexplicably truncated.\n\nAs the children gazed at the greenish Barrier of At Attin, a circular cockpit monitor displayed the alternative numerals \"19 38\". When Jod Na Nawood and SM-33 noticed an incoming transmission on the Onyx Cinder's computer, the numbers \"012788 91 28 279 1520 08 01 07 0009\" appeared at the top of the monitor.\n\nWhen Navood was in the Supervisor's Tower on At Attin, fellow pirate Vane reported to him about a speeder bike incident. As Vane said, \"But don't worry. We got him.\" a small display on the panel before Navood read \"B09 19270\", using alternative numerals.\n\n",
        "section": "Fall of the Empire[]",
        "source": "https://starwars.fandom.com/wiki/Alternative_Aurebesh_numerals",
        "title": "Alternative Aurebesh numerals",
        "tokens": 1006.0
      }
    },
    {
      "id": "3722",
      "title": "The High Republic: Tempest Runner (script)",
      "metadata": {
        "categories": [
          "Real-world media",
          "Articles with an excess of redlinks",
          "2022 releases",
          "3 more",
          "Incomplete Appearances",
          "Star Wars: The High Republic",
          "Script books"
        ],
        "content": "# The High Republic: Tempest Runner (script) - Publisher's summary[]\n\nDelve into the cutthroat world of one of the High Republic's greatest foes, the merciless Lourna Dee, in this full script for the Star Wars audio original Tempest Runner.\n\nThe Nihil storm has raged through the galaxy, leaving chaos and grief in its wake. Few of its raiders are as vicious as the Tempest Runner Lourna Dee. She stays one step ahead of the Jedi Order at the helm of a vessel named after one of the deadliest monsters in the galaxy: the Lourna Dee. But no one can outrun the defenders of the High Republic forever.\n\nAfter the defeat of her crew, Lourna falls into the hands of the Jedi–but not before she hides her identity, becoming just another Nihil convict. Her captors fail to understand the beast they have cornered. Just like every fool she's ever buried, their first mistake was keeping her alive.\n\nLourna is determined to make underestimating her their last.\n\nLocked onto a Republic correctional ship, she's dragged across the galaxy to repair the very damage she and her fellow Tempest Runners inflicted on it. But as Lourna plans her glorious escape, she makes alliances that grow dangerously close to friendships. Outside the Nihil—separated from her infamous ship, her terrifying arsenal, and her feared name—Lourna must carve her own path. But will it lead to redemption? Or will she emerge as a deadlier threat than ever before?\n\n",
        "section": "Publisher's summary[]",
        "source": "https://starwars.fandom.com/wiki/The_High_Republic:_Tempest_Runner_%28script%29",
        "title": "The High Republic: Tempest Runner (script)",
        "tokens": 316.0
      }
    },
    {
      "id": "3881",
      "title": "Torture",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Society and culture"
        ],
        "content": "# Torture\n\nTorture was a means of punishment, interrogation, pleasure or a combination, through causing physical pain and could result in death. It was considered unethical to torture a prisoner, but it was a practice used by the Nihil marauders, the Confederacy of Independent Systems, the Galactic Republic (in secret under certain officers), the Galactic Empire, the Grysk Hegemony, the Partisans, and the First Order.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Torture",
        "title": "Torture",
        "tokens": 89.0
      }
    },
    {
      "id": "3884",
      "title": "Torture",
      "metadata": {
        "categories": [
          "Canon articles",
          "Articles to be expanded",
          "Society and culture"
        ],
        "content": "# Torture - Republic Era[]\n\nThe Nihil marauders made use of torture during the High Republic Era.\n\nThe Tusken Raider nomads of Tatooine practiced ritual torture of captives. Shmi Skywalker Lars was captured and tortured to the point of death.\n\n",
        "section": "Republic Era[]",
        "source": "https://starwars.fandom.com/wiki/Torture",
        "title": "Torture",
        "tokens": 55.0
      }
    },
    {
      "id": "4632",
      "title": "Demolisher weapons droid",
      "metadata": {
        "categories": [
          "Legends articles",
          "Droid models"
        ],
        "content": "# Demolisher weapons droid - History[]\n\nWhile captive aboard the Demolisher, C-3PO and R2-D2 were assigned by Captain Gir Kybo Ren-Cha to work with a droid of unidentified model loading missiles in preparation for an attack on Tammuz-an. As the unidentified droid operated the conveyor belt that carried the missiles, R2-D2 intentionally loaded one of the missiles backward. Once the missile was set to be launched, it would backfire, damaging the pirate's stolen Star Destroyer. To prevent his sabotage from being discovered, R2-D2 maneuvered a large overhead electromagnet over to the weapons droid, picked the droid up, and dropped it on the conveyor belt along with the missiles.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Demolisher_weapons_droid",
        "title": "Demolisher weapons droid",
        "tokens": 153.0
      }
    },
    {
      "id": "7621",
      "title": "Unidentified Weequay 2 (Balnab)",
      "metadata": {
        "categories": [
          "Legends articles",
          "Articles with conjectural titles",
          "Pages needing citation",
          "4 more",
          "Character stubs",
          "Males",
          "Pirates",
          "Weequays"
        ],
        "content": "# Unidentified Weequay 2 (Balnab) - Biography[]\n\nAround 21 BBY, this Weequay and a fellow one landed on the planet Balnab and found a Galactic Republic Y-Wing starfighter and two deactivated droids, protocol droid C-3PO and astromech droid R2-D2. The Weequays then brought the droids aboard their ship to use as entertainment for gladiatorial droid fights.\n\nHowever, their ship, the Marauder, was detected by Separatist General Grievous who ordered that their ship be used as target practice and opened fire from his Providence-class carrier/destroyer. The Marauder was eventually destroyed and all the occupants, including this Weequay, were killed.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Unidentified_Weequay_2_%28Balnab%29",
        "title": "Unidentified Weequay 2 (Balnab)",
        "tokens": 159.0
      }
    },
    {
      "id": "8444",
      "title": "DJ-88",
      "metadata": {
        "categories": [
          "Legends articles",
          "Class three droids",
          "Droids of the Jedi Order",
          "3 more",
          "Droids with he/him pronouns",
          "Droids with masculine programming",
          "Educators"
        ],
        "content": "# DJ-88 - Characteristics[]\n\nA class three droid, DJ-88 belonged to the most advanced class of droids ever invented. A towering robot, the caretaker had a white plating and vaguely looked a stormtrooper from a distance. It had a strong, dignified face complete with a metallic beard-like appendage and radiant red photoreceptors that shone like rubies. DJ-88 lacked any offensive equipment, but he could raise his hands and release a foggy white smoke from his fingertips. This blinding mist was used as a means of defense against enemies, as a screening device to cover the droid's movements.\n\n",
        "section": "Characteristics[]",
        "source": "https://starwars.fandom.com/wiki/DJ-88",
        "title": "DJ-88",
        "tokens": 132.0
      }
    },
    {
      "id": "8523",
      "title": "Unidentified Weequay (Balnab)",
      "metadata": {
        "categories": [
          "Legends articles",
          "Articles with conjectural titles",
          "Pages needing citation",
          "4 more",
          "Character stubs",
          "Males",
          "Pirates",
          "Weequays"
        ],
        "content": "# Unidentified Weequay (Balnab) - Biography[]\n\nAround 21 BBY, this Weequay and a fellow one landed on the planet Balnab and found a Galactic Republic Y-Wing starfighter and two deactivated droids, protocol droid C-3PO and astromech droid R2-D2. The Weequays then brought the droids aboard their ship to use as entertainment for gladiatorial droid fights.\n\nHowever, their ship, the Marauder was detected by Separatist General Grievous who ordered that their ship be used as target practice and opened fire from his Providence-class carrier/destroyer. The Marauder was eventually destroyed and all the occupants, including this Weequay, were killed.\n\n",
        "section": "Biography[]",
        "source": "https://starwars.fandom.com/wiki/Unidentified_Weequay_%28Balnab%29",
        "title": "Unidentified Weequay (Balnab)",
        "tokens": 156.0
      }
    },
    {
      "id": "9083",
      "title": "Box freighter",
      "metadata": {
        "categories": [
          "Canon articles",
          "Freighter classes"
        ],
        "content": "# Box freighter\n\nBox freighters were a large and somewhat unwieldy model of cargo freighter used by the Galactic Empire during the Imperial Era. One type of box freighter was the Max-7 Rono box freighter. Vel Sartha and her team planned to steal a Max-7 Rono and escape from the Imperial garrison on Aldhani with the entire Imperial payroll for the sector.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Box_freighter",
        "title": "Box freighter",
        "tokens": 82.0
      }
    },
    {
      "id": "9127",
      "title": "Switchback",
      "metadata": {
        "categories": [
          "Canon articles",
          "Ship stubs",
          "Transports"
        ],
        "content": "# Switchback\n\nSwitchback\n\n\nProduction information\n\nType\nCargo hauler\n\n\n\nTechnical specifications\n\nHyperdrive system\nEquipped\n\n\nEscape craft\nEquipped\n\n\n\nUsage\n\nOwner(s)\nChancey YarrowSylvestri Yarrow\n\n\nCrewmembers\nNeeto JanajanaM-227\n\n\n[Source]\n\nThe Switchback was a cargo hauler owned by Chancey and Sylvestri Yarrow, the latter of whom inherited it after Chancey's death in a Nihil attack. Other crew members included Neeto Janajana and M-227. Sylvestri was forced to abandon the starship after it was captured by the Nihil in the Berenge sector, in an attack which revealed they had the ability to force ships out of hyperspace.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Switchback",
        "title": "Switchback",
        "tokens": 157.0
      }
    },
    {
      "id": "9166",
      "title": "Flying attack droid",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Good articles",
          "Droid models"
        ],
        "content": "# Flying attack droid - History[]\n\nAround 9 ABY, the merchant Tuut Orial sold flying attack droids from a cart full of them on the pirate-infested asteroid Port Borgo, demonstrating the droids' abilities to those that passed by. The merchant called the droids a bargain and advertised them as lethal assassins with fascinating weaponry and novel toxins. During one demonstration, Orial threw a piece of fruit up into the air for a droid to slice in half.\n\nAn Aqualish observer then poked one of the demonstration droids, which responded by poking the Aqualish in the eye. One of the droids then began pursuing the watching child KB, who backed away from it into her friend Fern, after which the droid stopped following her. When a group of pirates later surrounded KB, Fern, and their friends Wim and Neel with the intent to rob them, the droid SM-33 came to their defense. SM-33 punched the pirate Vane into a stand by Orial's attack droid stall, attracting the attention of a trio of the flying attack droids, one of whom flew at SM-33 with its saw active. SM-33 then punched the attack droid out of the air.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Flying_attack_droid",
        "title": "Flying attack droid",
        "tokens": 256.0
      }
    },
    {
      "id": "9115",
      "title": "Switchback",
      "metadata": {
        "categories": [
          "Canon articles",
          "Ship stubs",
          "Transports"
        ],
        "content": "# Switchback\n\nSwitchback\n\n\nProduction information\n\nType\nCargo hauler\n\n\n\nTechnical specifications\n\nHyperdrive system\nEquipped\n\n\nEscape craft\nEquipped\n\n\n\nUsage\n\nOwner(s)\nChancey YarrowSylvestri Yarrow\n\n\nCrewmembers\nNeeto JanajanaM-227\n\n\n[Source]\n\nThe Switchback was a cargo hauler owned by Chancey and Sylvestri Yarrow, the latter of whom inherited it after Chancey's death in a Nihil attack. Other crew members included Neeto Janajana and M-227. Sylvestri was forced to abandon the starship after it was captured by the Nihil in the Berenge sector, in an attack which revealed they had the ability to force ships out of hyperspace.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Switchback",
        "title": "Switchback",
        "tokens": 157.0
      }
    },
    {
      "id": "9100",
      "title": "Box freighter",
      "metadata": {
        "categories": [
          "Canon articles",
          "Freighter classes"
        ],
        "content": "# Box freighter\n\nBox freighters were a large and somewhat unwieldy model of cargo freighter used by the Galactic Empire during the Imperial Era. One type of box freighter was the Max-7 Rono box freighter. Vel Sartha and her team planned to steal a Max-7 Rono and escape from the Imperial garrison on Aldhani with the entire Imperial payroll for the sector.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Box_freighter",
        "title": "Box freighter",
        "tokens": 82.0
      }
    },
    {
      "id": "9182",
      "title": "Flying attack droid",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Good articles",
          "Droid models"
        ],
        "content": "# Flying attack droid - History[]\n\nAround 9 ABY, the merchant Tuut Orial sold flying attack droids from a cart full of them on the pirate-infested asteroid Port Borgo, demonstrating the droids' abilities to those that passed by. The merchant called the droids a bargain and advertised them as lethal assassins with fascinating weaponry and novel toxins. During one demonstration, Orial threw a piece of fruit up into the air for a droid to slice in half.\n\nAn Aqualish observer then poked one of the demonstration droids, which responded by poking the Aqualish in the eye. One of the droids then began pursuing the watching child KB, who backed away from it into her friend Fern, after which the droid stopped following her. When a group of pirates later surrounded KB, Fern, and their friends Wim and Neel with the intent to rob them, the droid SM-33 came to their defense. SM-33 punched the pirate Vane into a stand by Orial's attack droid stall, attracting the attention of a trio of the flying attack droids, one of whom flew at SM-33 with its saw active. SM-33 then punched the attack droid out of the air.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Flying_attack_droid",
        "title": "Flying attack droid",
        "tokens": 256.0
      }
    },
    {
      "id": "9384",
      "title": "Switchback",
      "metadata": {
        "categories": [
          "Canon articles",
          "Ship stubs",
          "Transports"
        ],
        "content": "# Switchback\n\nSwitchback\n\n\nProduction information\n\nType\nCargo hauler\n\n\n\nTechnical specifications\n\nHyperdrive system\nEquipped\n\n\nEscape craft\nEquipped\n\n\n\nUsage\n\nOwner(s)\nChancey YarrowSylvestri Yarrow\n\n\nCrewmembers\nNeeto JanajanaM-227\n\n\n[Source]\n\nThe Switchback was a cargo hauler owned by Chancey and Sylvestri Yarrow, the latter of whom inherited it after Chancey's death in a Nihil attack. Other crew members included Neeto Janajana and M-227. Sylvestri was forced to abandon the starship after it was captured by the Nihil in the Berenge sector, in an attack which revealed they had the ability to force ships out of hyperspace.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Switchback",
        "title": "Switchback",
        "tokens": 157.0
      }
    },
    {
      "id": "9334",
      "title": "Box freighter",
      "metadata": {
        "categories": [
          "Canon articles",
          "Freighter classes"
        ],
        "content": "# Box freighter\n\nBox freighters were a large and somewhat unwieldy model of cargo freighter used by the Galactic Empire during the Imperial Era. One type of box freighter was the Max-7 Rono box freighter. Vel Sartha and her team planned to steal a Max-7 Rono and escape from the Imperial garrison on Aldhani with the entire Imperial payroll for the sector.\n\n",
        "section": "Introduction",
        "source": "https://starwars.fandom.com/wiki/Box_freighter",
        "title": "Box freighter",
        "tokens": 82.0
      }
    },
    {
      "id": "9449",
      "title": "Flying attack droid",
      "metadata": {
        "categories": [
          "Canon articles",
          "Wookieepedia Good articles",
          "Droid models"
        ],
        "content": "# Flying attack droid - History[]\n\nAround 9 ABY, the merchant Tuut Orial sold flying attack droids from a cart full of them on the pirate-infested asteroid Port Borgo, demonstrating the droids' abilities to those that passed by. The merchant called the droids a bargain and advertised them as lethal assassins with fascinating weaponry and novel toxins. During one demonstration, Orial threw a piece of fruit up into the air for a droid to slice in half.\n\nAn Aqualish observer then poked one of the demonstration droids, which responded by poking the Aqualish in the eye. One of the droids then began pursuing the watching child KB, who backed away from it into her friend Fern, after which the droid stopped following her. When a group of pirates later surrounded KB, Fern, and their friends Wim and Neel with the intent to rob them, the droid SM-33 came to their defense. SM-33 punched the pirate Vane into a stand by Orial's attack droid stall, attracting the attention of a trio of the flying attack droids, one of whom flew at SM-33 with its saw active. SM-33 then punched the attack droid out of the air.\n\n",
        "section": "History[]",
        "source": "https://starwars.fandom.com/wiki/Flying_attack_droid",
        "title": "Flying attack droid",
        "tokens": 256.0
      }
    }
  ]
}